[
  {
    "source": "Times of Israel",
    "title": "Hamas says ready for indirect talks to resolve ‘points of contention’ on Gaza deal",
    "url": "https://www.timesofisrael.com/hamas-says-ready-for-indirect-talks-to-resolve-points-of-contention-on-gaza-deal/",
    "content": "Hamas announced Sunday that it was prepared to immediately begin a new round of indirect negotiations on remaining “points of contention” amid pressure from mediators to soften its stance, after the terror group submitted a response to a US ceasefire and hostage deal proposal that Washington called “totally unacceptable.”\n\nHamas said in a statement that its goal for the new talks would be to reach a deal that “ensures relief for our people and an end to the humanitarian catastrophe, ultimately leading to a permanent ceasefire and the complete withdrawal of the occupation forces.”\n\nThe terror group didn’t say that it had rescinded or revised the proposal that it submitted on Saturday to US special envoy Steve Witkoff.\n\nWitkoffsaidSaturday that the Hamas response “takes us backward,” adding that he had wanted Hamas to accept his “framework proposal” as the basis for a round of “proximity talks” to be held in the coming days.\n\nUS President Donald Trump hadindicatedon Friday that a deal could be announced later that day or on Saturday. Witkoff’s statement was the first time he had publicly revealed that his proposal had only been a starting point for another round of talks.\n\nHamas in its Sunday statement appeared to confirm its willingness to hold those talks.\n\nHamas’s Saturday response to Witkoff made a series of amendments to the US envoy’s proposal, including one that that would make it more difficult for Israel to resume fighting if talks on a permanent ceasefire are not completed by the end of 60-day truce outlined by the US, a source directly involved in the negotiations said.\n\nThe updated proposal submitted by Hamas also envisions the release of the 10 hostages being spread out more throughout the two-month truce, rather than in two batches on the first and seventh day, as Witkoff stipulates, according to the source.\n\nThis change was aimed at preventing Prime Minister Benjamin Netanyahu from abandoning talks on a permanent ceasefire after the 10 hostages are released or refusing to engage in the talks altogether, as he did during the previous ceasefire, which ended in March when Israel resumed intensive fighting in Gaza.\n\nThe Sunday Hamas statement also made a point of thanking Arab mediators Qatar and Egypt for their efforts to bring about a ceasefire. Hours earlier, the two countries issued a joint statement “emphasizing the importance of intensifying efforts to overcome the obstacles facing the negotiations.\n\nNetanyahu’s office said Sunday that Israel had accepted the Witkoff proposal. However, his cabinet has yet to hold a vote on it and several far-right ministers have expressed their opposition.\n\nThe US proposal was formulated in close coordination with Strategic Affairs Minister Ron Dermer, who reviewed it with Witkoff during a visit to Washington last week.\n\nThe Witkoff proposal stipulates that the parties would have to reach an agreement on the parameters of Israel’s partial withdrawal from Gaza during the 60-day truce. It also provides for further negotiations during the truce on a potential settlement to end the war.\n\nAccording to a copy of Witkoff’s latest proposal, the authenticity of which was confirmed to The Times of Israel by two sources familiar with the negotiations, Hamas would release 10 living Israeli hostages held in Gaza and return the bodies of 18 deceased hostages during the 60-day ceasefire.\n\nIn return, Israel would release 125 Palestinian terror convicts serving life sentences, 1,111 Gazans detained since the start of the war on October 7, 2023, and 180 bodies of Palestinians currently held by Israel.\n\nThe IDF would also pull back from some areas where troops are currently deployed; the parameters of the pullback would be finalized “during proximity negotiations.”\n\nThere are currently 58 hostages held in Gaza, including the bodies of at least 35 confirmed dead by the IDF, and 20 hostages who are believed to be alive. There are grave concerns for the well-being of three others, Israeli officials have said.\n\nDefense Minister Israel Katz said Sunday that “regardless of any negotiations,” he instructed the IDF “to continue forward in Gaza” and achieve all objectives.\n\nFollowing Katz’s statement, the IDF announced that Chief of Staff Lt. Gen. Eyal Zamir instructed the military to expand the ground offensive against Hamas to additional areas in the Gaza Strip. Additionally, the IDF said Zamir was instructed to establish additional aid distribution sites for the Palestinian civilian population.\n\nOnly four aid sites have been established in Gaza, and not all of them are operational. Three are in southern Gaza’s Rafah and one is adjacent to the Netzarim Corridor in the Central Strip, forcing many Gazans to embark on long and dangerous treks across a war zone in order to pick up boxes of aid to feed them for several days. The scheme managed by the Israeli- and US-backed Gaza Humanitarian Foundation has come under criticism from aid groups who say it fails to adhere to humanitarian principles.\n\nThe initiative came under further scrutiny on Sunday when dozens of Palestinians were reportedly injured near one of the sites. Hamas authorities claimed the IDF opened fire on the Gazans, while the military vehemently denied having done so.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "IDF bars reporters from visiting W. Bank villages on tour based on ‘No Other Land’ film",
    "url": "https://www.timesofisrael.com/idf-bars-reporters-from-visiting-w-bank-villages-on-tour-based-on-no-other-land-film/",
    "content": "Israeli soldiers barred journalists from entering villages in the West Bank on Monday on a tour organized by the directors of the Oscar-winning movie “No Other Land.”\n\nThe directors of the film, which focuses on Israeli settler attacks on Palestinians in the West Bank, said they had invited the journalists on the tour to interview residents about increasing settler violence in the area.\n\nIn a video posted to X by the film’s co-director Yuval Abraham, an Israeli officer —his face concealed by a ski mask and identifiable as a major by the insignia on his uniform — was seen telling a group of international journalists that “no passage” was allowed in the area due to a military order.\n\n“You know they are journalists. They’re coming to see the destruction in Masafer Yatta, the way you are destroying the community, the settler violence,” a voice off camera could be heard telling the officer, referring to the Palestinian village that “No Other Land” covers.\n\nA Palestinian man was then seen telling the officer and a soldier standing with him, whose face was also covered, that the journalists were coming to his home and should be let through. But the officer refused.\n\n“Why didn’t you prevent the settlers when they came to burn the homes… attacking people?” the man was seen telling the officer. “Why don’t you come to do this order? Why only for journalists who are holding cameras and phones?… I have so many videos of settlers coming to attack us, shooting people here, you do nothing. Why?”\n\nEventually, the officer told the journalists that they were being kept out due to the need “to keep the order in this area.”\n\nBasel Adra, the Palestinian co-director of the film who lives in the area, said the military blocked the journalists from entering two Palestinian villages they had hoped to visit.\n\nThe Israel Defense Forces did not immediately respond to a request for comment.\n\nSince “No Other Land” gained notoriety, local villagers have faced an uptick in settler attacks, including in the villages ofTubaandJinba. Hamdan Ballal, another of the film’s co-directors, wasattackedby settlers and then arrested in March, drawing global condemnation.\n\nPalestinians say the settlers operate with the tacit consent of the Israeli state, which carries out home demolitions and rarely prosecutes settlers for instances of violence against Palestinians. Locals have said the attacks are designed to intimidate them into fleeing their land.\n\nThe West Bank has seen a spike in violence since the October 7, 2023, Hamas attack on Israel sparked the war in Gaza.\n\nIn the West Bank, the military has undertaken large-scale counterterrorism operations that have killed hundreds of people — the vast majority of them combatants, according to the IDF — and displaced tens of thousands.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Iran poised to dismiss nuclear proposal presented by US, Iranian diplomat says",
    "url": "https://www.timesofisrael.com/iran-poised-to-dismiss-nuclear-proposal-presented-by-us-iranian-diplomat-says/",
    "content": "DUBAI (Reuters) — Iran is poised to reject a US proposal to end a decades-old nuclear dispute, an Iranian diplomat said on Monday, dismissing it as a “non-starter” that fails to address Tehran’s interests or soften Washington’s stance on uranium enrichment.\n\n“Iran is drafting a negative response to the US proposal, which could be interpreted as a rejection of the US offer,” the senior diplomat, who is close to Iran’s negotiating team, told Reuters.\n\nThe US proposal for a new nuclear deal was presented to Iran on Saturday by Omani Foreign Minister Sayyid Badr Albusaidi, who was on a short visit to Tehran and has been mediating talks between Tehran and Washington.\n\nAfter five rounds of discussions between Iranian Foreign Minister Abbas Araghchi and President Donald Trump’s Middle East envoy Steve Witkoff, several obstacles remain.\n\nAmong them are Iran’s rejection of a US demand that it commit to scrapping uranium enrichment and its refusal to ship abroad its entire existing stockpile of highly enriched uranium — possible raw material for nuclear bombs.\n\nThe United States, Israel and Western countries have long accused Iran — which vows to destroy Israel — of seeking nuclear weapons, a charge Tehran has repeatedly denied, insisting it needs uranium for civilian power production. However, Iran has been enriching uranium up to 60%, a level that has no civilian uses and is just below weapons grade.\n\nIt has also obstructed international inspectors from checking its nuclear facilities, and has expanded its ballistic missile capabilities, while several officials have warned that it could pursue the bomb.\n\nWashington’s proposal for a deal came after leakedUN reports this weekend saidIran had stepped up production of highly enriched uranium and carried out secretive nuclear activities.\n\n“In this proposal, the US stance on enrichment on Iranian soil remains unchanged, and there is no clear explanation regarding the lifting of sanctions,” said the diplomat, who declined to be identified due to the sensitivity of the matter.\n\nAraghchi said Tehran would formally respond to the proposal soon.\n\nTehran demands the immediate removal of all US-imposed curbs that impair its oil-based economy. But the US says nuclear-related sanctions should be removed in phases.\n\nDozens of institutions vital to Iran’s economy, including its central bank and national oil company, have been blacklisted since 2018 for, according to Washington, “supporting terrorism or weapons proliferation.”\n\nTrump’s revival of “maximum pressure” against Tehran since his return to the White House in January has included tightening sanctions and threatening to bomb Iran if the negotiations yield no deal.\n\nDuring his first term in 2018, Trump ditched Tehran’s 2015 nuclear pact with six powers and reimposed sanctions that have crippled Iran’s economy. Iran responded by escalating enrichment far beyond the pact’s limits.\n\nUnder the deal, Iran had until 2018 curbed its sensitive nuclear work in return for relief from US, EU and UN economic sanctions.\n\nThe diplomat said the assessment of “Iran’s nuclear negotiations committee,” under the supervision of Supreme Leader Ayatollah Ali Khamenei, was that the US proposal was “completely one-sided” and could not serve Tehran’s interests.\n\nTherefore, the diplomat said, Tehran considers this proposal a “non-starter” and believes it unilaterally attempts to impose a “bad deal” on Iran through excessive demands.\n\nThe stakes are high for both sides. Trump wants to curtail Tehran’s potential to produce a nuclear weapon that could trigger a regional nuclear arms race and perhaps threaten Israel. Iran’s clerical establishment, for its part, wants to be rid of the devastating sanctions.\n\nIran says it is ready to accept some limits on enrichment but needs watertight guarantees that Washington would not renege on a future nuclear accord.\n\nTwo Iranian officials told Reuters last week that Iran could pause uranium enrichment if the US released frozen Iranian funds and recognized Tehran’s right to refine uranium for civilian use under a “political deal” that could lead to a broader nuclear accord.\n\nIsrael sees Iran’s nuclear program as an existential threat and says it would never allow Tehran to obtain nuclear weapons.\n\nAraghchi, in a joint news conference with his Egyptian counterpart in Cairo, said: “I do not think Israel will commit such a mistake as to attack Iran.”\n\nTehran’s regional influence has meanwhile been diminished by military setbacks suffered by its forces and those of its allies in the Shi’ite-dominated “Axis of Resistance,” which includes Hamas, Hezbollah, the Houthis in Yemen, and Iraqi militias.\n\nIn April, Saudi Arabia’s defense minister delivered a blunt message to Iranian officials to take Trump’s offer of a new deal seriously as a way to avoid the risk of war with Israel.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Daily Briefing June 2: Day 605 – Ancient Bibles receive new homes for Torah holiday",
    "url": "https://www.timesofisrael.com/daily-briefing-june-2-day-605-ancient-bibles-receive-new-homes-for-torah-holiday/",
    "content": "Welcome to The Times of Israel’s Daily Briefing, your 20-minute audio update on what’s happening in Israel, the Middle East and the Jewish world.\n\nReligions reporter Rossella Tercatinjoinshost Jessica Steinbergfor today’s episode.\n\nNearly two years after the ancient, nearly complete Codex Sassoon bible was first introduced at the Anu Museum, days before the October 7, 2023, Hamas attack, the book of Torah is inaugurated at the museum, in the presence of released hostage Agam Berger, in a moving, bittersweet ceremony, tells Tercatin. Another ancient bible, the Shem Tov bible, this one only 700 years old, was also inaugurated permanently at the National Library of Israel, both in time for the Shavuot holiday.\n\n\n\n\n\nTercatin also looks at the ongoing issues of conversion in Israel, following a meeting last week of the Knesset Aliyah Committee devoted to the topic of conversions on Tuesday, ahead of the Shavuot festival. Only about half of those who start the process to convert manage to complete the journey, and the Conversion Authority is currently formally without a director, leaving nobody can sign the official conversion certificates, complex matters that Tercatin discusses.\n\nSteinberg talks about an art exhibit currently at Kibbutz Ramat Yohanan, marking the 80th anniversary of the kibbutz’s Shavuot ceremony, created by two pioneering kibbutz members in the 1940s to mark the agricultural and harvest aspects of the festival.\n\nFinally, Tercatin discusses the Messianic community in Israel, and its connection to Yaron Lischinsky, the Israel Embassy staffer who was killed alongside his soon-to-be-fiancée, Sarah Milgrim, on May 21 in an antisemitic attack at the Capital Jewish Museum in Washington, DC.\n\nCheck out The Times of Israel’s ongoing liveblog for more updates.\n\nCodex Sassoon, oldest near-complete Hebrew Bible, displayed in Israel after Oct. 7 delay\n\nAhead of Shavuot, thousands of converts remain unrecognized by state, stuck in limbo\n\nKibbutz marks 80 years of Shavuot song and dance with pioneering artworks\n\nFor Messianic Jews in Jerusalem, Yaron Lischinsky’s murder was a personal loss\n\nSubscribe to The Timesof Israel Daily Briefing onApple Podcasts,Spotify,YouTube,orwherever you get your podcasts. This episode was produced by the Pod-Waves and video edited by Thomas Girsch.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Iran demands US ‘guarantee’ it will lift sanctions in nuclear talks",
    "url": "https://www.timesofisrael.com/iran-demands-us-guarantee-it-will-lift-sanctions-in-nuclear-talks/",
    "content": "TEHRAN — Iran pressed the United States on Monday for guarantees that it will drop sanctions as a condition for a nuclear deal, after the White House reportedly sent a proposal the US deemed “acceptable.”\n\nWith Iran and the United States engaged in talks over Tehran’s nuclear program since April, Washington’s proposal for a deal came afterleaked UN reportssaid Iran had stepped up production of highly enriched uranium and carried out secretive nuclear activities.\n\nIran’s top diplomat and lead nuclear negotiator was due to meet the head of the UN’s International Atomic Energy Agency (IAEA) in Cairo on Monday, a day after the report was leaked.\n\nIran has rejected the report, warning it would retaliate if European powers that have threatened to reimpose nuclear sanctions “exploit” the report.\n\nThe United States, Israel and Western countries have accused Iran — which vows to destroy Israel — of seeking nuclear weapons, a charge Tehran has repeatedly denied, insisting it needs uranium for civilian power production. However, Iran has been enriching uranium up to 60%, a level that has no civilian uses and is just below weapons grade.\n\nIt has also obstructed international inspectors from checking its nuclear facilities, and has expanded its ballistic missile capabilities, while several officials have warned that it could pursue the bomb.\n\nIranian Foreign Minister Abbas Araghchi said on Saturday that he had received “elements” of a US proposal for a nuclear deal following five rounds of talks mediated by Oman.\n\nOn Monday, foreign ministry spokesman Esmaeil Baqaei told a news conference in Tehran: “We want to guarantee that the sanctions are effectively lifted…\n\n“So far, the American side has not wanted to clarify this issue,” he added.\n\nHis remarks come a day after a report by the UN agency showed Iran has stepped up production of uranium enriched up to 60 percent — close to the roughly 90 percent level needed for atomic weapons.\n\nIn the nuclear talks last month, the US envoy said that President Donald Trump’s administration would oppose any enrichment.\n\n“An enrichment program can never exist in the state of Iran ever again. That’s our red line. No enrichment,” Steve Witkoff told Breitbart News.\n\nIran has vowed to keep enriching uranium “with or without a deal” on its nuclear program.\n\nThe United States has sent Iran a proposal for a nuclear deal that the White House called “acceptable” and in its “best interest” to accept, US media reported on Saturday.\n\nThe New York Times, citing officials familiar with the diplomatic exchanges, said the proposal calls on Iran to stop all enrichment and suggests creating a regional grouping to produce nuclear power.\n\nIran has held five rounds of talks with the United States in search of a new agreement to replace the deal with major powers that Trump abandoned during his first term in 2018.\n\nTimes of Israel Staff contributed to the report\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Netanyahu says Boulder attack a direct result of ‘blood libels’ against Israel and Jews",
    "url": "https://www.timesofisrael.com/netanyahu-says-boulder-attack-a-direct-result-of-blood-libels-against-israel-and-jews/",
    "content": "Prime Minister Benjamin Netanyahu on Monday condemned the “vicious terror attack” in Boulder, Colorado against people demonstrating for the hostages held in Gaza, saying that a recent spate of violent attacks against Jews around the world was a direct result of “blood libels against the Jewish state and people.”\n\nAt least eight people were wounded Sunday in Boulder, including one person in critical condition, when themarchers were attackedby a man shouting “end Zionists,” who fired a makeshift flamethrower and threw firebombs at them. The incident occurred on the eve of the Jewish festival of Shavuot.\n\n“This attack was aimed against peaceful people who wished to express their solidarity with the hostages held by Hamas, simply because they were Jews,” Netanyahu said in a relatively rare statement on a Jewish holiday.\n\n“I trust the United States authorities to prosecute the cold-blooded perpetrator to the fullest extent of the law and do everything possible to prevent future attacks against innocent civilians,” Netanyahu said.\n\n“The antisemitic attacks around the world are a direct result of blood libels against the Jewish state and people, and this must be stopped,” he said.\n\nHis comments echoed those of an earlier statement by Foreign Minister Gideon Sa’ar, who blamed the “terrible antisemitic terror attack targeting Jews” on “pure antisemitism fueled by the blood libels spread in the media.”\n\nOpposition leader Yair Lapid also denounced Sunday’s attack.\n\n“We are all horrified by the violent terror attack in Colorado against peaceful protesters who were simply calling for the release of our hostage,” he wrote on X.\n\nThe Hostage Families Forum said they were heartbroken about the news of the attack.\n\n“We are heartbroken by the tragic attack in Colorado and extend our deepest support to all those affected. Our thoughts are with the injured, their loved ones, and the entire community shaken by this senseless act of violence,” the Forum said.\n\n“For over 600 days, this community — along with so many others around the world — has stood with us, marching, praying, and raising its voice for the hostages still held in Gaza. Today, we stand with you — with care, with solidarity, and with deep appreciation for your unwavering support.”\n\nAmbassador to the United Nations Danny Danon also voiced outrage.\n\n“Terrorism against Jews does not stop at the Gaza border — it is already burning the streets of America,” he said in a statement.\n\nThe incident, which the FBI said it was investigating as an act of terrorism, marked the second major attack against a Jewish gathering in the US in recent weeks after two Israeli embassy staffers were shot and killed outside an event at the Capital Jewish Museum in Washington DC.\n\nFour women and four men between 52 and 88 years old were transported to hospitals, Boulder police said. Authorities had earlier put the count of the injured at six and said at least one of them was in a critical condition.\n\nThe suspect is in custody and was identified as Mohamed Sabry Soliman, 45. He was also injured and was taken to the hospital to be treated, but authorities didn’t elaborate on the nature of his injuries.\n\nWitnesses told investigators that Soliman attacked the demonstrators with a “makeshift flamethrower” and threw an incendiary device, FBI Special Agent Mark Michalek said at a press conference. Boulder Police Chief Steve Redfearn said the suspect hurled Molotov cocktails at the demonstrators.\n\n“It is clear that this is a targeted act of violence and the FBI is investigating this as an act of terrorism,” Michalek said.\n\nIn footage said to be from the scene of the attack, a shirtless man screamed “End Zionists” while holding what appear to be Molotov cocktails. The man also shouted, “Palestine is free.”\n\nThe attack took place on the Pearl Street Mall, a popular pedestrian shopping district in the shadow of the University of Colorado, during an event organized by Run for Their Lives, an organization devoted to drawing attention to the hostages seized during Hamas’s October 7, 2023 assault on Israel in which 251 people were taken hostage and some 1,200 killed.\n\nTerror groups in the Gaza Strip are holding 58 hostages, including 57 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, and 20 are believed to be alive. There are grave concerns for the well-being of three others, Israeli officials have said.\n\nIn a statement, Run for Their Lives said the walks have been held every week since then for the hostages, “without any violent incidents until today.”\n\nUS officials also condemned the attack and vowed action.\n\nUS Secretary of State Marco Rubio described the Boulder incident as a “targeted terror attack,” while Attorney General Pam Bondi said “FBI agents are on the ground in Colorado following what appears to be a horrific antisemitic attack.”\n\nLawmakers on both sides of the political aisle expressed revulsion.\n\n“Tonight, a peaceful demonstration was targeted in a vile, antisemitic act of terror,” Chuck Schumer, a prominent Jewish Democrat, said in a statement. “Once again, Jews are left reeling from repeated acts of violence and terror.\n\nColorado Governor Jared Polis, who is also Jewish, posted on social media that it was “unfathomable that the Jewish community is facing another terror attack here in Boulder.”\n\nSeveral organizations also decried the violence.\n\n“Our community was targeted in a violent, antisemitic attack,” the Israeli-American Council said in a statement.\n\n“This is an attack on all of us — and we will not stay silent.”\n\nFBI chief Kash Patel described Sunday’s incident as “a targeted terror attack,” while Colorado Attorney General Phil Weiser labeled it “a hate crime.”\n\n“People may have differing views about world events and the Israeli-Hamas conflict, but violence is never the answer to settling differences. Hate has no place in Colorado,” Weiser said.\n\nWhite House Deputy Chief of Staff Stephen Miller posted on X that the suspect was a foreign national who “illegally overstayed (his) visa.”\n\nAcross the US, the New York Police Department said it has upped its presence at religious sites throughout the city for Shavuot.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Conservative Holocaust revisionist Karol Nawrocki wins Polish presidential election",
    "url": "https://www.timesofisrael.com/conservative-holocaust-revisionist-karol-nawrocki-wins-polish-presidential-election/",
    "content": "Conservative Karol Nawrocki, who madeHolocaust revisionismpart of his campaign, won Poland’s weekend presidential runoff election, according to the final vote count on Monday. Nawrocki won 50.89% of the votes in a very tight race against liberal Warsaw Mayor Rafał Trzaskowski, who received 49.11%.\n\nThe race had Poland on edge since a first round of voting two weeks earlier, revealing deep divisions in the country along the eastern flank of NATO and the European Union.\n\nAn early exit poll released Sunday evening suggested Trzaskowski was headed to victory before updated polling began to reverse the picture a couple of hours later.\n\nThe outcome suggests that Poland can be expected to take a more populist and nationalist path under its new leader, who was backed by US President Donald Trump.\n\nMost day-to-day power in the Polish political system rests with a prime minister chosen by the parliament. However, the president’s role is not merely ceremonial.\n\nThe office holds the power to influence foreign policy and veto legislation.\n\nRelated:Poland to vote for next president, with Holocaust history an apparent item on the ballot\n\nNawrocki will succeed Andrzej Duda, a conservative whose second and final term ends on August 6.\n\nUnder the Polish constitution, the president serves a five-year term and may be re-elected once.\n\nPrime Minister Donald Tusk came to power in late 2023 with a coalition government that spans a broad ideological divide — so broad that it hasn’t been able to fulfill certain of Tusk’s electoral promises, such as loosening the restrictive abortion law or passing a civil partnership law for same-sex couples.\n\nBut Duda’s veto power has been another obstacle. It has prevented Tusk from fulfilling promises to reverse laws that politicized the court system in a way that the European Union declared to be undemocratic.\n\nNow it appears Tusk will have no way to fulfill those promises, which he made both to voters and the EU.\n\nSome observers in Poland have said the unfulfilled promises could make it more difficult for Tusk to continue his term until the next parliamentary election scheduled for late 2027, particularly if Law and Justice dangles the prospect of future cooperation with conservatives in his coalition.\n\nNawrocki, a 42-year-old amateur boxer and historian, was tapped by the Law and Justice party as part of its push for a fresh start.\n\nThe party governed Poland from 2015 to 2023, when it lost power to a centrist coalition led by Tusk. Some political observers predicted the party would never make a comeback, and Nawrocki was chosen as a new face who would not be burned by the scandals of the party’s eight years of rule.\n\nThe strategy clearly worked.\n\nNawrocki campaigned under the slogan “Poland first, Poles first”.\n\nNawrocki has most recently been the head of the Institute of National Remembrance, which embraces nationalist historical narratives, which glorified Polish victimhood and resistance to the Nazis during World War Two while delegitimizing research on Polish antisemitism or Poles who killed Jews.\n\nHe led efforts to topple monuments to the Soviet Red Army in Poland, and Russia responded by putting him on a wanted list, according to Polish media reports.\n\nNawrocki’s supporters describe him as the embodiment of traditional, patriotic values. Those who oppose secular trends, including LGBTQ+ visibility, have embraced him, viewing him as a reflection of the values they grew up with.\n\nNawrocki’s candidacy was clouded by allegations of past connections to criminal figures and his participation in a violent street brawl. He denies the criminal links but was unapologetic about the street fight, saying he had taken part in “noble” fights in his life. The revelations did not seem to hurt his support among right-wing voters, many of whom see the allegations as politically motivated.\n\nTrump made it clear he wanted Nawrocki as Poland’s president.\n\nHe welcomed Nawrocki to the White House a month ago. And last week the conservative group CPAC held its first meeting in Poland to give Nawrocki a boost. Kristi Noem, the US Homeland Security Secretary and a prominent Trump ally, strongly praised Nawrocki and urged Poles to vote for him.\n\nThe US has about 10,000 troops stationed in Poland and Noem suggested that military ties could deepen with Nawrocki as president.\n\nA common refrain from Nawrocki’s supporters is that he will restore “normality,” as they believe Trump has done. US flags often appeared at Nawrocki’s rallies, and his supporters believed that he offered a better chance for good ties with the Trump administration.\n\nNawrocki has also echoed some of Trump’s language on Ukraine. He promises to continue Poland’s support for Ukraine but has been critical of President Volodymyr Zelenskyy, accusing him of taking advantage of allies. He has accused Ukrainian refugees of taking advantage of Polish generosity, vowing to prioritize Poles for social services such as health care and schooling.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Russia and Ukraine head to Istanbul for fresh peace talks, but remain far apart",
    "url": "https://www.timesofisrael.com/russia-and-ukraine-head-to-istanbul-for-fresh-peace-talks-but-remain-far-apart/",
    "content": "ISTANBUL (Reuters) — Russian and Ukrainian officials are due to sit down on Monday in the Turkish city of Istanbul for their second round of direct peace talks since 2022, but the two sides are still far apart on how to end the war and the fighting is stepping up.\n\nUS President Donald Trump has demanded that Russia and Ukraine make peace, but so far they have not and the White House has repeatedly warned the United States will “walk away” from the war if the two sides are too stubborn to reach a peace deal.\n\nThe first round of talks on May 16 yielded the biggest prisoner swap of the war, but no sign of peace, or even a ceasefire, as both sides merely set out their own opening negotiating positions.\n\nAfter keeping the world guessing on whether Ukraine would even turn up for the second round, President Volodymyr Zelensky said Defense Minister Rustem Umerov would meet with Russian officials in Istanbul.\n\nThe Russian delegation will be headed by Kremlin aide Vladimir Medinsky, who after the first round invoked French general and statesman Napoleon Bonaparte to assert that war and negotiations should always be conducted at the same time.\n\nOn Sunday, Ukraine launched one of its most ambitious attacks of the war, targeting Russian nuclear-capable long-range bombers in Siberia and other military bases, while the Kremlin launched 472 drones at Ukraine, Ukraine’s air force said, the highest nightly total of the war.\n\nThe idea of direct talks was first proposed by Russian President Vladimir Putin after Ukraine and European powers demanded that he agree to a ceasefire which the Kremlin dismissed.\n\nPutin said Russia would draft a memorandum setting out the broad contours of a possible peace accord and only then discuss a ceasefire.\n\nKyiv said over the weekend it was still waiting for a draft memorandum from the Russian side.\n\nMedinsky, the lead Kremlin negotiator, said on Sunday that Moscow had received Ukraine’s draft memorandum and told Russia’s RIA news agency the Kremlin would react to it on Monday.\n\nAccording to Trump envoy Keith Kellogg, the two sides will in Turkey present their respective documents outlining their ideas for peace terms, though it is clear that after three years of war Moscow and Kyiv remain far apart.\n\nKellogg has indicated that the US will be involved in the talks and that even representatives from Britain, France and Germany will be too, though it was not clear at what level the United States would be represented.\n\nUkraine’s delegation will also include its deputy foreign minister, as well as several military and intelligence officials, according to an executive order by Zelensky on Sunday.\n\nIn June last year, Putin set out his opening terms for an immediate end to the war: Ukraine must drop its NATO ambitions and withdraw all of its troops from the entirety of the territory of four Ukrainian regions claimed and mostly controlled by Russia.\n\nUkrainian negotiators in Istanbul will present to the Russian side a proposed roadmap for reaching a lasting peace settlement, according to a copy of the document seen by Reuters.\n\nAccording to the document, there will be no restrictions on Ukraine’s military strength after a peace deal is struck, no international recognition of Russian sovereignty over parts of Ukraine taken by Moscow’s forces, and no reparations for Ukraine.\n\nThe document also stated that the current location of the front line will be the starting point for negotiations about territory.\n\nRussia currently controls a little under one-fifth of Ukraine, or about 113,100 square km, about the same size as the US state of Ohio.\n\nPutin ordered tens of thousands of troops to invade Ukraine in February 2022 after eight years of fighting in eastern Ukraine between Russian-backed separatists and Ukrainian troops. The United States says over 1.2 million people have been killed and injured in the war since 2022.\n\nTrump has called Putin “crazy” and berated Zelensky in public in the Oval Office, but the US president has also said that he thinks peace is achievable and that if Putin delays, then he could impose tough sanctions on Russia.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Just a quick check…",
    "url": "https://www.timesofisrael.com/exercise-boosts-survival-rates-in-colon-cancer-patients-study-shows/",
    "content": "Content not found."
  },
  {
    "source": "Times of Israel",
    "title": "IDF expands Gaza ground offensive; 14 said killed in Israeli strike on Jabalia home",
    "url": "https://www.timesofisrael.com/liveblog-june-2-2025/",
    "content": "The Times of Israel is liveblogging Monday’s events as they unfold.\n\nA man who barricaded himself on the roof of a building after his wife was found stabbed to death has jumped to his death after nine hours, Israel Police says in a statement.\n\nPolice say negotiators conducted extensive negotiations to try to talk the suspect in the woman’s murder down, but the man ultimately did not cooperate, police say.\n\nAccording to the Kan public broadcaster, the couple had recently separated.\n\nAccording to the Israel Women’s Network, 14 women have been murdered in Israel since the start of the year, 13 of them by a partner or relative.\n\nThe Boulder Police Department says there are no fatalities in the attack on a rally for Israeli hostages yesterday.\n\n“No victims have died,” the police department says in a statement.\n\nPolice said last night that one of the victims was in critical condition.\n\nThe suspect, Mohamed Sabry Soliman, was booked on murder charges in a local jail late last night. The charges are preliminary, have not been filed, and are subject to change. The reason for the discrepancy is still unclear.\n\nThe police department releases a mugshot of the suspect, who has a bandaged ear and bruising on his face.\n\nThe police department says it will hold a press conference on the attack later today and that more details are forthcoming.\n\nDAMASCUS/AMMAN, Syria/Jordan — The United States has given its blessing to a plan by Syria’s new leadership to incorporate thousands of foreign jihadist former rebel fighters into the national army, provided that it does so transparently, US President Donald Trump’s envoy says.\n\nThree Syrian defense officials say that under the plan, some 3,500 foreign fighters, mainly Uyghurs from China and neighboring countries, would join a newly-formed unit, the 84th Syrian army division, which would also include Syrians.\n\nAsked by Reuters in Damascus whether Washington approved the integration of foreign fighters into Syria’s new military, Thomas Barrack, the US ambassador to Turkey who was named Trump’s special envoy to Syria last month, says: “I would say there is an understanding, with transparency.”\n\nHe says it was better to keep the fighters, many of whom are “very loyal” to Syria’s new administration, within a state project than to exclude them.\n\nThe fate of foreigners who joined Syria’s Hayat Tahrir al-Sham rebels during the 13-year war between rebel groups and President Bashar al-Assad has been one of the most fraught issues hindering a rapprochement with the West since HTS, a one-time offshoot of al Qaeda, toppled Assad and took power last year.\n\nAt least until early May, the United States had been demanding that the new leadership broadly exclude foreign fighters from the security forces.\n\nLebanese security forces have arrested a Hezbollah operative for allegedly spying for Israel, the Saudi Al Hadath news outlet reports.\n\nMahmoud Ayoub, the financial director at Ragheb Harb Hospital, was arrested today in the town of Harouf, in the Nabatieh district, Al Hadath reports.\n\nThe arrest comes weeks after the London-based Arabic Asharq al-Awsat newspaper reported that at least 21 suspects were being held for spying for the Jewish state, including Mohammed Salah, the son of an elite Radwan Force commander and a well-known religious singer.\n\nUS Ambassador to Israel Mike Huckabee accuses major American news outlets of “contributing to the antisemitic climate” that resulted in the recent attacks targeting Israeli embassy staffers in Washington and Israeli hostages activists in Colorado over the networks’ coverage of yesterday’s shooting of Gazans near an aid distribution site.\n\n“Without verification of any source other than Hamas and its collaborators, the New York Times, CNN, and Associated Press reported that a number of people seeking to receive humanitarian food boxes from the Gaza Humanitarian Fund were shot or killed by the Israeli Defense Forces,” Huckabee says in a statement.\n\n“These reports were FALSE. Drone video and first-hand accounts clearly showed that there were no injuries, no fatalities, no shooting, no chaos,” Huckabee asserts.\n\nIt is unclear what drone footage and first-hand accounts Huckabee is referring to. GHF released what it said was drone footage showing no incident at the site, but the clip was taken during daylight hours, while the incident that reportedly injured 31 Gazans took place at around 3 a.m.\n\nWhile the IDF has denied firing at Gazans near the GHF aid site yesterday, it has acknowledged firing in the air at Palestinians. Doctors Without Borders said its aid workers treated Palestinians who said Israeli soldiers were the ones who shot at them.\n\n“The only source for these misleading, exaggerated, and utterly fabricated stories came from Hamas sources, which are designed to fan the flames of antisemitic hate that is arguably contributing to violence against Jews in the United States,” Huckabee says.\n\n“Media sources who willingly parrot these libelous allegations should recant their fake news stories, apologize and pledge to practice actual reporting of fact instead of engaging in dangerous propaganda that assists the terror group Hamas as they continue to hold innocent hostages for over 600 days after butchering over 1,200 people on October 7th,” he says, demanding an “immediate retraction” by the American media sites.\n\nThe United Arab Emirates condemns what it says was a “terrorist attack” in Colorado targeting activists calling for the release of the Israeli hostages in Gaza.\n\nThe “UAE expresses its strong condemnation of these criminal and terrorist acts and its permanent rejection of all forms of violence and terrorism targeting innocent people,” a statement from its foreign ministry says, wishing a speedy recovery to the victims and expressing solidarity with the American people and their government.\n\nA Palestinian suspect who allegedly was planning to throw rocks at a highway in the West Bank was shot by Israeli troops a short while ago, the military says.\n\nTroops of the 636th Combat Intelligence Collection Unit had spotted the suspect near the village of Sinjil as he was attempting to hurl stones on a nearby road, the military says.\n\nThe IDF says the suspect threw two bottles with “dangerous material” in them at the forces, and the soldiers returned fire.\n\nIsraeli soldiers bar journalists from entering villages in the West Bank on a planned tour organized by the directors of the Oscar-winning movie “No Other Land.”\n\nThe directors of the film, which focuses on Israeli settler attacks on Palestinians in the West Bank, say they had invited the journalists on the tour today to interview residents about increasing settler violence in the area.\n\nIn a video posted on X by the film’s co-director, Yuval Abraham, an Israeli soldier tells a group of international journalists there is “no passage” in the area because of a military order. Basel Adra, a Palestinian co-director of the film who lives in the area, says the military then blocked the journalists from entering two Palestinian villages they had hoped to visit.\n\nIsrael’s military does not immediately respond to a request for comment.\n\nThe Israeli military says it carried out a strike a short while ago against a Hamas command center embedded within a school-turned shelter in central Gaza’s Deir al-Balah.\n\nAccording to Palestinian media, at least four people were killed in the strike on the Al-Aishiya school.\n\nThe IDF says that the command center was being used by Hamas operatives to plan and carry out attacks against troops and Israeli civilians.\n\nThe military says it took steps to mitigate civilian harm, including by using a precision munition, aerial surveillance, and other intelligence.\n\nA former senior Biden administration official says, “It is without a doubt true that Israel has committed war crimes” in Gaza.\n\nMatthew Miller, who served as State Department spokesperson for the last two years of former US president Joe Biden’s term, clarifies during a podcast interview withSky Newsthat he doesn’t believe Israel is perpetrating a genocide in Gaza.\n\n“There are two ways to think about the commission of war crimes,” Miller says. “One is if the state has pursued a policy of deliberately committing war crimes or is acting recklessly in a way that aids and abets war crimes. Is the state committing war crimes?\n\n“That, I think, is an open question. I think what is almost certainly not an open question is that there have been individual incidents that have been war crimes where Israeli soldiers, members of the Israeli military, have committed war crimes,” he adds.\n\nIsrael has long denied that it is committing war crimes in Gaza, asserting that it takes steps to avoid civilian casualties, while Hamas operates among civilians in order to maximize such figures.\n\nMiller acknowledges that there had been disagreements within the Biden administration about its Gaza war policy, including on whether to withhold weapons from Israel. However, he argues that doing so might have led Hamas to refrain from agreeing to a ceasefire.\n\n“It was clear to us in that period that there was a time when our public discussion of withholding weapons from Israel, as well as the protests on college campuses in the United States and the movement of some European countries to recognize the state of Palestine… All of those things together were leading the leadership of Hamas to conclude that they didn’t need to agree to a ceasefire, they just needed to hold out for a little bit longer, and they could get what they always wanted,” he says.\n\n“The thing that I look back on… is in that intervening period between the end of May and the middle of January [2025], when thousands of Palestinians, innocent civilians were killed… was there more that we could have done to pressure the Israeli government to agree to that ceasefire? I think at times there probably was,” Miller says."
  },
  {
    "source": "Times of Israel",
    "title": "Just a quick check…",
    "url": "https://www.timesofisrael.com/hamas-says-ready-for-indirect-talks-to-resolve-points-of-contention-on-gaza-deal/",
    "content": "Content not found."
  },
  {
    "source": "Times of Israel",
    "title": "Just a quick check…",
    "url": "https://www.timesofisrael.com/ukraine-drones-target-russian-air-bases-in-covert-strike-likened-to-israeli-pager-op/",
    "content": "Content not found."
  },
  {
    "source": "Times of Israel",
    "title": "Liberal mayor, anti-EU Holocaust revisionist both claim victory in Poland election",
    "url": "https://www.timesofisrael.com/liberal-mayor-anti-eu-holocaust-revisionist-both-claim-victory-in-poland-election/",
    "content": "Both candidates in Poland’s runoff presidential election on Sunday claimed victory after an exit poll showed Warsaw’s pro-EU mayor Rafal Trzaskowski just 0.6% ahead of his rival, right-wing historian Karol Nawrocki, who has made Holocaust revisionism part of his campaign.\n\n“We won… by a whisker,” Trzaskowski, 53, who is backed by the ruling Civic Coalition party, told supporters after the Ipsos poll showed him narrowly ahead with 50.3 percent.\n\nNawrocki, 42, who is supported by Poland’s outgoing conservative President Andrzej Duda and US President Donald Trump, was at 49.7 percent. “Tonight we will win,” Nawrocki told his election night rally. “We will win and we will save Poland.”\n\nThe Ipsos exit poll had a margin of error of plus or minus 2 percentage points, and the final vote is likely to change somewhat, making the result still too close to call.\n\nThe state electoral commission was expected to release the final vote count on Monday, though the result could be known sooner.\n\nTherunofffollows a tightly contested first round on May 18, in which Trzaskowski won just over 31% and Nawrocki nearly 30%, eliminating 11 other candidates.\n\nFar-right candidates Sławomir Mentzen and Grzegorz Braun came in third and fourth, giving Nawrocki a larger pool of right-wing voters to draw on in the runoff.\n\nNawrocki, who has the support of Trump, hasn’t wasted time courting those voters. He signed a list of Mentzen’s demands, such as refusing to ratify Ukraine’s entry to NATO, sending Polish soldiers to Ukraine, or expanding EU powers.\n\nHe has also sought favor from Braun, who made antisemitism a feature of his campaign, asking his rivals in a televised debate last month what they planned to do about the “Judaization” of Poland. In 2023, Braun used a fire extinguisher to blow out Hanukkah candles in parliament and violently stormed a lecture by Grabowski. This year he disrupted a moment of silence for the Holocaust to denounce “Jewish genocide in Gaza.” His campaign posters showed him posing with a fire extinguisher.\n\nNawrocki told Braun that he would fight “all the disgusting attacks” on Poland by Holocaust scholars, and had previously promised to end the tradition of lighting Hanukkah candles in the presidential palace.\n\nA victory for Nawrocki would embolden the populist Law and Justice party, which ruled Poland between 2015 and 2023, and could lead to fresh parliamentary elections.\n\nThe candidacy of Nawrocki, an amateur boxer, has been clouded by allegations of past connections to criminal figures and participation in a violent street battle. He denies the criminal links but acknowledges having taken part in “noble” fights. The revelations have not appeared to dent his support among right-wing voters, many of whom see the allegations as politically motivated.\n\nMany Nawrocki supporters want stricter curbs on immigration and advocate for conservative values and more sovereignty for the country within the European Union.\n\n“We should not give in to European pressure,” 40-year-old Agnieszka Prokopiuk, a homemaker, said before the vote.\n\n“We need to make our own way,” she told AFP in the eastern city of Biala Podlaska.\n\nA victory for Trzaskowski would be a major boost for the progressive agenda of the government led by Polish Prime Minister Donald Tusk. It could mean significant social changes such as the introduction of civil partnerships for same-sex couples and an easing of a near-total ban on abortion.\n\nTusk, a former European Council president, said these elections “were particularly important” after he voted in the seaport of Sopot.\n\nKatarzyna Malek, a 29-year-old voter in Warsaw, cast her ballot in the first round for a left-wing candidate but went for Trzaskowski on Sunday, viewing him as more competent and more likely to pursue stronger ties with foreign partners and lower social tensions.\n\n“I hope there will be less division, that maybe there will be more dialogue,” she said.\n\nCivic Coalition, which backed Trzaskowski, traditionally appeals to more liberal-minded Poles who mainly live in cities or bigger towns. Law and Justice, which backed Nawrocki, has traditionally enjoyed support in small towns and rural areas, especially in Poland’s south and east. These areas are typically poorer and more socially conservative than larger cities, creating a sense of exclusion that the populist party has tapped into.\n\nThe president in Poland, a fast-growing economy of 38 million people, has the power to veto legislation and is also the commander-in-chief of the armed forces. The president wields another power that can influence historical research: signing off on awarding professorships.\n\nDuda, who is aligned with Law and Justice,refusedin 2019 to appoint Michal Bilewicz, a Jewish researcher of antisemitism, as a full professor at the University of Warsaw.\n\nIt was only in the 1990s, after the Soviet Union fell, that Poland began efforts to reconcile with the murder of 3 million Jews there and the intertwining of Jewish and Polish history.\n\nBut many projects of “memory activism” were cut short by the Law and Justice government, which isolated Poland from the EU and was scrutinized for undermining democratic norms and tightening government control over the judiciary, the media and Polish history.\n\nNawrocki heads the Institute of National Remembrance, known for advancing the right-wing government’s narratives, which glorified Polish victimhood and resistance to the Nazis while delegitimizing research on Polish antisemitism or Poles who killed Jews.\n\nIn 2018, the country passed a law that outlawed accusing Poland or the Polish people of complicity in Nazi crimes. Although the infraction was downgraded from a crime punishable with three years in prison to a civil offense, critics say it had a chilling effect on historical research.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "Just a quick check…",
    "url": "https://www.timesofisrael.com/emily-damari-ex-hostage-with-a-golden-heart-proudly-recalls-irking-her-captors/",
    "content": "Content not found."
  },
  {
    "source": "Times of Israel",
    "title": "Just a quick check…",
    "url": "https://www.timesofisrael.com/greta-thunberg-sets-sail-with-gaza-flotilla-that-aims-to-break-israeli-naval-blockade/",
    "content": "Content not found."
  },
  {
    "source": "Times of Israel",
    "title": "Just a quick check…",
    "url": "https://www.timesofisrael.com/idf-downs-houthi-missile-that-triggered-sirens-in-jerusalem-area-central-israel/",
    "content": "Content not found."
  }
]