[
  {
    "similarity": 0.5237,
    "is_article": {
      "title": "Israel claims Hamas losing control over Gaza civilians as GHF ramps up aid operations",
      "content": "A senior Israeli defense official briefing reporters on Friday asserted that Hamas is losing control of Palestinian civilians in the Gaza Strip, as the new Israeli-backed aid initiative ramps up its operations aimed at preventing the terror group from diverting aid.\n\nBut the assertion that Hamas’s grip in the Strip is slipping has been made repeatedly by Israeli officials since thebeginningof the war.\n\nThe Gaza Humanitarian Foundation announced Friday that it had distributed over two million meals at three distribution sites in southern and central Gaza over the past five days. But its classification of meals is based on boxes of dry food products that still require cooking equipment or community kitchens, which are very limited throughout the Strip after nearly 20 months of devastating conflict.\n\nThe two million meals came from 23,040 boxes of food GHF said it had distributed this week. But this amounts to around just 40 trucks worth of aid when international organizations have asserted that aid from at least 300 trucks needs to be distributed each day in order to fend off famine in Gaza after Israel blocked aid from entering the Strip for 78 days.\n\nStill, the Israeli defense official was bullish about the tide turning against Hamas while briefing reporters Friday on condition of anonymity.\n\n“The barrier of fear from Hamas has been broken. Hamas repeatedly tried to break the population and resist the distribution plan to preserve its ability to control food and, consequently, the residents of the Gaza Strip,” the defense official said.\n\n“The residents of the Strip voted with their feet against Hamas and flocked en masse to the distribution centers, thereby breaking an initial barrier of public fear from Hamas, which undermines its governing component needed to preserve its ruling capabilities,” the official said.\n\nAccording to the official, the new aid distribution system is intended first to cut Hamas off from the aid — as it is no longer involved in the distribution process — and secondly to cut the population off from Hamas, potentially collapsing the terror group’s civil rule in the Strip, which is one of Israel’s war goals.\n\nThe official slammed “many elements within Hamas and UN organizations that defame and hope for the failure of the aid distribution plan via the distribution centers.”\n\n“Elements in Gaza and within Hamas are trying to create chaos and disorder to sabotage our efforts and drive a psychological campaign and generate a false narrative,” the official added.\n\nOf the 238 trucks of aid that set out from Kerem Shalom to be distributed in Gaza in recent days, 135 were looted, according to military estimates. The looting was largely carried out by civilians, and in some cases, armed gangs who had no affiliation with Hamas, the military official said, underlining the terror group’s weakened control.\n\nAccording to the official, to enable the UN to collect and distribute the aid entering Gaza, the Defense Ministry’s Coordinator of Government Activities in the Territories (COGAT) held meetings with UN officials, and several adjustments were made to the transportation routes — some of which had gone through combat zones — and other logistical solutions were provided.\n\nStill, COGAT has accused the UN of failing to collect over 550 truckloads of aid waiting on the Gaza side of Kerem Shalom Crossing.\n\nUN officials and aid groups say they have faced significant challenges distributing the aid because of insecurity, the risk of looting and Israel’sfailureto provide safe routes for them to pick up the aid at the border and then ferry it to warehouses ahead of distribution.\n\nA spokesperson for the UN humanitarian agency OCHA held his own briefing with reporters on Friday in Geneva during which he described Gaza as “the hungriest place on Earth.”\n\n“It’s the only defined area — a country or defined territory within a country — where you have the entire population at risk of famine. 100 percent of the population at risk of famine,” said Jens Laerke, rejecting claims to the contrary by Israeli authorities.\n\nLaerke said 900 trucks of humanitarian aid had been authorized by Israel to enter the Strip since the blockade was partially lifted last week.\n\nBut so far only 600 trucks have been offloaded on the Gaza side of the border, and a smaller number of truckloads have then been picked up, due to multiple security considerations.\n\nLaerke said the mission to deliver aid was “in an operational strait-jacket that makes it one of the most obstructed aid operations not only in the world today, but in recent history.”\n\nOnce truckloads enter Gaza, they are often “swarmed by desperate people,” Laerke said.\n\n“I don’t blame them, for one second, for taking the aid that essentially is already theirs — but it’s not distributed in the way we want.”\n\nTaking aim at GHF, Laerke said that by having people collect aid rather than delivering it to them where they are, they become a target for looters once they leave the site.\n\n“It is so desperate and tragic and frustrating and wildly unhumanitarian,” he said.\n\nMeanwhile, on Friday, hospital officials and paramedics said Friday that Israeli airstrikes in Gaza killed at least 14 more people and wounded others.\n\nOfficials at Shifa Hospital in northern Gaza said the bodies of 12 people, including three women, were brought in Friday from the nearby Jabaliya refugee camp.\n\nThe Palestinian Red Crescent Society said the bodies of two people as well as nine others who were wounded were taken to Al-Quds Hospital in Gaza City. It said one of the wounded is a doctor who works at the same hospital.\n\nThe IDF said it struck dozens of targets in the Gaza Strip, which included terror operatives, buildings used by terror groups, observation and sniper posts, tunnels and other terror infrastructure.\n\nDuring recent operations of the 98th Division in the Khan Younis area of the southern Gaza Strip, the IDF said it demolished a kilometer-long Hamas tunnel.\n\nThe tunnel was discovered by the Commando Brigade and the elite Yahalom combat engineering unit, amid a new offensive against Hamas.\n\nAccording to the IDF, while scanning the tunnel, troops located several Hamas operatives holed up inside and eliminated them.\n\nHamas separately published an unusual video purporting to show its operatives detonating an explosive device against what it says are “undercover” Israeli soldiers in southern Gaza’s Rafah.\n\nThe Friday video shows a group of armed men in civilian clothing being hit by a bomb.\n\nSome reports from Gaza indicated that the armed group is affiliated with Yasser Abu Shabab, a leader of a large clan in the Rafah area.\n\nAbu Shabab claims his forces have been protecting aid convoys, while Hamas has accused him of looting the aid trucks and maintaining connections with Israel.\n\nIsraeli officials declined to comment on Abu Shabab’s or other militias’ activities in Gaza.\n\nAlso on Friday, Haaretz reported that the primary activity of Israeli forces in Gaza has become the systemic destruction of infrastructure. The IDF says it is being done in order to protect soldiers, adding that Hamas is using much of the infrastructure for military purposes, but Prime Minister Benjamin Netanyahu hastalkedabout destroying homes in Gaza so that civilians have nowhere to return, making it easier to advance US President Donald Trump’s mass emigration plan. Netanyahu last week made implementing Trump’s plan a condition for ending the war.\n\nAccording to Hamas’s health ministry, more than 54,000 Palestinians have been killed in the Strip since the terror group stormed southern Israel on October 7, 2023, to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\n\nThe Hamas death tolls cannot be independently verified and do not distinguish between civilians and fighters. Israel says it has killed some 20,000 combatants in battle as of January and another 1,600 terrorists inside Israel during the Hamas onslaught.\n\n",
      "url": "https://www.timesofisrael.com/israel-claims-hamas-losing-control-over-gaza-civilians-as-ghf-ramps-up-aid-operations/"
    },
    "me_article": {
      "title": "UN and aid groups condemn US-Israeli initiative after deadly scenes in Gaza",
      "content": "The United Nations and aid groups have spoken out after threePalestinianswere killed byIsraelifire and dozens injured at an aid distribution point set up by an Israeli-US-backed initiative.\n\nThere werechaotic scenes in Rafah, southern Gaza, on Tuesday as starving Palestinians rushed inside a facility holding aid, due to long delays conducting security checks on recipients.\n\nIsrael’s military opened fire on the crowds as they rushed in, killing at least three Palestinians.\n\nAt least 47 others were wounded and seven missing, according to Palestinian authorities in Gaza and the UN.\n\nThe Gaza Humanitarian Foundation (GHF) denied such reports, while the Israeli military said it fired “warning shots” and later re-established control of the facility.\n\nAccording to Israeli media, Americans affiliated with the GHF had to be rescued once they lost control of the facility.\n\nUN spokesperson Stephane Dujarric described the scenes as “heartbreaking, to say the least”.\n\n“We and our partners have a detailed, principled, operationally sound plan - supported by member states - to get aid to a desperate population,” Dujarric told reporters.\n\n“We continue to stress that a meaningful scale-up of humanitarian operations is essential to stave off famine and meet the needs of all civilians, wherever they are.”\n\nDujarric added that aid needed to be distributed in a way that was independent and impartial.\n\n“We saw the plan that [the GHF] published and that they presented to us, and it is not done with the parameters that we feel match our principles, which we apply across the board, from Gaza to Sudan to Myanmar, to anywhere you want to talk about.”\n\nPhilippe Lazzarini, head of Unrwa, the UN agency for Palestinian refugees, said Israel’s model for providing aid was wasteful and a “distraction from atrocities”.\n\n“The model of aid distribution proposed by Israel does not align with core humanitarian principles,” Lazzarini said on Wednesday.\n\n“We have seen yesterday the shocking images of hungry people pushing against fences, desperate for food. It was chaotic, undignified and unsafe.”\n\nAhmed Bayram of the Norwegian Refugee Council called on Israel and the US to scrap the initiative.\n\nHe said: “This is not how aid is done; this is not how aid should be distributed, not least obviously an occupier doing that - a country that has destroyed and flattened Rafah, asking people to come back to Rafah, that has displaced people out of Rafah, and now tells them to come back and receive whatever they can get hold of.”\n\nThe GHF said in a statement that it had distributed 8,000 food boxes, which it said amounted to around 462,000 meals.\n\nIsraeli Prime Minister Benjamin Netanyahu played down the chaotic scenes.\n\n“There was some loss of control momentarily. Happily, we brought it back under control,” he said.\n\nHe also went on to falsely claim that there was no proof of malnutrition in Gaza, stating: “You don’t see one, not one emaciated [person] from the beginning of the war to the present.”\n\nThe GHF is an Israeli-backed organisation established in early 2025 to manage a new model of humanitarian aid distribution in the Gaza Strip.\n\nIt was incorporated in Switzerland in February 2025, with a US-based counterpart also registered.\n\nThe organisation presented itself as an independent and neutral body, aiming to deliver aid directly to Palestinian civilians through a network of four secure distribution sites in southern and central Gaza.\n\nAccording to the GHF, the aid distribution sites are managed by private US security and logistics firms, including UG Solutions and Safe Reach Solutions (SRS), that are responsible for securing distribution hubs and overseeing vehicle checkpoints.\n\nBoth SRS and UG Solutions have faced scrutiny regarding their legitimacy and transparency. Critics, including Israeli opposition leader Yair Lapid, have suggested that these entities might be “shell companies” designed to obscure Israeli government involvement and funding in the aid process.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/un-and-aid-groups-condemn-us-israeli-initiative-after-deadly-scenes-gaza"
    }
  },
  {
    "similarity": 0.3376,
    "is_article": {
      "title": "Iran protests over ‘fake’ Austria intel report accusing Tehran of pursuing atom bomb",
      "content": "Iran on Friday summoned Austria’s charge d’affaires after it branded as “fake” an Austrian intelligence report that said Tehran is seeking to acquire atomic weapons.\n\nThe spat comes even as Tehran pursues delicate negotiations with the United States on its nuclear program.\n\nIn its annual report on global threats, Austria’s domestic intelligence service (DSN) said Monday that Iran’s “nuclear weapons development program is well advanced.”\n\nThe United States, Israel and other Western countries have repeatedly accused Iran of seeking to acquire a nuclear weapon. Tehran has repeatedly threatened to destroy Israel.\n\nIran has categorically denied the claims, instead arguing that it is pursuing a nuclear program for civilian purposes alone.\n\nAccording to the International Atomic Energy Agency (IAEA), however, Iran is the only country in the world that enriches uranium up to 60 percent, a number that has no civilian uses.\n\nThat rate is still just below the 90% threshold required for a nuclear weapon, but far above the 3.67% limit set under a 2015 agreement with world powers.\n\n“All efforts to prevent Iran’s armament through sanctions and agreements have so far proved ineffective,” the Austrian report said.\n\nOn Friday, Iran’s foreign ministry condemned “the fake information” disseminated in the report and demanded an explanation from Austria’s government.\n\nIt later summoned Austria’s charge d’affaires in Tehran Michaela Pacher to “convey Iran’s strong protest,” the official IRNA news agency reported.\n\nIt said that during the meeting, the ministry “emphasized the complete contradiction of the Austrian report with numerous IAEA reports.”\n\nThe IAEA, whose headquarters are in the Austrian capital, will in the coming days publish its own review of Iran’s nuclear activities.\n\nIran and the United States are engaged in an Omani-mediated effort to reach a deal on Tehran’s nuclear program, after Donald Trump during his first presidency pulled out of the 2015 agreement.\n\nNo date has yet been set for the next Iran-US meeting since last week’s discussions in Rome.\n\nOn Thursday, Iranian Foreign Minister Abbas Araghchi said he was “not sure” that a deal with the United States was imminent.\n\nHis statement came after Trump said on Wednesday that the two sides were “very close to a solution.”\n\nTimes of Israel Staff contributed to this report\n\n",
      "url": "https://www.timesofisrael.com/iran-protests-over-fake-austria-intel-report-accusing-tehran-of-pursuing-atom-bomb/"
    },
    "me_article": {
      "title": "French scholar acquitted of ‘apology for terrorism’ charges after Palestine tweets",
      "content": "Francois Burgat, a renowned French specialist on thePalestinian-Israeli conflictand political Islam, was acquitted on Wednesday by the criminal court of Aix-en-Provence, in southeasternFrance, where he was prosecuted on charges of “apology for terrorism” for messages posted on social media.\n\nThe prosecution accused the former research director at the National Centre for Scientific Research and former director of the French Institute for the Near East, now retired, of a series of controversial social media posts concerning Hamas andIsrael’swar on Gaza.\n\nDuring the trial in April, the prosecutor asked for an eight-month suspended prison sentence, a $4,500 fine, a six-month ban from social media and a two-year ineligibility period against Burgat.\n\nSpeaking to Middle East Eye, Burgat praised a \"wise lucidity from the court\", but expected the prosecution to appeal.\n\n\"Let's hope that this wisdom, which several dozen of my compatriots convicted without any justification in the same type of case have not benefited from, will henceforth become the guiding principle of the French judicial system,\" he said.\n\nThe casebeganwith a post the scholar published on X (formerly Twitter) on 2 January 2024, where he shared a statement by Hamas following the publication of a New York Times investigation into sexual violence allegedly committed by thePalestiniangroup during its 7 October attacks in Israel.\n\nIn the statement, Hamas rejected the accusations and denounced a \"Zionist attempt to demonise the [Palestinian] resistance\".\n\n‘Let's hope that this wisdom... will henceforth become the guiding principle of the French judicial system’\n\n- Francois Burgat\n\n\"Our fighters are fighters for freedom and dignity and cannot commit such shameful acts,\" Hamas said in the statement shared by Burgat.\n\nIn response to internet users who condemned his post, the former academic wrote that he had \"infinitely more respect and consideration for the leaders of Hamas than for those of the state of Israel\".\n\nHe thenposteda page from one of his books explaining \"the context in which [his] respect and admiration for Hamas asserted themselves\".\n\nIn aninterviewthat week, he also declared: \"Just because I have to acknowledge that there was a terrorist movement on 7 October doesn't mean I have to criminalise the Palestinian liberation movement.\"\n\nFor these comments, a complaint was filed by the European Jewish Organisation, a group founded in 2014 that has taken several legal actions for \"apology for terrorism\" in the name of fighting antisemitism and anti-Zionism.\n\nIn July 2024, Burgat was placed in police custody for seven hours following a report from the DGSI, the main French domestic intelligence service.\n\nA new charge was added in December 2024 after Burgat defended two individuals who were accused of launching a hate campaign that led to the killing of teacherSamuel Patyin October 2020 and convicted of complicity in terrorist assassination.\n\nBurgat wrote at the time that France had \"fallen outside the rule of law\" and criticised the ruling as meaning that \"we are all 'terrorists'.\"\n\nDuring his trial in April, whenaskedby the judge whether he thought \"Hamas is a terrorist movement\", the scholar replied that he had \"never congratulated” the group for the 7 October attacks.\n\n“On that day, [Hamas] committed acts that can be labelled terrorist; but we must not extrapolate to its entire history,\" he said.\n\nBurgat told MEE he hadaskedChatGPT if he had any chance of being convicted for \"apology for terrorism\".\n\nThe artificial intelligence programme responded: \"Your comments, however critical or provocative they may appear in the public debate, generally fall within the scope of political and geopolitical analysis, which is protected by freedom of expression and research.\"\n\nChatGPT concluded that \"a conviction is not likely, either legally or constitutionally,\" but offered a warning: \"However: The current political context (polarised around Islam, the Israeli-Palestinian conflict or secularism) can lead to manipulation or abusive prosecution, including against intellectuals.\"\n\nAs an increasing number of people are being prosecuted worldwide for expressing their solidarity with Palestinians, Burgat's defence team denounced the prosecution as an attack on freedom of expression and the political manipulation of the justice system.\n\n\"There are two offences that are systematically charged against those who express their solidarity with Palestine: either incitement to hatred or apology for terrorism,\" Rafik Chekkat, one of Burgat’s lawyers,said.\n\nIn a message posted on X, Chekkat expressed hopes that \"this acquittal will lead to others\".\n\n\"I hope the decision regarding Francois Burgat will help change the repressive climate regarding Palestine and slow the pace of prosecutions for apology for terrorism,\" hesaid.\n\nSince October 2023, there has been a marked rise in the use of the \"apology for terrorism\" offence in France, with authorities launching hundreds of investigations into comments made about the war in Gaza, including by political figures such as left-wing France Unbowed (LFI) MPMathilde Panotand future MEPRima Hassan.\n\nJean-Paul Delescaut, leader of the General Confederation of Labour union, was handed a suspended one-year jail sentence for writing in response to the attacks: “The horrors of illegal occupations… are receiving the responses they provoked.”\n\nOn 18 June, Anasse Kazib, a railway worker and spokesperson for the Trotskyist political group Revolution Permanente, will also be tried for \"apology for terrorism\".\n\nOn X, Kazibposted: \"Very happy for Francois Burgat, this is important news in the fight against the criminalisation of supporters of the Palestinian people. I hope that we will all be released tomorrow like François Burgat and that the repression against those who speak out against the genocide will cease.\"\n\nBurgat’s acquittal comes as France has adopted a much more critical stance towards Israel in recent weeks, with President Emmanuel MacronlobbyingEuropean powers to recognise Palestinian statehood at a UN conference next month and agrowing numberof public personalities using the term \"genocide\" to describe Israeli actions in Gaza.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/french-professor-acquitted-apology-terrorism-charges-after-palestine-tweets"
    }
  },
  {
    "similarity": 0.2475,
    "is_article": {
      "title": "Six months after ceasefire, some in north are slow to recover as fears of new fight lurk",
      "content": "SHTULA – Shula Giladi, known as Shula from Shtula, used to welcome tourists into her northern Israel home with Kurdish delicacies and stories of her family’s life in Kurdistan a century ago.\n\nThen the Lebanese terror group Hezbollah began firing anti-tank missiles, rockets and explosive drones across the border, damaging her home and hundreds of others’.\n\nNow, the displaced 72-year-old jokes wryly that she is known as Shula with a suitcase.\n\nGiladi’s house sits less than 500 meters (1640 feet) from the Lebanese border, which has remained quiet since late November, when a ceasefire was reached to end the Iran-backed group’s 13-month campaign of terror.\n\nBut six months after the fighting stopped, many, like Giladi, are still living with its effects, their homes still in disrepair and their communities scattered.\n\nSitting with The Times of Israel in her garden, once lush and verdant but now in ruins, the former host was unable to offer a glass of water or even the use of a bathroom.\n\nGiladi hopes to move back once the repairs are finished, but she is now waiting for appraisers to submit reports and for the government to approve her expenses, with no idea how long the whole process will take.\n\n“I’ve dropped the word ‘return’ from my lexicon,” said Giladi.\n\nHer sense of displacement is echoed by many of the 60,000 residents of 32 communities in northern Israel, who have been homeless since being evacuated beginning on October 8, 2023, when Hezbollah and allied groups began firing into Israel in solidarity with Hamas and the war that the allied terror group had sparked in Gaza with its invasion of the south a day earlier.\n\nThe fighting in the north saw daily indiscriminate Hezbollah attacks on communities near the border, and occasionally further south, drawing Israeli reprisals. The simmering conflict broke open in late September as Israel decapitated the terror group’s leadership and launched a limited ground invasion into southern Lebanon amid intensified fire on the north.  It came to an end with a temporary truce on November 27, 2024, followed in February by a permanent, albeit shaky, ceasefire agreement.\n\nOver 13 months, the attacks claimed the lives of 46 civilians inside Israel and 83 Israeli soldiers, with hundreds more wounded. Homes, businesses, farms and infrastructure in dozens of northern towns suffered extensive damage, and a once-thriving tourist industry was left decimated.\n\nAbout 61% of the evacuees have returned to their communities since fighting ended, according to the Alma Research and Education Center, an independent nonprofit specializing in security challenges on Israel’s northern border.\n\nSome are staying away until the end of the school year, or have no homes to return to yet. In Shtula and nearby Kibbutz Sasa, many expressed a deep sense of uncertainty about whether the ceasefire with Hezbollah will hold.\n\nIn the six months since the ceasefire, Israel has carried out sporadic attacks on what it says are Hezbollah members in southern Lebanon, and has left troops at four key locations across the border in a bid to ensure the terror group does not rebuild a military foothold along the frontier. So far, Hezbollah, which is thought to have been significantly weakened by the war, has resisted responding.\n\n“From 2022 until the summer of 2023, Hezbollah was 100 percent ready to invade northern Israel,” Lt. Col. (Ret.) Sarit Zehavi, the CEO and founder of the Alma Center, spoke at a conference in Kibbutz Lochamei HaGhettaot on May 21. “Right now is what I’d call the cease between fires. We can’t keep fooling ourselves after October 7.”\n\nOn October 7, 2023, thousands of Hamas-led terrorists invaded Israel, killed 1,200 people, and kidnapped 251 people into the Gaza Strip. The attack stands as a chilling, ominous reminder to northern residents of what could have befallen them if Hezbollah had implemented what Israel says were its own plans for a massive cross-border assault.\n\nThe western Galilee moshav of Shtula was founded in 1969 by a small group of families from Kurdistan and Iraq. The family of Giladi, who was 16 at the time, was among them.\n\nResidents mostly supported themselves with small family farms. Giladi dreamed of opening a hospitality business, but worried about the community’s location on the northern border. “Who will come to Shtula to eat?” she recalled asking herself at the time.\n\nBefore the war, approximately 300 people called the moshav home. The community prided itself on its mix of religious, traditional, and “young folks with dogs and tattoos,” according to another Shtula resident,Hadas Lahav.\n\nAfter the war ended, the roads damaged by tank treads were repaired. But there are still destroyed cars and mangled bus shelters that haven’t yet been removed. Many houses are pockmarked with shrapnel.\n\nGiladi, a member of the temporary planning board of the moshav, said that 20% of residents had already moved back. She believes more will return in July, after the end of the school year.\n\nOnly some 2% said they do not plan to return. Still, the community hopes to expand its footprint, with 15 families expressing interest in moving there.\n\nThe community is also hoping that visitors will return.\n\nOhad Hatan, who owns the On the Border Cafe in the moshav, said he is finishing renovations and plans to re-open shortly, hoping that people will visit.\n\nThe cafe is located in a grove of trees next to what is known as the “Talking Walls” border, a concrete barrier erected to protect the town that was festooned in 2018 with murals by a number of international artists.\n\nDuring the first part of Giladi’s evacuation, she stayed at her children’s houses and then at a hotel in Tel Aviv, where she ran a pop-up Kurdish food restaurant and did well.\n\n“But a house is not only four walls, it’s also my history, my memories, my essence,” she said. As the war raged, she had “moments of crisis, but I know how to find happiness. My friends who had nothing to do except sit in the hotel lobby were broken.”\n\nSpeaking at the Alma Center conference, Dmitry Apartsev, Senior Director of Government Relations Department, Northern Reconstruction Headquarters, said that the government has allocated NIS 8 billion ($226,000,000) over four years to address the needs of the frontline communities in the north. The money is an opportunity to provide “broad and comprehensive solutions, not just localized or emergency responses.”\n\nGiladi said she is optimistic but also pragmatic.\n\nWalking her visitor out of her gate, she reached for a grape leaf hanging off a vine and nimbly folded it into an envelope, explaining how she used to stuff them to make kubbeh for guests visiting her home, something she won’t be able to do, at least for a while.\n\n“This is a reality I can’t change,” she said.\n\nSome 15 kilometers (nine miles) to the east, members of Kibbutz Sasa were chatting over food at long tables in the community’s communal dining room.\n\nDuring the war, almost all the 450 members of the kibbutz were evacuated, but 90% of them have since returned.\n\nVarda Yatom, 79, who has lived on the kibbutz since 1964, said that during the evacuation, “12 elderly kibbutz members died of broken hearts.”\n\n“It was very hard for them to be away from the kibbutz,” Yatom said.\n\nSurrounded by grapevines, apple orchards, and trees, Sasa sits about 3 kilometers (two miles) from the Lebanese border, a short distance that was seemingly enough to save it from the kind of extensive damage seen on Shtula.\n\nThe worst damage was suffered by a school auditorium that took a direct hit, with much of the rest of the town escaping unscathed.\n\nYatom said she wanted to believe that Hezbollah leaders decided not to destroy the kibbutz the way “Nazis preserved Paris, so they’d have somewhere to go for a holiday.”\n\nThe internationally acclaimed artist moved to Kibbutz Nachsholim during her evacuation, but was unable to find a place to make her art.\n\nDuring the war, she sometimes returned under fire to her studio in the kibbutz.\n\n“I didn’t feel fear,” Yatom said as she stood in her kibbutz gallery, where her sculptures are displayed. “I’d rather die with clay in my hand than not work on my art. A day without doing art is wasted.”\n\nAnother kibbutz member, Edna Angelica Calo Livne, 69, stayed on the kibbutz during the war to be with her husband, who is part of the kibbutz’s emergency response team.\n\nCalo Livne, who moved from Italy to the kibbutz in 1975, is the founder of Beresheet LaShalom, a community theater group for Jews, Muslims, Druze, and Christians meant to foster dialogue through performing arts.\n\nDuring the fighting, she traveled to Italy on several occasions to speak about her experiences. People there were surprised to hear that even during war, she still believed in peace, she said.\n\nMany in the north remain circumspect that the calm will last. Next week will mark 43 years since Israel invaded Lebanon in an operation advertised as bringing peace to the Galilee, a promise belied by decades of skirmishes and now two major wars.\n\n“Hezbollah has not given up its dream of destroying Israel,” Tal Beeri, the director of Alma’s Research Department, said at the May 21 conference. “The ideology of Hezbollah hasn’t changed.”\n\nBut Calo Livne remains undeterred.\n\n“If we don’t believe in peace, we have no future,” she said. “Each day, we can discover how many resources, energy, and answers we have. Life always teaches us something new and unpredictable.”\n\n",
      "url": "https://www.timesofisrael.com/six-months-after-ceasefire-some-in-north-are-slow-to-recover-as-fears-of-new-fight-lurk/"
    },
    "me_article": {
      "title": "Israeli foreign minister says arms embargoes will lead to 'second Holocaust' and end of Israel",
      "content": "Israel’s foreign minister has said that an arms embargo on his country would lead to the elimination of the Israeli state and “a second Holocaust”.\n\nGideon Saar wasspeakingon Tuesday at an international conference on antisemitism in Jerusalem.\n\n\"If, God forbid, the calls and actions of countries and politicians for an arms embargo on Israel succeed, the result will be the destruction of Israel and a second Holocaust,\" he said.\n\nThe comments came as Spain this week called on European countries to suspend arms shipments amid Israel’s ongoing siege on Gaza.\n\nAt a meeting of the “Madrid Group”, Spain’s foreign minister called for an immediate suspension of Europe’s cooperation deal with Israel and an embargo on arms shipments.\n\nGermany,France, theUK, Italy,Egypt,Jordan,Saudi Arabia,Turkey,Moroccoand Brazil were among those present at the meeting.\n\n“What is the meaning of actions or statements - by politicians or countries - to impose an arms embargo on Israel?” said Saar, in response.\n\n“If such moves succeed, Israel will simply be destroyed. There will be another Holocaust - on the soil of the land of Israel.”\n\n“This is essentially a way to deprive the Jewish people of the means to defend themselves. Means that they so lacked during the long years of exile and during the Holocaust.”\n\nThe largest suppliers of weapons to Israel are the United States, Germany and Italy.\n\nSeveral nations, including France, Spain and the UK, have either paused the supply of some weapons, or have suspended export licences.\n\nAreportearlier this month found that the UK continued to send a wide range of arms to Israel even after the government suspended 30 arms export licences in September.\n\nThe UK, France and Canada have threatened Israel with sanctions if it fails to stop its military operations in Gaza and immediately allow humanitarian aid to enter.\n\n\"We will not stand by while the Netanyahu government pursues these egregious actions,\" the countries said jointly on 20 May.\n\n\"If Israel does not cease the renewed military offensive and lift its restrictions on humanitarian aid, we will take further concrete actions in response.\"\n\nThe three countries also urged Israel to halt settlements in the occupied West Bank, saying they are \"illegal and undermine the viability of aPalestinianstate and the security of both Israelis and Palestinians\".\n\nIn response, Prime Minister Benjamin Netanyahuaccusedthe three governments of emboldening Hamas and being “on the wrong side of justice”.\n\nIsraeli attacks on Gaza have killed more than 54,000 Palestinians and wounded more than 120,000 since October 2023.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/israels-foreign-minister-says-arms-embargoes-will-lead-second-holocaust"
    }
  },
  {
    "similarity": 0.2384,
    "is_article": {
      "title": "Beitar Jerusalem fans attack Arab bus drivers after team’s loss, no arrests so far",
      "content": "Dozens of fans of the Beitar Jerusalem soccer team attacked two Arab bus drivers in Jerusalem on Thursday night, following a live broadcast of the team’s loss in the State Cup finals.\n\nIn videos shared on social media, fans can be seen punching a driver and throwing objects in his direction. Footage also shows the driver throwing the bus’s small trash can at the assailants in self-defense. Another clip shows another driver pushing fans against the door of a bus, as they hit him.\n\nAs of Friday afternoon, no one has been arrested in connection with the incident, and no suspects have been announced by police.\n\nOne of the bus drivers, Ahmad Karhin, told the Haaretz newspaper that he was driving the 77 line, which ends at Malha Mall, near the team’s home, Teddy Stadium, where the game was being broadcast.\n\n“Many tens of young Beitar Jerusalem fans arrived, I recognized them from the clothes and scarves,” he recalled.\n\n“They identified that I was Arab after they spoke with me, and they started, out of nowhere, to yell at me ‘Death to Arabs,’ to curse and to attack me. The whole time, more and more of them were joining,” he said.\n\nKarhin told Haaretz that another Arab bus driver, Mohammad Saj, arrived at the scene and helped him, but that the second driver was also attacked.\n\n“No one was helping me apart from that driver,” Karhin recalled.\n\n“The police arrived 20 minutes later, maybe half an hour, and they rescued me from there and brought me to Magen David Adom, who transferred me to a hospital. I was scared for my life, I was afraid I wouldn’t get out of there alive,” he said.\n\nHe added: “This isn’t the first time drivers have been attacked, but it was the most brutal incident.”\n\nSaj, a resident of East Jerusalem, told the Ynet news site: “I saw Karhin attacked by dozens of Beitar Jerusalem fans. I stopped and got off [my bus] and helped him, and I was also attacked.\n\n“They cursed at me, ‘Arabs are sons of whores, dogs, we’ll burn you, get out of here,’ and other racist statements,” he recalled.\n\nIsrael Police said in a statement: “We look with severity upon acts of barbarism and violence in the public square, in particular when they are committed against public servants and bus drivers.”\n\n“Immediately upon receiving notice, officers arrived at the scene, scanned for suspects and opened an investigation. We will continue to operate with determination and using any means at our disposal to locate the suspects and circumstances of the incident,” the statement concluded.\n\nThe two drivers who were attacked, both East Jerusalem residents, work for the Superbus company.\n\nIn a statement on Friday, Superbus said the incidents “join many other violent incidents that have occurred on a daily basis against bus drivers in Jerusalem.\n\n“In videos from the violent incidents last night, the criminals are clearly visible and we expect and call on all law enforcement bodies, and the management of Beitar Jerusalem, to bring the law-breakers to justice immediately,” the company said.\n\nThe Beitar team and their fans, particularly the hardcore group of ultras known as “La Familia,” have a long reputation of racism, routinely chanting “death to Arabs” at games and refusing to integrate Arab or Muslim players into the team.\n\nThe Koach LaOvdim labor union said it was “weighing taking steps as an organization,” declaring in a statement that it “will not agree to public transit workers being punching bags for passengers.”\n\nIti Cohen, who heads the transit employees’ branch of Koach LaOvdim, warned, “Every day brings us closer to the murder of a driver or fare inspector.”\n\n“The 77 is prone to disaster at the end of every Beitar game. We’ve warned the police and the administration about this more than once, and the threat only gets worse,” Cohen said, and demanded that the Transportation Ministry provide more security for transit employees.\n\nJerusalem Mayor Moshe Lion condemned the attack on the bus drivers — the first time he has done so for an incident of this type, according to the Kan public broadcaster.\n\n“The violence against the bus drivers crosses a red line,” Lion said in a statement. “We cannot accept a reality in which hard-working, dedicated workers fear for their lives while doing their job.\n\n“Harming someone based on their origin or their sex is a severe, intolerable thing and goes against our Jewish values,” he added.\n\nThe mayor called on “the police and Transportation Ministry to work with determination to eradicate this phenomenon and watch over the security of drivers and passengers alike.”\n\nAs of Friday morning, Transportation Minister Miri Regev was yet to comment on the incident, drawing her own condemnation from MK Na’ama Lazimi, of the left-wing Democrats party.\n\n“More than 12 hours have passed since a group of rioters violently and harshly attacked a bus driver after the Trophy final, and the transportation minister, who is apparently busy searching for her next flight — still has not said a word about the attack on the driver, and Ben Gvir’s police haven’t arrested anyone,” she wrote on X, referring to the far-right national security minister.\n\n",
      "url": "https://www.timesofisrael.com/beitar-jerusalem-fans-attack-arab-bus-drivers-after-teams-loss-no-arrests-so-far/"
    },
    "me_article": {
      "title": "Ireland stands by claim Israel committing genocide in Gaza",
      "content": "Ireland'sTanaiste, or deputy prime minister, Simon Harris, defended the government's position on Thursday that Israel is carrying out a genocide inGaza, Irish broadcaster RTE reported.\n\n\n\n“We are the first government in the European Union (EU) to say what Israel is doing is genocide. It is genocide,\" Harris told an opposition lawmaker during a heated exchange in parliament, known as the theDáil.\n\nCatherine Connolly, an independent, accused the government of not doing enough to punish Israel for its 19-month-long war on Gaza, which has killed more than 54,000 Palestinians, more than half of them women and children, according to the Palestinian health ministry.\n\n“I’m disgusted and sickened, sickened - watching children dying on our television screens and every day I come to work, and work with all the people in here to do our best to show leadership at a time of horrific conflict,\" Harris said.\n\n“We’re working to support the people of Palestine and the only chamber I ever go into in the entire world where people don’t acknowledge that Ireland, the government, the people of Ireland, are standing with the people of Palestine, standing up for human rights, standing up for international law, is here when you get up and distort - with your ideology - the actions of this government.\"\n\nIreland recognised Palestinian statehood one year ago, and in January, it joined South Africa's genocide case against Israel at the International Court of Justice (ICJ).\n\nOn Thursday, Harris said that a bill banning trade with goods from Israeli settlements - deemed illegal under international law - would move to the foreign affairs committee next month, the Irish Times said.\n\nThe government is also under pressure tohelp remove the Central Bank’s role in permitting the sale of Israel bonds in the EU, and to stop any flights over Ireland that may be carrying weapons to Israel, the paper reported.\n\n\n\n“I’m proud of the people of this country. I’m proud that we went into an election, and it didn’t matter what party you were in, you stood up and said, ‘We are going to support the people of Palestine’.\"\n\nHarris's stance was backed by thetaoiseach - or prime minister, Micheal Martin, earlier in the week.\n\n“We have been very consistent in our support to the Palestinian people and their right to self-determination, and in condemning the war crimes and the genocide that is occurring right now,” Martin told the Dail.\n\n“The focus has to be relentlessly on the policies of Prime Minister Netanyahu and the Israeli government, made up of extreme far-right elements who are committing genocide in Gaza right now.\"\n\n\n\nIn 2018, the Occupied Territories Bill was introduced in Ireland by Independent Senator Frances Black, proposing a ban on trade with businesses operating in illegal Israeli settlements on Palestinian land, but it was ultimately blocked over concerns about breaching EU trade rules.\n\nHowever, anadvisory opinionfrom the ICJ in July marked a turning point in reconsidering the enactment of the Irish bill.\n\nThe ICJ concluded that Israel's presence in the occupied Palestinian territories is \"unlawful” and the country should “end its presence in the occupied Palestinian territory as rapidly as possible”.\n\nMore than 400 of Ireland’s senior legal academics and practising lawyers have called on thegovernmentto enact the bill in its original form, prohibiting all goods and services in the occupied West Bank, such asAirbnb.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/ireland-says-israel-carrying-out-genocide-gaza"
    }
  }
]