[
  {
    "similarity": 0.6868,
    "combined_title": "Progress and Contention in Indirect Talks for Gaza Ceasefire",
    "summary": "Following the submission of a US ceasefire and hostage deal proposal, Hamas has expressed its readiness for a new round of indirect negotiations to resolve remaining “points of contention.” The terror group's proposal includes amendments that would make it more challenging for Israel to resume fighting if talks on a permanent ceasefire are not completed by the end of a proposed 60-day truce. However, the US envoy, Steve Witkoff, dismissed these amendments as \"totally unacceptable,\" stating they would take the negotiations backward. Israel has accepted Witkoff's proposal, but it has not yet been officially approved by the Israeli cabinet. Hamas's proposed amendments include phased releases of hostages and the complete withdrawal of Israeli forces prior to the start of the war. Palestinian sources have criticized Witkoff's proposal for lacking clarity and firm guarantees and have accused the US of focusing solely on the release of Israeli captives while ignoring the humanitarian crisis in Gaza. Meanwhile, Israeli Defense Minister Israel Katz has instructed the IDF to continue its operations in Gaza, and the IDF plans to expand its ground offensive against Hamas.",
    "is_article": {
      "title": "Hamas says ready for indirect talks to resolve ‘points of contention’ on Gaza deal",
      "content": "Hamas announced Sunday that it was prepared to immediately begin a new round of indirect negotiations on remaining “points of contention” amid pressure from mediators to soften its stance, after the terror group submitted a response to a US ceasefire and hostage deal proposal that Washington called “totally unacceptable.”\n\nHamas said in a statement that its goal for the new talks would be to reach a deal that “ensures relief for our people and an end to the humanitarian catastrophe, ultimately leading to a permanent ceasefire and the complete withdrawal of the occupation forces.”\n\nThe terror group didn’t say that it had rescinded or revised the proposal that it submitted on Saturday to US special envoy Steve Witkoff.\n\nWitkoffsaidSaturday that the Hamas response “takes us backward,” adding that he had wanted Hamas to accept his “framework proposal” as the basis for a round of “proximity talks” to be held in the coming days.\n\nUS President Donald Trump hadindicatedon Friday that a deal could be announced later that day or on Saturday. Witkoff’s statement was the first time he had publicly revealed that his proposal had only been a starting point for another round of talks.\n\nHamas in its Sunday statement appeared to confirm its willingness to hold those talks.\n\nHamas’s Saturday response to Witkoff made a series of amendments to the US envoy’s proposal, including one that that would make it more difficult for Israel to resume fighting if talks on a permanent ceasefire are not completed by the end of 60-day truce outlined by the US, a source directly involved in the negotiations said.\n\nThe updated proposal submitted by Hamas also envisions the release of the 10 hostages being spread out more throughout the two-month truce, rather than in two batches on the first and seventh day, as Witkoff stipulates, according to the source.\n\nThis change was aimed at preventing Prime Minister Benjamin Netanyahu from abandoning talks on a permanent ceasefire after the 10 hostages are released or refusing to engage in the talks altogether, as he did during the previous ceasefire, which ended in March when Israel resumed intensive fighting in Gaza.\n\nThe Sunday Hamas statement also made a point of thanking Arab mediators Qatar and Egypt for their efforts to bring about a ceasefire. Hours earlier, the two countries issued a joint statement “emphasizing the importance of intensifying efforts to overcome the obstacles facing the negotiations.\n\nNetanyahu’s office said Sunday that Israel had accepted the Witkoff proposal. However, his cabinet has yet to hold a vote on it and several far-right ministers have expressed their opposition.\n\nThe US proposal was formulated in close coordination with Strategic Affairs Minister Ron Dermer, who reviewed it with Witkoff during a visit to Washington last week.\n\nThe Witkoff proposal stipulates that the parties would have to reach an agreement on the parameters of Israel’s partial withdrawal from Gaza during the 60-day truce. It also provides for further negotiations during the truce on a potential settlement to end the war.\n\nAccording to a copy of Witkoff’s latest proposal, the authenticity of which was confirmed to The Times of Israel by two sources familiar with the negotiations, Hamas would release 10 living Israeli hostages held in Gaza and return the bodies of 18 deceased hostages during the 60-day ceasefire.\n\nIn return, Israel would release 125 Palestinian terror convicts serving life sentences, 1,111 Gazans detained since the start of the war on October 7, 2023, and 180 bodies of Palestinians currently held by Israel.\n\nThe IDF would also pull back from some areas where troops are currently deployed; the parameters of the pullback would be finalized “during proximity negotiations.”\n\nThere are currently 58 hostages held in Gaza, including the bodies of at least 35 confirmed dead by the IDF, and 20 hostages who are believed to be alive. There are grave concerns for the well-being of three others, Israeli officials have said.\n\nDefense Minister Israel Katz said Sunday that “regardless of any negotiations,” he instructed the IDF “to continue forward in Gaza” and achieve all objectives.\n\nFollowing Katz’s statement, the IDF announced that Chief of Staff Lt. Gen. Eyal Zamir instructed the military to expand the ground offensive against Hamas to additional areas in the Gaza Strip. Additionally, the IDF said Zamir was instructed to establish additional aid distribution sites for the Palestinian civilian population.\n\nOnly four aid sites have been established in Gaza, and not all of them are operational. Three are in southern Gaza’s Rafah and one is adjacent to the Netzarim Corridor in the Central Strip, forcing many Gazans to embark on long and dangerous treks across a war zone in order to pick up boxes of aid to feed them for several days. The scheme managed by the Israeli- and US-backed Gaza Humanitarian Foundation has come under criticism from aid groups who say it fails to adhere to humanitarian principles.\n\nThe initiative came under further scrutiny on Sunday when dozens of Palestinians were reportedly injured near one of the sites. Hamas authorities claimed the IDF opened fire on the Gazans, while the military vehemently denied having done so.\n\n",
      "url": "https://www.timesofisrael.com/hamas-says-ready-for-indirect-talks-to-resolve-points-of-contention-on-gaza-deal/"
    },
    "me_article": {
      "title": "Hamas accepts Witkoff truce outline with amendments aimed at ending war",
      "content": "Hamas has agreed to the outline of a ceasefire deal drafted by US envoy Steve Witkoff, with amendments that include guarantees it would lead to negotiations aimed at permanently ending theIsraeli war on Gaza, Middle East Eye has learnt.\n\nThe 13-point outline with Hamas's changes, obtained by MEE through informedPalestiniansources, details terms the group has conditionally accepted.\n\nThese include a 60-day ceasefire, with US President Donald Trump proposed as guarantor ofIsrael’s compliance.\n\nAs part of the agreement, Hamas has agreed to release 10 living Israeli captives and the remains of 18 others, in exchange for a number of Palestinian prisoners to be agreed upon.\n\nHowever, the group proposed that the releases be carried out in phases: four living captives would be freed on day one, two on day 30, and the final four on day 60. The remains of Israeli captives would also be returned in stages - six on day 10, another six on day 30, and the final six on day 50.\n\nHamas has also called for Israeli forces to withdraw to the positions they held prior to 2 March 2025.\n\nA Palestinian source close to the negotiations criticised Witkoff for pushing an initial draft that lacked clarity and firm guarantees, telling MEE it reflects “ill intention” and warning that it could cause the fragile talks to collapse.\n\nSpeaking on condition of anonymity, the source said: “Witkoff’s insistence on releasing all the captives in the first week shows ill intention. Based on previous experience, the Israelis will simply return to full-scale war and sabotage the rest of the agreement.”\n\n'Hamas feels Witkoff betrayed them twice'\n\n- Palestinian source\n\nHe accused the United States of focusing solely on the release of Israeli captives, while ignoring the continued killing of thousands of Palestinians and the spread of famine in Gaza.\n\n“Hamas feels Witkoff betrayed them twice,” the source said.\n\n“First, when Israel violated the US-guaranteed deal on 2 March by imposing an embargo on aid and then resuming full-scale war on 18 March - with the full support and cover of Witkoff and the US administration.\n\n“And second, when Hamas released an American-Israeli soldier, Edan Alexander, in good faith, expecting humanitarian relief and a shift in the negotiating approach - which clearly did not happen.”\n\nDuring the ceasefire talks, Israeli Prime Minister Benjamin Netanyahu reportedly demanded that all 10 living captives and the 18 bodies be released in the first week - a condition Palestinian negotiators rejected over concerns Israel would resume its military campaign immediately afterward.\n\nWhile Hamas is demanding an Israeli military withdrawal to positions held before 2 March - short of a full withdrawal from the Gaza Strip - the Palestinian source said Witkoff has failed to clarify exactly where Israeli forces would redeploy in his draft.\n\n“What guarantees do the Palestinians have for an end to the war? Witkoff and the Israelis are not demonstrating any intention ...to bring the conflict to a close'\n\n- Palestinian source\n\n“Withdrawal to where? Witkoff has been vague about this as well,” the source told MEE.\n\nThe source also expressed concern about the lack of transparency regarding the proposed humanitarian aid mechanism, describing the overall framework as offering no viable path to ending the war.\n\n“What guarantees do the Palestinians have for an end to the war? Witkoff and the Israelis are not demonstrating any intention - or offering a path - to bring the conflict to a close.”\n\nAccording to the source, earlier in the negotiations, Palestinian-American mediator Bishara Bahbah, who is working for the Trump administration, had reached a preliminary understanding with Hamas. The deal had initially been approved by Witkoff.\n\nHowever, following meetings with Israeli minister Ron Dermer and Netanyahu, Witkoff reportedly reversed his position and withdrew support for the agreement.\n\nAccording to theAxiosnews outlet, Witkoff’s ceasefire proposal was “fully coordinated with Israel and was a result of his meeting with Netanyahu’s confidant Ron Dermer” earlier this week.\n\nAxios also reported that Hamas pushed for language stipulating that if a permanent ceasefire deal is not reached within 60 days, the temporary truce would automatically be extended indefinitely.\n\nEarlier this week, Drop Site News reported that Witkoff’s latest proposal was drafted in coordination with Netanyahu and explicitly avoids guaranteeing an end to Israel’s war on Gaza.\n\nPalestinian negotiators have largely agreed to ceasefire terms set out in a deal signed on 17 January, which was violated by Israel on 18 March when it resumed its military campaign.\n\nIn the revised document submitted by Hamas, negotiations for a permanent ceasefire would begin immediately once the temporary truce takes effect.\n\nA key clause put forward by Hamas calls for an “independent committee of technocrats” to administer Gaza’s affairs following a permanent ceasefire - a provision that would see Hamas relinquish governing authority in the Strip.\n\n\n\n\n\nHowever,reportssuggest that Witkoff and Netanyahu have sought to remove provisions that would see Hamas hand over administrative control in Gaza, raising concerns the war could resume after the 60-day period.\n\nOn Saturday, Witkoff dismissed Hamas’s amendments as “totally unacceptable and only takes us backward.” He insisted the group accept the existing framework for proximity talks scheduled to begin next week.\n\nEarlier the same day, Hamas said it welcomed Witkoff’s proposal but emphasised the need for key modifications. A Hamas official told Al Jazeera the group had already agreed to an earlier version of the proposal a week earlier, only for Witkoff to return with an altered version that, according to Hamas, omitted crucial elements.\n\n“We cannot accept such a proposal as a baseline for negotiations,” said senior Hamas official Basem Naim, citing the absence of guarantees for a 60-day ceasefire, humanitarian aid, and a full Israeli withdrawal.\n\nIn its formal response, Hamas also called for urgent humanitarian and reconstruction measures. These include immediate access to aid, coordinated through the United Nations and organisations such as the Red Crescent, in line with the agreement signed on 19 January 2025, when the first ceasefire deal was reached.\n\nDuring the negotiation phase, final plans would be developed to rebuild homes, public facilities, and critical infrastructure, alongside assistance for those affected by the war.\n\n\n\nThe group demanded the full restoration of “electricity, water, sanitation, communications, and roads,” as well as the reopening of hospitals, health centres, schools, and bakeries. Hamas also urged for unrestricted movement through the Rafah crossing with Egypt and the resumption of trade and commercial activity.\n\nIts proposal for a permanent ceasefire includes a “five-to-seven-year halt in hostilities”, to be guaranteed by the United States, Egypt, and Qatar.\n\nWhile negotiations continue, Washington would remain committed to upholding the truce and ensuring the flow of humanitarian aid, with the goal of concluding talks within 60 days.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/exclusive-hamas-seeks-changes-us-backed-gaza-ceasefire-proposal"
    }
  },
  {
    "similarity": 0.5355,
    "combined_title": "Israeli Authorities Deny Access to Journalists and Arab Ministers in the West Bank",
    "summary": "Israeli authorities recently barred journalists and Arab ministers from entering the West Bank, sparking international controversy. Journalists were prohibited from visiting villages in the West Bank on a tour organized by the directors of the Oscar-winning movie “No Other Land.” The film highlights alleged Israeli settler attacks on Palestinians in the West Bank, and the tour was meant to provide journalists with an opportunity to interview residents about increasing settler violence. The Israel Defense Forces justified the decision as a measure to maintain order in the area. \n\nIn a separate incident, a delegation of Arab foreign ministers from Saudi Arabia, Egypt, Jordan, and Bahrain was also denied entry into the West Bank by Israeli authorities. The ministers were scheduled to meet Palestinian President Mahmoud Abbas in Ramallah. Israeli authorities described the planned meeting as a \"provocative\" attempt to promote the establishment of a Palestinian state, arguing that such a state could become a terrorist threat. These incidents come amid escalating violence in the West Bank and increasing international pressure on Israel to support a two-state solution.",
    "is_article": {
      "title": "IDF bars reporters from visiting W. Bank villages on tour based on ‘No Other Land’ film",
      "content": "Israeli soldiers barred journalists from entering villages in the West Bank on Monday on a tour organized by the directors of the Oscar-winning movie “No Other Land.”\n\nThe directors of the film, which focuses on Israeli settler attacks on Palestinians in the West Bank, said they had invited the journalists on the tour to interview residents about increasing settler violence in the area.\n\nIn a video posted to X by the film’s co-director Yuval Abraham, an Israeli officer —his face concealed by a ski mask and identifiable as a major by the insignia on his uniform — was seen telling a group of international journalists that “no passage” was allowed in the area due to a military order.\n\n“You know they are journalists. They’re coming to see the destruction in Masafer Yatta, the way you are destroying the community, the settler violence,” a voice off camera could be heard telling the officer, referring to the Palestinian village that “No Other Land” covers.\n\nA Palestinian man was then seen telling the officer and a soldier standing with him, whose face was also covered, that the journalists were coming to his home and should be let through. But the officer refused.\n\n“Why didn’t you prevent the settlers when they came to burn the homes… attacking people?” the man was seen telling the officer. “Why don’t you come to do this order? Why only for journalists who are holding cameras and phones?… I have so many videos of settlers coming to attack us, shooting people here, you do nothing. Why?”\n\nEventually, the officer told the journalists that they were being kept out due to the need “to keep the order in this area.”\n\nBasel Adra, the Palestinian co-director of the film who lives in the area, said the military blocked the journalists from entering two Palestinian villages they had hoped to visit.\n\nThe Israel Defense Forces did not immediately respond to a request for comment.\n\nSince “No Other Land” gained notoriety, local villagers have faced an uptick in settler attacks, including in the villages ofTubaandJinba. Hamdan Ballal, another of the film’s co-directors, wasattackedby settlers and then arrested in March, drawing global condemnation.\n\nPalestinians say the settlers operate with the tacit consent of the Israeli state, which carries out home demolitions and rarely prosecutes settlers for instances of violence against Palestinians. Locals have said the attacks are designed to intimidate them into fleeing their land.\n\nThe West Bank has seen a spike in violence since the October 7, 2023, Hamas attack on Israel sparked the war in Gaza.\n\nIn the West Bank, the military has undertaken large-scale counterterrorism operations that have killed hundreds of people — the vast majority of them combatants, according to the IDF — and displaced tens of thousands.\n\n",
      "url": "https://www.timesofisrael.com/idf-bars-reporters-from-visiting-w-bank-villages-on-tour-based-on-no-other-land-film/"
    },
    "me_article": {
      "title": "Israel blocks Arab ministers from occupied West Bank visit",
      "content": "A delegation of Arab foreign ministers has condemnedIsrael’s decision to block their planned visit to the occupied West Bank.\n\nThe delegation - including ministers fromSaudi Arabia,Egypt,JordanandBahrain- was scheduled to meetPalestinianPresident Mahmoud Abbas in Ramallah on Sunday.\n\nHowever, the visit was postponed after Israeli authorities warned late Friday that they would deny the ministers entry, according to the Jordanian foreign ministry.\n\nAs the occupying power controlling the West Bank's border with Jordan, Israel's approval was required for the delegation to travel.\n\nIn a joint statement, the ministers denounced the move as a “violation of Israel’s obligations as an occupying power” and said it reflected “the arrogance of the Israeli government, its disregard for international law, and its ongoing illegitimate policies\".\n\nThe Palestinian ambassador to Saudi Arabia told local media the visit was meant to underscore the importance of the Palestinian cause to Arabs and Muslims.\n\nAn Israeli official, speaking to the Ynet news outlet, described the planned meeting as a “provocative” attempt to promote the establishment of a Palestinian state.\n\n“Such a state would undoubtedly become a terrorist state in the heart of the land of Israel,” the official claimed. “Israel will not cooperate with efforts that threaten its security.”\n\nSaudi Arabian Foreign MinisterFaisal bin Farhan,who was set to lead the delegation, would have been the highest-ranking Saudi official to visit the occupied West Bank in nearly 60 years.\n\nThe incident comes as Israel faces mounting international pressure to support a two-state solution, backed by the United Nations and several European governments.\n\nIn June, Saudi Arabia and France are set to co-chair an international conference in New York to discuss the future of Palestinian statehood.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/arab-ministers-condemn-israeli-move-block-west-bank-visit"
    }
  },
  {
    "similarity": 0.5131,
    "combined_title": "Escalating Tensions in Gaza Amidst Humanitarian Crisis and Evolving International Relations",
    "summary": "The Israeli Defense Forces (IDF) has expanded operations in Gaza, with a strike on a Hamas command center in a school-turned-shelter resulting in civilian casualties. This escalation comes amidst a worsening humanitarian crisis in the region, as Palestinians struggle to access food and medical supplies due to an Israeli siege. Meanwhile, the U.S. has given its approval to Syria's plan to incorporate foreign jihadist former rebel fighters into the national army, provided it is done transparently. In Israel, a man committed suicide after allegedly killing his wife, marking the 14th woman murdered in the country this year. In the United States, an attack on a rally for Israeli hostages resulted in no fatalities, but one victim remains in critical condition. The suspect, Mohamed Sabry Soliman, was booked on murder charges. The United Arab Emirates has condemned the attack. Israeli soldiers also shot a Palestinian suspect alleged to be planning a rock-throwing attack. In other news, Lebanese security forces arrested a Hezbollah operative for alleged spying for Israel. US Ambassador to Israel, Mike Huckabee, accuses major American news outlets of contributing to an antisemitic climate through their coverage of the situation in Gaza.",
    "is_article": {
      "title": "IDF expands Gaza ground offensive; 14 said killed in Israeli strike on Jabalia home",
      "content": "The Times of Israel is liveblogging Monday’s events as they unfold.\n\nA man who barricaded himself on the roof of a building after his wife was found stabbed to death has jumped to his death after nine hours, Israel Police says in a statement.\n\nPolice say negotiators conducted extensive negotiations to try to talk the suspect in the woman’s murder down, but the man ultimately did not cooperate, police say.\n\nAccording to the Kan public broadcaster, the couple had recently separated.\n\nAccording to the Israel Women’s Network, 14 women have been murdered in Israel since the start of the year, 13 of them by a partner or relative.\n\nThe Boulder Police Department says there are no fatalities in the attack on a rally for Israeli hostages yesterday.\n\n“No victims have died,” the police department says in a statement.\n\nPolice said last night that one of the victims was in critical condition.\n\nThe suspect, Mohamed Sabry Soliman, was booked on murder charges in a local jail late last night. The charges are preliminary, have not been filed, and are subject to change. The reason for the discrepancy is still unclear.\n\nThe police department releases a mugshot of the suspect, who has a bandaged ear and bruising on his face.\n\nThe police department says it will hold a press conference on the attack later today and that more details are forthcoming.\n\nDAMASCUS/AMMAN, Syria/Jordan — The United States has given its blessing to a plan by Syria’s new leadership to incorporate thousands of foreign jihadist former rebel fighters into the national army, provided that it does so transparently, US President Donald Trump’s envoy says.\n\nThree Syrian defense officials say that under the plan, some 3,500 foreign fighters, mainly Uyghurs from China and neighboring countries, would join a newly-formed unit, the 84th Syrian army division, which would also include Syrians.\n\nAsked by Reuters in Damascus whether Washington approved the integration of foreign fighters into Syria’s new military, Thomas Barrack, the US ambassador to Turkey who was named Trump’s special envoy to Syria last month, says: “I would say there is an understanding, with transparency.”\n\nHe says it was better to keep the fighters, many of whom are “very loyal” to Syria’s new administration, within a state project than to exclude them.\n\nThe fate of foreigners who joined Syria’s Hayat Tahrir al-Sham rebels during the 13-year war between rebel groups and President Bashar al-Assad has been one of the most fraught issues hindering a rapprochement with the West since HTS, a one-time offshoot of al Qaeda, toppled Assad and took power last year.\n\nAt least until early May, the United States had been demanding that the new leadership broadly exclude foreign fighters from the security forces.\n\nLebanese security forces have arrested a Hezbollah operative for allegedly spying for Israel, the Saudi Al Hadath news outlet reports.\n\nMahmoud Ayoub, the financial director at Ragheb Harb Hospital, was arrested today in the town of Harouf, in the Nabatieh district, Al Hadath reports.\n\nThe arrest comes weeks after the London-based Arabic Asharq al-Awsat newspaper reported that at least 21 suspects were being held for spying for the Jewish state, including Mohammed Salah, the son of an elite Radwan Force commander and a well-known religious singer.\n\nUS Ambassador to Israel Mike Huckabee accuses major American news outlets of “contributing to the antisemitic climate” that resulted in the recent attacks targeting Israeli embassy staffers in Washington and Israeli hostages activists in Colorado over the networks’ coverage of yesterday’s shooting of Gazans near an aid distribution site.\n\n“Without verification of any source other than Hamas and its collaborators, the New York Times, CNN, and Associated Press reported that a number of people seeking to receive humanitarian food boxes from the Gaza Humanitarian Fund were shot or killed by the Israeli Defense Forces,” Huckabee says in a statement.\n\n“These reports were FALSE. Drone video and first-hand accounts clearly showed that there were no injuries, no fatalities, no shooting, no chaos,” Huckabee asserts.\n\nIt is unclear what drone footage and first-hand accounts Huckabee is referring to. GHF released what it said was drone footage showing no incident at the site, but the clip was taken during daylight hours, while the incident that reportedly injured 31 Gazans took place at around 3 a.m.\n\nWhile the IDF has denied firing at Gazans near the GHF aid site yesterday, it has acknowledged firing in the air at Palestinians. Doctors Without Borders said its aid workers treated Palestinians who said Israeli soldiers were the ones who shot at them.\n\n“The only source for these misleading, exaggerated, and utterly fabricated stories came from Hamas sources, which are designed to fan the flames of antisemitic hate that is arguably contributing to violence against Jews in the United States,” Huckabee says.\n\n“Media sources who willingly parrot these libelous allegations should recant their fake news stories, apologize and pledge to practice actual reporting of fact instead of engaging in dangerous propaganda that assists the terror group Hamas as they continue to hold innocent hostages for over 600 days after butchering over 1,200 people on October 7th,” he says, demanding an “immediate retraction” by the American media sites.\n\nThe United Arab Emirates condemns what it says was a “terrorist attack” in Colorado targeting activists calling for the release of the Israeli hostages in Gaza.\n\nThe “UAE expresses its strong condemnation of these criminal and terrorist acts and its permanent rejection of all forms of violence and terrorism targeting innocent people,” a statement from its foreign ministry says, wishing a speedy recovery to the victims and expressing solidarity with the American people and their government.\n\nA Palestinian suspect who allegedly was planning to throw rocks at a highway in the West Bank was shot by Israeli troops a short while ago, the military says.\n\nTroops of the 636th Combat Intelligence Collection Unit had spotted the suspect near the village of Sinjil as he was attempting to hurl stones on a nearby road, the military says.\n\nThe IDF says the suspect threw two bottles with “dangerous material” in them at the forces, and the soldiers returned fire.\n\nIsraeli soldiers bar journalists from entering villages in the West Bank on a planned tour organized by the directors of the Oscar-winning movie “No Other Land.”\n\nThe directors of the film, which focuses on Israeli settler attacks on Palestinians in the West Bank, say they had invited the journalists on the tour today to interview residents about increasing settler violence in the area.\n\nIn a video posted on X by the film’s co-director, Yuval Abraham, an Israeli soldier tells a group of international journalists there is “no passage” in the area because of a military order. Basel Adra, a Palestinian co-director of the film who lives in the area, says the military then blocked the journalists from entering two Palestinian villages they had hoped to visit.\n\nIsrael’s military does not immediately respond to a request for comment.\n\nThe Israeli military says it carried out a strike a short while ago against a Hamas command center embedded within a school-turned shelter in central Gaza’s Deir al-Balah.\n\nAccording to Palestinian media, at least four people were killed in the strike on the Al-Aishiya school.\n\nThe IDF says that the command center was being used by Hamas operatives to plan and carry out attacks against troops and Israeli civilians.\n\nThe military says it took steps to mitigate civilian harm, including by using a precision munition, aerial surveillance, and other intelligence.\n\nA former senior Biden administration official says, “It is without a doubt true that Israel has committed war crimes” in Gaza.\n\nMatthew Miller, who served as State Department spokesperson for the last two years of former US president Joe Biden’s term, clarifies during a podcast interview withSky Newsthat he doesn’t believe Israel is perpetrating a genocide in Gaza.\n\n“There are two ways to think about the commission of war crimes,” Miller says. “One is if the state has pursued a policy of deliberately committing war crimes or is acting recklessly in a way that aids and abets war crimes. Is the state committing war crimes?\n\n“That, I think, is an open question. I think what is almost certainly not an open question is that there have been individual incidents that have been war crimes where Israeli soldiers, members of the Israeli military, have committed war crimes,” he adds.\n\nIsrael has long denied that it is committing war crimes in Gaza, asserting that it takes steps to avoid civilian casualties, while Hamas operates among civilians in order to maximize such figures.\n\nMiller acknowledges that there had been disagreements within the Biden administration about its Gaza war policy, including on whether to withhold weapons from Israel. However, he argues that doing so might have led Hamas to refrain from agreeing to a ceasefire.\n\n“It was clear to us in that period that there was a time when our public discussion of withholding weapons from Israel, as well as the protests on college campuses in the United States and the movement of some European countries to recognize the state of Palestine… All of those things together were leading the leadership of Hamas to conclude that they didn’t need to agree to a ceasefire, they just needed to hold out for a little bit longer, and they could get what they always wanted,” he says.\n\n“The thing that I look back on… is in that intervening period between the end of May and the middle of January [2025], when thousands of Palestinians, innocent civilians were killed… was there more that we could have done to pressure the Israeli government to agree to that ceasefire? I think at times there probably was,” Miller says.",
      "url": "https://www.timesofisrael.com/liveblog-june-2-2025/"
    },
    "me_article": {
      "title": "Israel fires at Palestinian aid seekers as new north Gaza expulsion orders issued",
      "content": "Israeliforces shot and wounded more than 20Palestinianson Friday as they attempted to receive aid at an US-run food distribution point in central Gaza, amid a worsening humanitarian crisis in the besieged strip.\n\nThe scenes were \"chaotic and uncoordinated\" with no effective humanitarian mechanism in place, according to the Palestinian Wafa news agency.\n\nCivilians in Gaza have been desperately seeking food supplies, as no essentials or humanitarian aid have entered the area since a complete Israeli siege began on 2 March.\n\nAccording to recent statistics published by the Gaza-based Government Media Office, at least 58 people, including 53 children, have died as a direct result of malnutrition since the start of the war.\n\nMeanwhile, a further 242 deaths were due to a lack of food and medicine, with the majority of victims being children and the elderly.\n\nIn aposton Friday, the UN agency for Palestinian refugees (Unrwa) noted that its warehouse in Amman, a three-hour drive away from Gaza, contains enough stockpiled aid to last a month for over 200,000 people.\n\nThe essentials include flour, food parcels, hygiene kits, blankets and medical supplies.\n\n\"Gaza needs aid at scale - an unhindered, uninterrupted flow of supplies must be allowed in,\" the agency said.\n\nIn an interview with MEE Live's Mathilda Mallinson, Palestinian journalist Mohammed Shehada described the Israeli aid distribution centres in Rafah as \"heavily militarised concentration camps,\" expressing widespread fear among Gaza residents.pic.twitter.com/FT2CZOUEBJ\n\nThe limited aid distributed this week has been provided by the Gaza Humanitarian Foundation (GHF), ascandal-plaguedorganisation that is a US-Israeli initiative designed to bypass the UN's infrastructure for aid delivery and distribution in the strip.\n\nSenior humanitarian officials and aid organisations have condemned the GHF, arguing that a new mechanism is unnecessary, especially with ongoing Israeli interference with aid and continued attacks on civilians waiting at distribution points\n\nAs Israel intensifies its assault on Gaza on the 602nd day of the war, further displacement orders have been issued.\n\nAvichay Adraee, the Arabic-speaking spokesperson for the Israeli army, called on Palestinians residing in the areas of Al-Atatra, Jabalia Al-Balad, Shujaiya, Al-Daraj and Al-Zeitoun, located in the north of the Gaza Strip, to flee westward.\n\n\"From this moment on, the mentioned areas will be considered dangerous combat zones,\" the post read, adding that the military is expanding its operations in the region.\n\nAt least 28 Palestinians were killed across the Gaza Strip on Friday morning, following the latest round of Israeli offensives. The death toll is expected to rise as operations intensify.\n\nThe International Organisation for Migration stated on Tuesday that nearly 180,000 Palestinians in Gaza have been forcibly displaced by recent Israeli military actions.\n\nA statement issued on behalf of the Global Camp Coordination and Camp Management Cluster condemned direct attacks on shelters, stating that such incidents had become \"common\".\n\nMeanwhile, ceasefire talks have been left in limbo after the United States presented a new proposal that reportedly lacked a guarantee to end the war and ensure the withdrawal of Israeli forces.\n\nThe White House said Israel had accepted the new proposal, while Hamas confirmed it was still reviewing it.\n\nThough the new proposal has not been made public, senior Hamas official Sami Abu Zuhri told Reuters the group was \"surprised\" by Israel's response, which he said was \"practically the opposite\" of what had been agreed and relayed to the American envoy via mediators earlier this week.\n\n\"The Israeli response contains no commitment to a ceasefire, no withdrawal from the Gaza Strip, and keeps Israeli control over the aid entry mechanism,\" he said.\n\n\"What Netanyahu is offering is a bad proposal aimed at forcing our people into submission.\"\n\nHamas official Basem Naim echoed this view, telling Reuters that Israel’s response \"fundamentally seeks to entrench the occupation and perpetuate policies of killing and starvation, even during what is supposed to be a period of temporary de-escalation\".\n\nHe added that the Hamas leadership was conducting a \"thorough and responsible review\" of the latest offer.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/israel-shells-palestinians-seeking-aid-it-issues-new-expulsion-orders-north-gaza"
    }
  },
  {
    "similarity": 0.4648,
    "combined_title": "Rising Anti-Semitism and Calls for Palestinian Statehood Create Tensions for Israel",
    "summary": "Prime Minister Benjamin Netanyahu condemned a recent terror attack in Boulder, Colorado, attributing it to anti-Semitic sentiments and 'blood libels' against Israel and Jews. The attack injured at least eight people during a demonstration for hostages held in Gaza. Meanwhile, Netanyahu faces pressure from French President Emmanuel Macron's push for recognition of Palestinian statehood, which has significant backing from the European Union and Saudi Arabia. Macron's initiative is seen as a potential catalyst for a peace process and a two-state solution. However, Israel's foreign ministry has criticized the move, arguing it rewards the actions of Palestinian armed groups. These developments highlight the increasing international pressure on Israel amidst rising anti-Semitic violence globally and ongoing conflict with Palestine.",
    "is_article": {
      "title": "Netanyahu says Boulder attack a direct result of ‘blood libels’ against Israel and Jews",
      "content": "Prime Minister Benjamin Netanyahu on Monday condemned the “vicious terror attack” in Boulder, Colorado against people demonstrating for the hostages held in Gaza, saying that a recent spate of violent attacks against Jews around the world was a direct result of “blood libels against the Jewish state and people.”\n\nAt least eight people were wounded Sunday in Boulder, including one person in critical condition, when themarchers were attackedby a man shouting “end Zionists,” who fired a makeshift flamethrower and threw firebombs at them. The incident occurred on the eve of the Jewish festival of Shavuot.\n\n“This attack was aimed against peaceful people who wished to express their solidarity with the hostages held by Hamas, simply because they were Jews,” Netanyahu said in a relatively rare statement on a Jewish holiday.\n\n“I trust the United States authorities to prosecute the cold-blooded perpetrator to the fullest extent of the law and do everything possible to prevent future attacks against innocent civilians,” Netanyahu said.\n\n“The antisemitic attacks around the world are a direct result of blood libels against the Jewish state and people, and this must be stopped,” he said.\n\nHis comments echoed those of an earlier statement by Foreign Minister Gideon Sa’ar, who blamed the “terrible antisemitic terror attack targeting Jews” on “pure antisemitism fueled by the blood libels spread in the media.”\n\nOpposition leader Yair Lapid also denounced Sunday’s attack.\n\n“We are all horrified by the violent terror attack in Colorado against peaceful protesters who were simply calling for the release of our hostage,” he wrote on X.\n\nThe Hostage Families Forum said they were heartbroken about the news of the attack.\n\n“We are heartbroken by the tragic attack in Colorado and extend our deepest support to all those affected. Our thoughts are with the injured, their loved ones, and the entire community shaken by this senseless act of violence,” the Forum said.\n\n“For over 600 days, this community — along with so many others around the world — has stood with us, marching, praying, and raising its voice for the hostages still held in Gaza. Today, we stand with you — with care, with solidarity, and with deep appreciation for your unwavering support.”\n\nAmbassador to the United Nations Danny Danon also voiced outrage.\n\n“Terrorism against Jews does not stop at the Gaza border — it is already burning the streets of America,” he said in a statement.\n\nThe incident, which the FBI said it was investigating as an act of terrorism, marked the second major attack against a Jewish gathering in the US in recent weeks after two Israeli embassy staffers were shot and killed outside an event at the Capital Jewish Museum in Washington DC.\n\nFour women and four men between 52 and 88 years old were transported to hospitals, Boulder police said. Authorities had earlier put the count of the injured at six and said at least one of them was in a critical condition.\n\nThe suspect is in custody and was identified as Mohamed Sabry Soliman, 45. He was also injured and was taken to the hospital to be treated, but authorities didn’t elaborate on the nature of his injuries.\n\nWitnesses told investigators that Soliman attacked the demonstrators with a “makeshift flamethrower” and threw an incendiary device, FBI Special Agent Mark Michalek said at a press conference. Boulder Police Chief Steve Redfearn said the suspect hurled Molotov cocktails at the demonstrators.\n\n“It is clear that this is a targeted act of violence and the FBI is investigating this as an act of terrorism,” Michalek said.\n\nIn footage said to be from the scene of the attack, a shirtless man screamed “End Zionists” while holding what appear to be Molotov cocktails. The man also shouted, “Palestine is free.”\n\nThe attack took place on the Pearl Street Mall, a popular pedestrian shopping district in the shadow of the University of Colorado, during an event organized by Run for Their Lives, an organization devoted to drawing attention to the hostages seized during Hamas’s October 7, 2023 assault on Israel in which 251 people were taken hostage and some 1,200 killed.\n\nTerror groups in the Gaza Strip are holding 58 hostages, including 57 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, and 20 are believed to be alive. There are grave concerns for the well-being of three others, Israeli officials have said.\n\nIn a statement, Run for Their Lives said the walks have been held every week since then for the hostages, “without any violent incidents until today.”\n\nUS officials also condemned the attack and vowed action.\n\nUS Secretary of State Marco Rubio described the Boulder incident as a “targeted terror attack,” while Attorney General Pam Bondi said “FBI agents are on the ground in Colorado following what appears to be a horrific antisemitic attack.”\n\nLawmakers on both sides of the political aisle expressed revulsion.\n\n“Tonight, a peaceful demonstration was targeted in a vile, antisemitic act of terror,” Chuck Schumer, a prominent Jewish Democrat, said in a statement. “Once again, Jews are left reeling from repeated acts of violence and terror.\n\nColorado Governor Jared Polis, who is also Jewish, posted on social media that it was “unfathomable that the Jewish community is facing another terror attack here in Boulder.”\n\nSeveral organizations also decried the violence.\n\n“Our community was targeted in a violent, antisemitic attack,” the Israeli-American Council said in a statement.\n\n“This is an attack on all of us — and we will not stay silent.”\n\nFBI chief Kash Patel described Sunday’s incident as “a targeted terror attack,” while Colorado Attorney General Phil Weiser labeled it “a hate crime.”\n\n“People may have differing views about world events and the Israeli-Hamas conflict, but violence is never the answer to settling differences. Hate has no place in Colorado,” Weiser said.\n\nWhite House Deputy Chief of Staff Stephen Miller posted on X that the suspect was a foreign national who “illegally overstayed (his) visa.”\n\nAcross the US, the New York Police Department said it has upped its presence at religious sites throughout the city for Shavuot.\n\n",
      "url": "https://www.timesofisrael.com/netanyahu-says-boulder-attack-a-direct-result-of-blood-libels-against-israel-and-jews/"
    },
    "me_article": {
      "title": "Netanyahu 'unsettled' by Macron's push to recognise Palestinian statehood",
      "content": "A prominentIsraelidiplomat has told Middle East Eye thatFrenchPresident Emmanuel Macron’s push to recognisePalestinianstatehood “is serious and has the backing of most of the European Union andSaudi Arabia”.\n\nAlon Pinkas, who was an adviser to four Israeli foreign ministers and served as the country’s consul general in New York, said that Prime Minister Benjamin Netanyahu “is unsettled because he knows Donald Trump’s support is brittle and tentative”.\n\n“Both the EU and theUSwill be looking for something they can work together on and alleviate tensions,” Pinkas said.\n\n“You need one or two European leaders to placate Trump and let him feel like it’s his idea.”\n\nUnlike 147 of the 193 United Nations member states, France does not recognise the state of Palestine, a position it shares with other western nations including theUK, US and Australia.\n\nBut France is now pushing for Australian and European powers, including the UK, Belgium and the Netherlands, to recognise Palestinian statehood at a UN conference it is co-hosting with Saudi Arabia in New York later this month.\n\nParis hopes that recognition of Palestinian statehood will kickstart a peace process and help accelerate momentum for a two-state solution.\n\nPinkas, a longstanding critic of Netanyahu, said he believed Macron’s push for Palestinian statehood was also related to “general fatigue and disillusionment with Israel over its intransigence on everything”.\n\nLast year, Spain, Norway and Ireland agreed to recognise a Palestinian state.\n\nIsrael condemns such moves as rewarding the actions of Palestinian armed groups.\n\nIn recent weeks, European nations, including the UK and France, have taken a much firmer rhetorical line with Israel, while continuing to support it as its war on Gaza continues.\n\n'The humanitarian blockade is creating a situation that is untenable on the ground'\n\n-President Emmanuel Macron\n\nPinkas told MEE he thought that the EU’s position on the war had not really changed, it has simply become “unequivocal and public”.\n\nHe said that while there was no meaningful domestic support in Israel or in the Knesset for Palestinian statehood, the international community’s pitch to Israel over ending the war should be that “we are your friends, we want you to succeed, this cannot go on... Netanyahu is driving you to unmitigated and irreparable disaster. Wake up, we are here to help.\"\n\nAt a press conference in Singapore on Friday, Macron said France was committed to working towards a political solution, as he reiterated his support for a two-state solution to the Israel-Palestine conflict.\n\n“The humanitarian blockade is creating a situation that is untenable on the ground,” Macron said.\n\n“And so, if there is no response that meets the humanitarian situation in the coming hours and days, obviously, we will have to toughen our collective position,” he said, adding that France might consider applying sanctions against Israeli settlers.\n\nWhile diplomats say the French president is leaning towards recognition of a Palestinian state, Paris has yet to take any concrete steps to target Israel in its war on Gaza.\n\nMacron does seem to enjoy a good relationship with US President Donald Trump, who Pinkas said could work with EU nations to put pressure on Israel. Asked about a viral video that appeared to show the French president being slapped by his wife Brigitte, Trumpsaid: \"He's fine, they're fine. They're two really good people, I know them very well.\"\n\nIsrael claimed to have partially ended an 11-week long aid blockade on Gaza last week, but barely any aid has entered the largely destroyed Palestinian enclave and civilians have been killed at the new US-Israel sponsored aid distribution sites, which see Palestinians crammed into tight spaces between fences.\n\nIsrael's foreign ministry said the assertion that there was a humanitarian blockade of Gaza was “a blatant lie”.\n\nIt said nearly 900 aid trucks had entered the Gaza since the blockade was eased and that the new US-backed system had distributed two million meals and thousands of aid packages.\n\n“But instead of applying pressure on the jihadist terrorists, Macron wants to reward them with a Palestinian state,” the Israeli ministry said in a statement reported by Reuters.\n\nThe charity Islamic Relief condemned the new aid system in a statement on Monday, saying that “massacres of people trying to get food aid must not go without consequence”.\n\n“Three months since Israel tightened its total siege of Gaza, dozens of Palestinian children, babies and elderly people have starved to death and desperate parents are being shot and killed as they try to get food aid at new militarised distribution sites,” the statement said.\n\n“Many more people across Gaza will soon die from hunger and disease unless international governments urgently put meaningful pressure on Israel to fully end its siege, reopen all crossings and allow large-scale, safe and unimpeded humanitarian access,” Islamic Relief said.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/netanyahu-unsettled-macrons-push-recognise-palestinian-statehood"
    }
  },
  {
    "similarity": 0.3913,
    "combined_title": "\"US Struggles to Mediate Middle East Tensions: Iran Rejects Nuclear Proposal, Hamas Considers Gaza Ceasefire\"",
    "summary": "Iran is set to reject a US proposal to end its nuclear dispute, citing the proposal as a \"non-starter\" that fails to address Tehran's interests or soften Washington's stance on uranium enrichment. The proposal was mediated by Omani Foreign Minister Sayyid Badr Albusaidi and presented on Saturday. Iran demands the immediate removal of all US-imposed sanctions that affect its oil-based economy, while the US insists on phased removal of nuclear-related sanctions. Meanwhile, Hamas is considering a ceasefire proposal for Gaza presented by US envoy Steve Witkoff. Israel has accepted the proposal, which calls for the release of captives in return for 60 days of no fighting. The deal would set a timeline for Hamas and Israel to negotiate a permanent end to the war and the withdrawal of Israeli troops. However, Hamas wants a guarantee that Israel will agree to a permanent end to the war in return for returning the captives. The situation in Gaza continues to deteriorate as Israel blockades the entry of all food, water, and medicine into the enclave.",
    "is_article": {
      "title": "Iran poised to dismiss nuclear proposal presented by US, Iranian diplomat says",
      "content": "DUBAI (Reuters) — Iran is poised to reject a US proposal to end a decades-old nuclear dispute, an Iranian diplomat said on Monday, dismissing it as a “non-starter” that fails to address Tehran’s interests or soften Washington’s stance on uranium enrichment.\n\n“Iran is drafting a negative response to the US proposal, which could be interpreted as a rejection of the US offer,” the senior diplomat, who is close to Iran’s negotiating team, told Reuters.\n\nThe US proposal for a new nuclear deal was presented to Iran on Saturday by Omani Foreign Minister Sayyid Badr Albusaidi, who was on a short visit to Tehran and has been mediating talks between Tehran and Washington.\n\nAfter five rounds of discussions between Iranian Foreign Minister Abbas Araghchi and President Donald Trump’s Middle East envoy Steve Witkoff, several obstacles remain.\n\nAmong them are Iran’s rejection of a US demand that it commit to scrapping uranium enrichment and its refusal to ship abroad its entire existing stockpile of highly enriched uranium — possible raw material for nuclear bombs.\n\nThe United States, Israel and Western countries have long accused Iran — which vows to destroy Israel — of seeking nuclear weapons, a charge Tehran has repeatedly denied, insisting it needs uranium for civilian power production. However, Iran has been enriching uranium up to 60%, a level that has no civilian uses and is just below weapons grade.\n\nIt has also obstructed international inspectors from checking its nuclear facilities, and has expanded its ballistic missile capabilities, while several officials have warned that it could pursue the bomb.\n\nWashington’s proposal for a deal came after leakedUN reports this weekend saidIran had stepped up production of highly enriched uranium and carried out secretive nuclear activities.\n\n“In this proposal, the US stance on enrichment on Iranian soil remains unchanged, and there is no clear explanation regarding the lifting of sanctions,” said the diplomat, who declined to be identified due to the sensitivity of the matter.\n\nAraghchi said Tehran would formally respond to the proposal soon.\n\nTehran demands the immediate removal of all US-imposed curbs that impair its oil-based economy. But the US says nuclear-related sanctions should be removed in phases.\n\nDozens of institutions vital to Iran’s economy, including its central bank and national oil company, have been blacklisted since 2018 for, according to Washington, “supporting terrorism or weapons proliferation.”\n\nTrump’s revival of “maximum pressure” against Tehran since his return to the White House in January has included tightening sanctions and threatening to bomb Iran if the negotiations yield no deal.\n\nDuring his first term in 2018, Trump ditched Tehran’s 2015 nuclear pact with six powers and reimposed sanctions that have crippled Iran’s economy. Iran responded by escalating enrichment far beyond the pact’s limits.\n\nUnder the deal, Iran had until 2018 curbed its sensitive nuclear work in return for relief from US, EU and UN economic sanctions.\n\nThe diplomat said the assessment of “Iran’s nuclear negotiations committee,” under the supervision of Supreme Leader Ayatollah Ali Khamenei, was that the US proposal was “completely one-sided” and could not serve Tehran’s interests.\n\nTherefore, the diplomat said, Tehran considers this proposal a “non-starter” and believes it unilaterally attempts to impose a “bad deal” on Iran through excessive demands.\n\nThe stakes are high for both sides. Trump wants to curtail Tehran’s potential to produce a nuclear weapon that could trigger a regional nuclear arms race and perhaps threaten Israel. Iran’s clerical establishment, for its part, wants to be rid of the devastating sanctions.\n\nIran says it is ready to accept some limits on enrichment but needs watertight guarantees that Washington would not renege on a future nuclear accord.\n\nTwo Iranian officials told Reuters last week that Iran could pause uranium enrichment if the US released frozen Iranian funds and recognized Tehran’s right to refine uranium for civilian use under a “political deal” that could lead to a broader nuclear accord.\n\nIsrael sees Iran’s nuclear program as an existential threat and says it would never allow Tehran to obtain nuclear weapons.\n\nAraghchi, in a joint news conference with his Egyptian counterpart in Cairo, said: “I do not think Israel will commit such a mistake as to attack Iran.”\n\nTehran’s regional influence has meanwhile been diminished by military setbacks suffered by its forces and those of its allies in the Shi’ite-dominated “Axis of Resistance,” which includes Hamas, Hezbollah, the Houthis in Yemen, and Iraqi militias.\n\nIn April, Saudi Arabia’s defense minister delivered a blunt message to Iranian officials to take Trump’s offer of a new deal seriously as a way to avoid the risk of war with Israel.\n\n",
      "url": "https://www.timesofisrael.com/iran-poised-to-dismiss-nuclear-proposal-presented-by-us-iranian-diplomat-says/"
    },
    "me_article": {
      "title": "Hamas is studying another US ceasefire proposal for Gaza. What has changed?",
      "content": "Hamas said on Thursday it was studying aGazaceasefire proposal byUSenvoy Steve Witkoff, which Israel announced it had accepted, as starvation stalks the enclave andIsraelramps up its air strikes.\n\n\"The leadership of the Hamas movement has received Witkoff's new proposal from the mediators and is currently studying it responsibly, in a manner that serves the interests of our people, provides relief, and achieves a permanent ceasefire in the Gaza Strip,” Hamas said.\n\nWitkoff sounded an optimistic note speaking at the White House on Wednesday, saying, “I have some very good feelings about getting to… a temporary ceasefire and a long-term, peaceful resolution of that conflict.”\n\nUS President Donald Trump on Thursday confirmed that Prime Minister Benjamin Netanyahu had accepted a new ceasefire proposal from Witkoff, but added that Hamas had not yet accepted.\n\nHowever, reports that Israel and Hamas were nearing an agreement have occurred regularly throughout the 18 months of war, only to wither a few days later.\n\nHamas and Israel reached a brief three-stage ceasefire in January, but the dealcollapsedin March after Israel took back several of its captives and resumed bombing Gaza, walking away from the deal before talks with Hamas on a permanent end to the war could start.\n\nWhile the Trump administration has broken with Israel on bombing the Houthis, negotiating a nuclear deal with Iran, and lifting sanctions onSyria, it has given Israel full backing to wage war on Gaza.\n\nAccording to Axios, the latest Witkoff proposal is similar to the one Israel broke in March.\n\nIt calls for the release of captives in return for 60 days of no fighting.\n\nThe deal would set a timeline for Hamas and Israel to begin negotiating a permanent end to the war and withdrawal of Israeli troops.\n\nSeveral factors have changed since then, but it's unclear how they might impact the talks.\n\nIn May, the Trump administration began to rely on a new intermediary with Hamas, Palestinian-American businessman Bishara Bahbah.\n\nThe national chairman for Arab Americans for Trump established a backchannel for Hamas directly to the Trump administration that led to the release of US-Israeli citizen Edan Alexander from captivity earlier this month.\n\nDespite the new diplomatic shake-up, the main roadblock to a deal has not changed.\n\nHamas wants a guarantee that, in return for returning the 20 captives believed to be alive, Israel will agree to a permanent end to the war.\n\nIsraeli media reported on Thursday that Netanyahu was prepared to move forward with a temporary truce.\n\nNetanyahu has regularly insisted on the right to resume fighting and has pledged to totally disarm and eliminate Hamas.\n\nSpeaking in May, Netanyahu said for the first time that one of his conditions for ending the war was the right to enact aplanfloated earlier this year by Trump, which called for the forcible displacement of Palestinians from Gaza.\n\nIsrael did withdraw from some points in Gaza in January and February, but it has established the Netzarim Corridor to deploy troops from east to west of Gaza quickly.\n\nHamas is unlikely to forget that Israel quickly reoccupied the enclave in March with little public pressure not to from the US, orEgyptandQatar, the two Arab mediators.\n\nIsrael's military said on Monday it wants to control 75 percent of Gaza and force roughly two million Palestinians there into a narrow zone in the south near the Egyptian border.\n\nThere was some confusion on Monday after media reports said that Hamas had agreed to a 60-day ceasefire proposed by Witkoff, only for Israel to deny the offer was on the table.\n\nTalks are ongoing as Gaza descends into anarchy and starvation. Israel has been blockading the entry of all food, water, and medicine into the enclave until recently.\n\nThe US and Israel established a controversial organisation in May dubbed the Gaza Humanitarian Foundation to distribute aid. Its aid centre in Rafah, staffed by American mercenaries, was overrun with thousands of starving Palestinians.\n\nThe Israeli military opened fire on the crowd, and images on social media showed Palestinians boxed into narrow fences to obtain aid.\n\nThe foundation has been slammed by the UN and other aid groups for militarising aid. On Wednesday, four Palestinians died storming a UN warehouse in search of food.\n\nAt least 44 Palestinians were killed by Israeli strikes across Gaza on Thursday. The total death toll since the war began in October 2023 has surpassed 54,000.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/hamas-studying-another-us-ceasefire-proposal-gaza-what-has-changed"
    }
  },
  {
    "similarity": 0.2988,
    "combined_title": "Poland Elections: A Tense Runoff Amidst International Controversy",
    "summary": "The runoff presidential election in Poland has ended with both candidates, Warsaw's pro-EU mayor Rafal Trzaskowski and right-wing historian Karol Nawrocki, claiming victory. The results, showing Trzaskowski just 0.6% ahead, are still too close to call due to the Ipsos exit poll's margin of error. The election has been marked by controversy, with Nawrocki, who has made Holocaust revisionism part of his campaign, drawing support from right-wing voters, including US President Donald Trump. A victory for Nawrocki could lead to fresh parliamentary elections and further embolden the populist Law and Justice party. Meanwhile, a win for Trzaskowski could signal significant social changes, such as the introduction of civil partnerships for same-sex couples and an easing of a near-total ban on abortion. The election comes amidst international controversy, with Ireland's deputy prime minister, Simon Harris, defending the government's stance that Israel is carrying out a genocide in Gaza, a claim that has been echoed by Nawrocki's supporter, Grzegorz Braun.",
    "is_article": {
      "title": "Liberal mayor, anti-EU Holocaust revisionist both claim victory in Poland election",
      "content": "Both candidates in Poland’s runoff presidential election on Sunday claimed victory after an exit poll showed Warsaw’s pro-EU mayor Rafal Trzaskowski just 0.6% ahead of his rival, right-wing historian Karol Nawrocki, who has made Holocaust revisionism part of his campaign.\n\n“We won… by a whisker,” Trzaskowski, 53, who is backed by the ruling Civic Coalition party, told supporters after the Ipsos poll showed him narrowly ahead with 50.3 percent.\n\nNawrocki, 42, who is supported by Poland’s outgoing conservative President Andrzej Duda and US President Donald Trump, was at 49.7 percent. “Tonight we will win,” Nawrocki told his election night rally. “We will win and we will save Poland.”\n\nThe Ipsos exit poll had a margin of error of plus or minus 2 percentage points, and the final vote is likely to change somewhat, making the result still too close to call.\n\nThe state electoral commission was expected to release the final vote count on Monday, though the result could be known sooner.\n\nTherunofffollows a tightly contested first round on May 18, in which Trzaskowski won just over 31% and Nawrocki nearly 30%, eliminating 11 other candidates.\n\nFar-right candidates Sławomir Mentzen and Grzegorz Braun came in third and fourth, giving Nawrocki a larger pool of right-wing voters to draw on in the runoff.\n\nNawrocki, who has the support of Trump, hasn’t wasted time courting those voters. He signed a list of Mentzen’s demands, such as refusing to ratify Ukraine’s entry to NATO, sending Polish soldiers to Ukraine, or expanding EU powers.\n\nHe has also sought favor from Braun, who made antisemitism a feature of his campaign, asking his rivals in a televised debate last month what they planned to do about the “Judaization” of Poland. In 2023, Braun used a fire extinguisher to blow out Hanukkah candles in parliament and violently stormed a lecture by Grabowski. This year he disrupted a moment of silence for the Holocaust to denounce “Jewish genocide in Gaza.” His campaign posters showed him posing with a fire extinguisher.\n\nNawrocki told Braun that he would fight “all the disgusting attacks” on Poland by Holocaust scholars, and had previously promised to end the tradition of lighting Hanukkah candles in the presidential palace.\n\nA victory for Nawrocki would embolden the populist Law and Justice party, which ruled Poland between 2015 and 2023, and could lead to fresh parliamentary elections.\n\nThe candidacy of Nawrocki, an amateur boxer, has been clouded by allegations of past connections to criminal figures and participation in a violent street battle. He denies the criminal links but acknowledges having taken part in “noble” fights. The revelations have not appeared to dent his support among right-wing voters, many of whom see the allegations as politically motivated.\n\nMany Nawrocki supporters want stricter curbs on immigration and advocate for conservative values and more sovereignty for the country within the European Union.\n\n“We should not give in to European pressure,” 40-year-old Agnieszka Prokopiuk, a homemaker, said before the vote.\n\n“We need to make our own way,” she told AFP in the eastern city of Biala Podlaska.\n\nA victory for Trzaskowski would be a major boost for the progressive agenda of the government led by Polish Prime Minister Donald Tusk. It could mean significant social changes such as the introduction of civil partnerships for same-sex couples and an easing of a near-total ban on abortion.\n\nTusk, a former European Council president, said these elections “were particularly important” after he voted in the seaport of Sopot.\n\nKatarzyna Malek, a 29-year-old voter in Warsaw, cast her ballot in the first round for a left-wing candidate but went for Trzaskowski on Sunday, viewing him as more competent and more likely to pursue stronger ties with foreign partners and lower social tensions.\n\n“I hope there will be less division, that maybe there will be more dialogue,” she said.\n\nCivic Coalition, which backed Trzaskowski, traditionally appeals to more liberal-minded Poles who mainly live in cities or bigger towns. Law and Justice, which backed Nawrocki, has traditionally enjoyed support in small towns and rural areas, especially in Poland’s south and east. These areas are typically poorer and more socially conservative than larger cities, creating a sense of exclusion that the populist party has tapped into.\n\nThe president in Poland, a fast-growing economy of 38 million people, has the power to veto legislation and is also the commander-in-chief of the armed forces. The president wields another power that can influence historical research: signing off on awarding professorships.\n\nDuda, who is aligned with Law and Justice,refusedin 2019 to appoint Michal Bilewicz, a Jewish researcher of antisemitism, as a full professor at the University of Warsaw.\n\nIt was only in the 1990s, after the Soviet Union fell, that Poland began efforts to reconcile with the murder of 3 million Jews there and the intertwining of Jewish and Polish history.\n\nBut many projects of “memory activism” were cut short by the Law and Justice government, which isolated Poland from the EU and was scrutinized for undermining democratic norms and tightening government control over the judiciary, the media and Polish history.\n\nNawrocki heads the Institute of National Remembrance, known for advancing the right-wing government’s narratives, which glorified Polish victimhood and resistance to the Nazis while delegitimizing research on Polish antisemitism or Poles who killed Jews.\n\nIn 2018, the country passed a law that outlawed accusing Poland or the Polish people of complicity in Nazi crimes. Although the infraction was downgraded from a crime punishable with three years in prison to a civil offense, critics say it had a chilling effect on historical research.\n\n",
      "url": "https://www.timesofisrael.com/liberal-mayor-anti-eu-holocaust-revisionist-both-claim-victory-in-poland-election/"
    },
    "me_article": {
      "title": "Ireland stands by claim Israel committing genocide in Gaza",
      "content": "Ireland'sTanaiste, or deputy prime minister, Simon Harris, defended the government's position on Thursday that Israel is carrying out a genocide inGaza, Irish broadcaster RTE reported.\n\n\n\n“We are the first government in the European Union (EU) to say what Israel is doing is genocide. It is genocide,\" Harris told an opposition lawmaker during a heated exchange in parliament, known as the theDáil.\n\nCatherine Connolly, an independent, accused the government of not doing enough to punish Israel for its 19-month-long war on Gaza, which has killed more than 54,000 Palestinians, more than half of them women and children, according to the Palestinian health ministry.\n\n“I’m disgusted and sickened, sickened - watching children dying on our television screens and every day I come to work, and work with all the people in here to do our best to show leadership at a time of horrific conflict,\" Harris said.\n\n“We’re working to support the people of Palestine and the only chamber I ever go into in the entire world where people don’t acknowledge that Ireland, the government, the people of Ireland, are standing with the people of Palestine, standing up for human rights, standing up for international law, is here when you get up and distort - with your ideology - the actions of this government.\"\n\nIreland recognised Palestinian statehood one year ago, and in January, it joined South Africa's genocide case against Israel at the International Court of Justice (ICJ).\n\nOn Thursday, Harris said that a bill banning trade with goods from Israeli settlements - deemed illegal under international law - would move to the foreign affairs committee next month, the Irish Times said.\n\nThe government is also under pressure tohelp remove the Central Bank’s role in permitting the sale of Israel bonds in the EU, and to stop any flights over Ireland that may be carrying weapons to Israel, the paper reported.\n\n\n\n“I’m proud of the people of this country. I’m proud that we went into an election, and it didn’t matter what party you were in, you stood up and said, ‘We are going to support the people of Palestine’.\"\n\nHarris's stance was backed by thetaoiseach - or prime minister, Micheal Martin, earlier in the week.\n\n“We have been very consistent in our support to the Palestinian people and their right to self-determination, and in condemning the war crimes and the genocide that is occurring right now,” Martin told the Dail.\n\n“The focus has to be relentlessly on the policies of Prime Minister Netanyahu and the Israeli government, made up of extreme far-right elements who are committing genocide in Gaza right now.\"\n\n\n\nIn 2018, the Occupied Territories Bill was introduced in Ireland by Independent Senator Frances Black, proposing a ban on trade with businesses operating in illegal Israeli settlements on Palestinian land, but it was ultimately blocked over concerns about breaching EU trade rules.\n\nHowever, anadvisory opinionfrom the ICJ in July marked a turning point in reconsidering the enactment of the Irish bill.\n\nThe ICJ concluded that Israel's presence in the occupied Palestinian territories is \"unlawful” and the country should “end its presence in the occupied Palestinian territory as rapidly as possible”.\n\nMore than 400 of Ireland’s senior legal academics and practising lawyers have called on thegovernmentto enact the bill in its original form, prohibiting all goods and services in the occupied West Bank, such asAirbnb.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/ireland-says-israel-carrying-out-genocide-gaza"
    }
  },
  {
    "similarity": 0.2816,
    "combined_title": "Ancient Bibles Find New Homes Amid Shavuot Celebrations; UK Students Protest University's Ties to Israeli Companies",
    "summary": "As ancient bibles, the Codex Sassoon and the Shem Tov, are inaugurated in Israeli museums in time for the Shavuot holiday, students at the University of Cambridge in the UK are protesting the University's financial ties to companies implicated in Israel's war on Gaza. The Codex Sassoon bible, nearly two years after its introduction, was inaugurated at the Anu Museum in a ceremony attended by released hostage Agam Berger. The Shem Tov bible, on the other hand, found its permanent home at the National Library of Israel. Meanwhile, Cambridge for Palestine (C4P), a student-led group, is calling on the University to disclose and divest from companies such as Elbit Systems, Caterpillar, L3Harris Technologies, and Barclays. The group is demanding the University's financial transparency, divestment from implicated companies, and reinvestment in Palestinian communities. This protest comes after the University's alleged failure to honor its previous commitment to review its \"responsible investment\" policy.",
    "is_article": {
      "title": "Daily Briefing June 2: Day 605 – Ancient Bibles receive new homes for Torah holiday",
      "content": "Welcome to The Times of Israel’s Daily Briefing, your 20-minute audio update on what’s happening in Israel, the Middle East and the Jewish world.\n\nReligions reporter Rossella Tercatinjoinshost Jessica Steinbergfor today’s episode.\n\nNearly two years after the ancient, nearly complete Codex Sassoon bible was first introduced at the Anu Museum, days before the October 7, 2023, Hamas attack, the book of Torah is inaugurated at the museum, in the presence of released hostage Agam Berger, in a moving, bittersweet ceremony, tells Tercatin. Another ancient bible, the Shem Tov bible, this one only 700 years old, was also inaugurated permanently at the National Library of Israel, both in time for the Shavuot holiday.\n\n\n\n\n\nTercatin also looks at the ongoing issues of conversion in Israel, following a meeting last week of the Knesset Aliyah Committee devoted to the topic of conversions on Tuesday, ahead of the Shavuot festival. Only about half of those who start the process to convert manage to complete the journey, and the Conversion Authority is currently formally without a director, leaving nobody can sign the official conversion certificates, complex matters that Tercatin discusses.\n\nSteinberg talks about an art exhibit currently at Kibbutz Ramat Yohanan, marking the 80th anniversary of the kibbutz’s Shavuot ceremony, created by two pioneering kibbutz members in the 1940s to mark the agricultural and harvest aspects of the festival.\n\nFinally, Tercatin discusses the Messianic community in Israel, and its connection to Yaron Lischinsky, the Israel Embassy staffer who was killed alongside his soon-to-be-fiancée, Sarah Milgrim, on May 21 in an antisemitic attack at the Capital Jewish Museum in Washington, DC.\n\nCheck out The Times of Israel’s ongoing liveblog for more updates.\n\nCodex Sassoon, oldest near-complete Hebrew Bible, displayed in Israel after Oct. 7 delay\n\nAhead of Shavuot, thousands of converts remain unrecognized by state, stuck in limbo\n\nKibbutz marks 80 years of Shavuot song and dance with pioneering artworks\n\nFor Messianic Jews in Jerusalem, Yaron Lischinsky’s murder was a personal loss\n\nSubscribe to The Timesof Israel Daily Briefing onApple Podcasts,Spotify,YouTube,orwherever you get your podcasts. This episode was produced by the Pod-Waves and video edited by Thomas Girsch.\n\n",
      "url": "https://www.timesofisrael.com/daily-briefing-june-2-day-605-ancient-bibles-receive-new-homes-for-torah-holiday/"
    },
    "me_article": {
      "title": "UK: Cambridge students relaunch pro-Palestine encampment",
      "content": "Students at theUK’s University of Cambridge haverelauncheda protest encampment outside Trinity College, one of its largest and wealthiest colleges, calling on the institution to disclose and divest from companies complicit inIsrael’s war on Gaza.\n\nThe group behind the protest, Cambridge for Palestine (C4P), is demanding the University “take urgent steps” to end what it calls its “moral and material complicity in Israel’s genocide ofPalestinians.”\n\nC4P says Trinity College holds investments in companies such as Elbit Systems, Caterpillar, L3Harris Technologies, and Barclays - despite the university's previous commitment to review its “responsible investment” policy following a similar months-long encampment last year.\n\nIn a statement, C4P said the renewed protest came after “months of student, faculty, and community frustration” over the University’s failure to honour those pledges.\n\nThe group outlined four core demands, including full disclosure of financial ties to companies implicated in Israeli violations of international law, full divestment from them, and reinvestment in Palestinian communities.\n\nThis includes support for Palestinian students and academics at Cambridge, rebuilding higher education institutions in Gaza, and forming partnerships with Palestinian universities.\n\nC4P also demanded the need for the university to \"protect the academic freedoms and safety of all University of Cambridge affiliates,\" as well as reversing \"targeted anti-protest policies that restrict pro-Palestine speech\".\n\nIn March, the University wasgranteda High Court order barring pro-Palestine actions from three locations on its campus until the end of July 2025 - a reduced version of its original bid to secure a five-year ban on 27 February, which was rejected in court.\n\n\"This is the first major action on Cambridge's campus after the university enacted repressive measures to criminalise protest for Palestine,\" a student camper, who wished to remain anonymous for security reasons, told Middle East Eye.\n\n\"We know that our acts of protest come with risks of further repression and targeting, yet the escalation of genocide demands our action. There are no universities left in Gaza. We will not deterred when our university funds mass murder.\"\n\n'So long as Cambridge and its colleges remain backers of the Zionist project, we will continue to return'\n\n- C4P representative\n\nCambridge University is made up of 31 self-governing colleges which operate autonomously, including in their financial investments. Many of them have faced protests over their investments since the launch of Israel's war on Gaza in October 2023.\n\nOn 20 May,King's Collegeannounced it would divest millions from the arms industry and companies complicitin \"the occupation of Ukraine andPalestinianterritories,\" becoming the first Oxford or Cambridge college to take such measures.\n\n\"Cambridge for Palestine is here to show the University that we are back,\" C4P representative said in a statement.\n\n\"So long as Cambridge and its colleges remain backers of the Zionist project, we will continue to return and disrupt the University's violence shrouded in so-called normalcy.\"\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/uk-cambridge-students-relaunch-pro-palestine-encampment"
    }
  },
  {
    "similarity": 0.2755,
    "combined_title": "Iran Presses for US Sanctions Removal Amid Nuclear Talks as Brazilian Oil Unions Urge Energy Embargo on Israel",
    "summary": "Iran has pressed the United States for guarantees of sanctions removal as a condition for a nuclear deal, following reports of Tehran's increased production of highly enriched uranium. The US has proposed a deal deemed \"acceptable\" by the White House, which calls for Iran to halt all enrichment and suggests a regional group for nuclear power production. Meanwhile, two of Brazil's largest oil trade unions have urged President Luiz Inacio Lula da Silva to implement an energy embargo against Israel, citing Brazil's international legal obligations and the country's significant contribution to Israel's military fuel supply. This comes amid escalating tensions in the Middle East, with Iran's nuclear activities and Israel's actions in Gaza stirring international concern.",
    "is_article": {
      "title": "Iran demands US ‘guarantee’ it will lift sanctions in nuclear talks",
      "content": "TEHRAN — Iran pressed the United States on Monday for guarantees that it will drop sanctions as a condition for a nuclear deal, after the White House reportedly sent a proposal the US deemed “acceptable.”\n\nWith Iran and the United States engaged in talks over Tehran’s nuclear program since April, Washington’s proposal for a deal came afterleaked UN reportssaid Iran had stepped up production of highly enriched uranium and carried out secretive nuclear activities.\n\nIran’s top diplomat and lead nuclear negotiator was due to meet the head of the UN’s International Atomic Energy Agency (IAEA) in Cairo on Monday, a day after the report was leaked.\n\nIran has rejected the report, warning it would retaliate if European powers that have threatened to reimpose nuclear sanctions “exploit” the report.\n\nThe United States, Israel and Western countries have accused Iran — which vows to destroy Israel — of seeking nuclear weapons, a charge Tehran has repeatedly denied, insisting it needs uranium for civilian power production. However, Iran has been enriching uranium up to 60%, a level that has no civilian uses and is just below weapons grade.\n\nIt has also obstructed international inspectors from checking its nuclear facilities, and has expanded its ballistic missile capabilities, while several officials have warned that it could pursue the bomb.\n\nIranian Foreign Minister Abbas Araghchi said on Saturday that he had received “elements” of a US proposal for a nuclear deal following five rounds of talks mediated by Oman.\n\nOn Monday, foreign ministry spokesman Esmaeil Baqaei told a news conference in Tehran: “We want to guarantee that the sanctions are effectively lifted…\n\n“So far, the American side has not wanted to clarify this issue,” he added.\n\nHis remarks come a day after a report by the UN agency showed Iran has stepped up production of uranium enriched up to 60 percent — close to the roughly 90 percent level needed for atomic weapons.\n\nIn the nuclear talks last month, the US envoy said that President Donald Trump’s administration would oppose any enrichment.\n\n“An enrichment program can never exist in the state of Iran ever again. That’s our red line. No enrichment,” Steve Witkoff told Breitbart News.\n\nIran has vowed to keep enriching uranium “with or without a deal” on its nuclear program.\n\nThe United States has sent Iran a proposal for a nuclear deal that the White House called “acceptable” and in its “best interest” to accept, US media reported on Saturday.\n\nThe New York Times, citing officials familiar with the diplomatic exchanges, said the proposal calls on Iran to stop all enrichment and suggests creating a regional grouping to produce nuclear power.\n\nIran has held five rounds of talks with the United States in search of a new agreement to replace the deal with major powers that Trump abandoned during his first term in 2018.\n\nTimes of Israel Staff contributed to the report\n\n",
      "url": "https://www.timesofisrael.com/iran-demands-us-guarantee-it-will-lift-sanctions-in-nuclear-talks/"
    },
    "me_article": {
      "title": "Brazilian oil trade unions urge Lula to impose energy embargo on Israel",
      "content": "Two of the largest federations of trade unions for oil workers in Brazil have called on the government to impose an energy embargo onIsrael.\n\nThe National Federation of Oil Workers and the Single Federation of Oil Workers sent a joint letter to President Luiz Inacio Lula da Silva and key ministers in the Brazilian government on Wednesday, urging them to take more concrete action against Israel’s “genocide” inGaza.\n\nReferring to comments made by Lula in February, the federations said that Brazil needs to go beyond public rhetoric and implement an energy embargo against Israel in accordance with its international legal obligations to prevent the “ongoing Nakba” - meaning ‘catastrophe’ in Arabic and referring to the mass displacement and dispossession of Palestinians in 1948 when Israel was created.\n\nIn February, President Lula, while he was attending the African Union Summit in Ethiopia, accused Israel of committing “genocide” against Palestinians in Gaza and compared itswar on Gazawith Nazi Germany’s extermination of Jews.\n\nThe letter highlighted that 2.7m barrels of crude oil were exported from Brazil to Israel in 2024 alone, representing a significant portion of Israel's military fuel supply, and Brazil had a global responsibility to avoid complicity in war crimes, as articulated by legal experts and international judicial bodies.\n\nThe letter cited action taken by other countries, such as Colombia’s suspension of coal exports to Israel, and global grassroots campaigns such as #BlockTheBoat, where dockworkers around the world have refused to load Israeli ships and cargo and transport arms to Israel.\n\nIn the United States,Block the Boatwas organised by theArab Resource and Organizing Centerin San Francisco.\n\nIn addition to the immediate suspension of oil exports to Israel, the federations urge the Brazilian government to suspend projects with Israeli energy companies, and support United Nations-led sanctions and measures to hold Israel to account.\n\nSignatories said this was an opportunity for Brazil to “honour its diplomatic legacy, affirm its position on the right side of history, and ensure that its economic policies reflect its ethical and legal commitments to human rights and international law\".\n\nThe Single Federation of Oil Workers is a national trade union, while the National Federation of Oil Workers is a trade union federation comprised of independently operating oil workers' unions.\n\nLula has been a longtime supporter of Palestine.\n\nHis commentto reporterson 17 February in Ethiopia sparked a diplomatic backlash when he said that Israel’s actions in Gaza were not a war, \"It's a genocide\".\n\n'What's happening in the Gaza Strip with the Palestinian people hasn't happened at any other moment in history. Actually, it has happened: when Hitler decided to kill the Jews'\n\n-Luiz Inacio Lula da Silva, Brazilian president\n\n\"It's not a war of soldiers against soldiers. It's a war between a highly prepared army, and women and children,\" he said.\n\n\"What's happening in the Gaza Strip with the Palestinian people hasn't happened at any other moment in history. Actually, it has happened: when Hitler decided to kill the Jews.\"\n\nIsraeli Prime Minister Benjamin Netanyahu said Lula’s Nazi Germany comparison was “disgraceful and grave”, while Foreign Minister Israel Katz said that Lula would be “a persona non grata in Israel” until he took back his comments.\n\nLula refused to take back his comments and recalled Brazil’s ambassador from Israel.\n\nReutersreportedthat his approval ratings fell from 54 percent to 51 percent after his comments.\n\nLula also backed South Africa’s International Court of Justice case against Israel in January, which ruled that a “plausible genocide” was happening in Gaza.\n\nAn official statement highlighted Lula’s role in the decision: “The president expressed his support for South Africa’s initiative to bring Israel before the ICJ to determine that Israel immediately ceases all acts and measures that may constitute genocide or related crimes under the Convention on the Prevention and Punishment of the Crime of Genocide.”\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/brazilian-oil-trade-unions-urge-government-impose-oil-embargo-israel"
    }
  },
  {
    "similarity": 0.2565,
    "combined_title": "Global Diplomacy in Action: Russian-Ukrainian Peace Talks in Istanbul and Saudi Diplomat's Visit to West Bank",
    "summary": "Russian and Ukrainian officials are set to engage in another round of peace talks in Istanbul amidst escalating tensions and continued conflict. The talks, which are being closely monitored by the US and European powers, have yet to yield significant progress towards a ceasefire or peace accord. Meanwhile, in another part of the globe, Saudi Arabian Foreign Minister Faisal bin Farhan is slated to visit the occupied West Bank, marking a rare trip by a high-ranking Saudi official. The visit, which is seen as a show of solidarity with the Palestinian cause, comes amidst ongoing conflict in Gaza. Both events highlight the complex and intertwined nature of global diplomacy and conflict resolution.",
    "is_article": {
      "title": "Russia and Ukraine head to Istanbul for fresh peace talks, but remain far apart",
      "content": "ISTANBUL (Reuters) — Russian and Ukrainian officials are due to sit down on Monday in the Turkish city of Istanbul for their second round of direct peace talks since 2022, but the two sides are still far apart on how to end the war and the fighting is stepping up.\n\nUS President Donald Trump has demanded that Russia and Ukraine make peace, but so far they have not and the White House has repeatedly warned the United States will “walk away” from the war if the two sides are too stubborn to reach a peace deal.\n\nThe first round of talks on May 16 yielded the biggest prisoner swap of the war, but no sign of peace, or even a ceasefire, as both sides merely set out their own opening negotiating positions.\n\nAfter keeping the world guessing on whether Ukraine would even turn up for the second round, President Volodymyr Zelensky said Defense Minister Rustem Umerov would meet with Russian officials in Istanbul.\n\nThe Russian delegation will be headed by Kremlin aide Vladimir Medinsky, who after the first round invoked French general and statesman Napoleon Bonaparte to assert that war and negotiations should always be conducted at the same time.\n\nOn Sunday, Ukraine launched one of its most ambitious attacks of the war, targeting Russian nuclear-capable long-range bombers in Siberia and other military bases, while the Kremlin launched 472 drones at Ukraine, Ukraine’s air force said, the highest nightly total of the war.\n\nThe idea of direct talks was first proposed by Russian President Vladimir Putin after Ukraine and European powers demanded that he agree to a ceasefire which the Kremlin dismissed.\n\nPutin said Russia would draft a memorandum setting out the broad contours of a possible peace accord and only then discuss a ceasefire.\n\nKyiv said over the weekend it was still waiting for a draft memorandum from the Russian side.\n\nMedinsky, the lead Kremlin negotiator, said on Sunday that Moscow had received Ukraine’s draft memorandum and told Russia’s RIA news agency the Kremlin would react to it on Monday.\n\nAccording to Trump envoy Keith Kellogg, the two sides will in Turkey present their respective documents outlining their ideas for peace terms, though it is clear that after three years of war Moscow and Kyiv remain far apart.\n\nKellogg has indicated that the US will be involved in the talks and that even representatives from Britain, France and Germany will be too, though it was not clear at what level the United States would be represented.\n\nUkraine’s delegation will also include its deputy foreign minister, as well as several military and intelligence officials, according to an executive order by Zelensky on Sunday.\n\nIn June last year, Putin set out his opening terms for an immediate end to the war: Ukraine must drop its NATO ambitions and withdraw all of its troops from the entirety of the territory of four Ukrainian regions claimed and mostly controlled by Russia.\n\nUkrainian negotiators in Istanbul will present to the Russian side a proposed roadmap for reaching a lasting peace settlement, according to a copy of the document seen by Reuters.\n\nAccording to the document, there will be no restrictions on Ukraine’s military strength after a peace deal is struck, no international recognition of Russian sovereignty over parts of Ukraine taken by Moscow’s forces, and no reparations for Ukraine.\n\nThe document also stated that the current location of the front line will be the starting point for negotiations about territory.\n\nRussia currently controls a little under one-fifth of Ukraine, or about 113,100 square km, about the same size as the US state of Ohio.\n\nPutin ordered tens of thousands of troops to invade Ukraine in February 2022 after eight years of fighting in eastern Ukraine between Russian-backed separatists and Ukrainian troops. The United States says over 1.2 million people have been killed and injured in the war since 2022.\n\nTrump has called Putin “crazy” and berated Zelensky in public in the Oval Office, but the US president has also said that he thinks peace is achievable and that if Putin delays, then he could impose tough sanctions on Russia.\n\n",
      "url": "https://www.timesofisrael.com/russia-and-ukraine-head-to-istanbul-for-fresh-peace-talks-but-remain-far-apart/"
    },
    "me_article": {
      "title": "Saudi top diplomat to make rare trip to occupied West Bank",
      "content": "Saudi Arabian Foreign Minister Faisal bin Farhan will visit the occupied West Bank this weekend, making him the highest rankingSaudiofficial to visit in almost 60 years, the Palestinian Authority (PA) revealed on Friday.\n\nBin Farhan will lead a ministerial delegation comprised of his counterparts inJordan,Egypt, and other Arab nations, the Palestinian ambassador to Saudi Arabia told local media, adding that the trip is intended to convey the centrality of the Palestinian cause to Arabs and Muslims.\n\nThe move appears similar to the trip bin Farhan organised to Washington in the early months ofIsrael's war on Gaza, in a bid to showcase a united Arab front in support of a ceasefire.\n\nIt also appears to be an attempt at lending credibility to the PA as an alternative to Hamas in Gaza, despite the PA's plummeting popularity among Palestinians.\n\nThe trip is rare and unusual, given that the last time a Saudi official visited Ramallah, he had been appointed a non-resident ambassador to Palestine.\n\nNayef al-Sudairi arrived just weeks before the 7 October 2023 Hamas-led attacks on southern Israel, and before him, King Faisal had visited in 1966.\n\nThose attacks were intended to and indeed derailed Saudi-Israeli normalisation talks, Hamas officials revealed over the course of the war.\n\nWith the kingdom being the de facto leader of the Arab world, it can set an agenda with the kind of influence few of its neighbours possess - and normalising with Israel would have likely dashed ambitions for Palestinian statehood.\n\nThe Times of Israel reported on Friday evening that Israel would block Farhan and his delegation's visit. Israel has control of the occupied West Bank's land border with Jordan.\n\nIf Israel follows through on the threat, it could further strain relations with Riyadh and other regional countries.\n\nSince 2023, Saudi Arabia has made it clear that normalisation would only be pursued with a clear pathway to a Palestinian state.\n\nEarlier this year, Saudi Crown Prince Mohammed bin Salman called Israel's now 19-month-long war on Gaza a \"genocide\", echoing assessments by the United Nations and countless rights organisations, among other leading historians and experts.\n\nMore than 54,000 Palestinians have been killed so far, with some experts believing the figure to be a significant undercount.\n\nNext month, a meeting in New York co-chaired by Saudi Arabia and France is expected to outline the necessity of establishing a Palestinian state, and rebuild support for the concept of the two-state solution, a plan outlined in the 1993 Oslo Accords.\n\nSeveral European nations have recently recognised the state of Palestine, including Ireland, Spain, and Norway.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/news/saudi-top-diplomat-make-rare-trip-occupied-west-bank"
    }
  },
  {
    "similarity": 0.2368,
    "combined_title": "Political Shifts in Poland and Israel: A Tale of Two Elections and Conflicts",
    "summary": "The recent Polish presidential election saw conservative Karol Nawrocki, known for his controversial stance on Holocaust revisionism, narrowly defeating liberal Warsaw Mayor Rafał Trzaskowski. Nawrocki's victory signals a continued populist and nationalist path for Poland, with potential implications for the country's foreign policy and legislation. Meanwhile, Israel's ongoing conflict with Gaza has generated international criticism, with accusations of genocide and ethnic cleansing. Despite support from the US, Prime Minister Benjamin Netanyahu has been unable to secure the release of hostages or disarm Hamas. The conflict has led to a growing division within Israeli society, with some fearing the country is becoming a pariah state. Both situations underscore the complexities of international politics and the profound impact of leadership changes and ongoing conflicts on national and global relations.",
    "is_article": {
      "title": "Conservative Holocaust revisionist Karol Nawrocki wins Polish presidential election",
      "content": "Conservative Karol Nawrocki, who madeHolocaust revisionismpart of his campaign, won Poland’s weekend presidential runoff election, according to the final vote count on Monday. Nawrocki won 50.89% of the votes in a very tight race against liberal Warsaw Mayor Rafał Trzaskowski, who received 49.11%.\n\nThe race had Poland on edge since a first round of voting two weeks earlier, revealing deep divisions in the country along the eastern flank of NATO and the European Union.\n\nAn early exit poll released Sunday evening suggested Trzaskowski was headed to victory before updated polling began to reverse the picture a couple of hours later.\n\nThe outcome suggests that Poland can be expected to take a more populist and nationalist path under its new leader, who was backed by US President Donald Trump.\n\nMost day-to-day power in the Polish political system rests with a prime minister chosen by the parliament. However, the president’s role is not merely ceremonial.\n\nThe office holds the power to influence foreign policy and veto legislation.\n\nRelated:Poland to vote for next president, with Holocaust history an apparent item on the ballot\n\nNawrocki will succeed Andrzej Duda, a conservative whose second and final term ends on August 6.\n\nUnder the Polish constitution, the president serves a five-year term and may be re-elected once.\n\nPrime Minister Donald Tusk came to power in late 2023 with a coalition government that spans a broad ideological divide — so broad that it hasn’t been able to fulfill certain of Tusk’s electoral promises, such as loosening the restrictive abortion law or passing a civil partnership law for same-sex couples.\n\nBut Duda’s veto power has been another obstacle. It has prevented Tusk from fulfilling promises to reverse laws that politicized the court system in a way that the European Union declared to be undemocratic.\n\nNow it appears Tusk will have no way to fulfill those promises, which he made both to voters and the EU.\n\nSome observers in Poland have said the unfulfilled promises could make it more difficult for Tusk to continue his term until the next parliamentary election scheduled for late 2027, particularly if Law and Justice dangles the prospect of future cooperation with conservatives in his coalition.\n\nNawrocki, a 42-year-old amateur boxer and historian, was tapped by the Law and Justice party as part of its push for a fresh start.\n\nThe party governed Poland from 2015 to 2023, when it lost power to a centrist coalition led by Tusk. Some political observers predicted the party would never make a comeback, and Nawrocki was chosen as a new face who would not be burned by the scandals of the party’s eight years of rule.\n\nThe strategy clearly worked.\n\nNawrocki campaigned under the slogan “Poland first, Poles first”.\n\nNawrocki has most recently been the head of the Institute of National Remembrance, which embraces nationalist historical narratives, which glorified Polish victimhood and resistance to the Nazis during World War Two while delegitimizing research on Polish antisemitism or Poles who killed Jews.\n\nHe led efforts to topple monuments to the Soviet Red Army in Poland, and Russia responded by putting him on a wanted list, according to Polish media reports.\n\nNawrocki’s supporters describe him as the embodiment of traditional, patriotic values. Those who oppose secular trends, including LGBTQ+ visibility, have embraced him, viewing him as a reflection of the values they grew up with.\n\nNawrocki’s candidacy was clouded by allegations of past connections to criminal figures and his participation in a violent street brawl. He denies the criminal links but was unapologetic about the street fight, saying he had taken part in “noble” fights in his life. The revelations did not seem to hurt his support among right-wing voters, many of whom see the allegations as politically motivated.\n\nTrump made it clear he wanted Nawrocki as Poland’s president.\n\nHe welcomed Nawrocki to the White House a month ago. And last week the conservative group CPAC held its first meeting in Poland to give Nawrocki a boost. Kristi Noem, the US Homeland Security Secretary and a prominent Trump ally, strongly praised Nawrocki and urged Poles to vote for him.\n\nThe US has about 10,000 troops stationed in Poland and Noem suggested that military ties could deepen with Nawrocki as president.\n\nA common refrain from Nawrocki’s supporters is that he will restore “normality,” as they believe Trump has done. US flags often appeared at Nawrocki’s rallies, and his supporters believed that he offered a better chance for good ties with the Trump administration.\n\nNawrocki has also echoed some of Trump’s language on Ukraine. He promises to continue Poland’s support for Ukraine but has been critical of President Volodymyr Zelenskyy, accusing him of taking advantage of allies. He has accused Ukrainian refugees of taking advantage of Polish generosity, vowing to prioritize Poles for social services such as health care and schooling.\n\n",
      "url": "https://www.timesofisrael.com/conservative-holocaust-revisionist-karol-nawrocki-wins-polish-presidential-election/"
    },
    "me_article": {
      "title": "War on Gaza: The world is turning, but Israel has yet to reckon with its crimes",
      "content": "As the father of a four-year-old daughter and a newborn baby, as I watch the international response to thegenocide in Gaza, I cannot help but wonder: at what age will my children cease to be considered children, and their lives be deemed less important?\n\nThe world is shocked at the number of children being killed andstarved in Gaza, but there remains no substantive critique of whatIsraelhas done over these past 19 months to allPalestiniansin Gaza. The threshold of demands has been lowered to merely alleviating the humanitarian crisis.\n\nIsrael has succeeded in destroying Gaza’s infrastructure, healthcare system, municipalities, education networks, families, mosques and churches - in short, every framework that organised human life.\n\nBut now, having exhausted its “target bank” and with nothing left to bomb, Israel is striking refugee tent camps andburning people alive. Such cruelty, along with the passage of time and mounting international pressure, have led to a turning point, both globally and within Israeli society.\n\nDespite the support provided to Israel by two successiveUSpresidents and the consensus among Democrats and Republicans alike to give Israel a free hand, Prime Minister Benjamin Netanyahu has failed to defeat Hamas or secure the release of the remaining hostages.\n\nAcross the spectrum, Israel’s political establishment adopted a revenge narrative from day one, priming the Israeli public to be complicit in its forthcoming crimes.\n\nIsrael’s failure was not its inability to free the hostages or disarm Hamas. As early asNovember 2023, Israel could have reached a deal to free all the hostages, while various proposals have been advanced to settle the conflict, including bringing in other entities, such as the Palestinian Authority, to govern Gaza.\n\nBut Israel’s real objective is clear: to empty Gaza of its population. As Finance MinisterBezalel Smotrich’s recent statements candidly reveal, the true aim of the war is to conquer Gaza, expel its Palestinian residents, and occupy the territory. This was the original intention all along.\n\nThis has resulted in two strategic failures for Israel. Firstly, it has failed to compelEgyptandJordanto participate in this scheme and accept Palestinian refugees.\n\nIsrael’s second failure is moral. The government and Israeli society itself have normalised a narrative of genocide and ethnic cleansing, defending this stance with euphemisms like “voluntary migration” and “encouraging relocation”.\n\nFollow Middle East Eye's live coverage of the Israel-Palestine war\n\nNow, with the intensification ofinternational criticism, cracks have begun to appear in the Israeli consensus. The insistence of thousands of activists and media figures worldwide - Palestinian and non-Palestinian alike - to continue speaking out on Gaza has generated sufficient pressure to make an impact.\n\nThis initially affected Israeli tourists, who discovered that most people around the world view genocide as an unforgivable atrocity, prompting Israel’s foreign ministry to remind Israelis tosuppress national symbolsabroad, fuelling a silent boycott of Israeli academics and cultural figures.\n\nThe West will scavenge for Israeli movements and leaders who speak out against the war, without offering a genuine moral alternative\n\nWe are now seeing a shift in the tone of western foreign policies - late, but significant. The US administration’s decision to hold direct negotiations with Hamas to secure the release of dual citizenEdan Alexanderreinforced the feeling among Israelis that their government is not genuinely interested in advancing a hostage deal.\n\nConversely, the US has grown weary of Israel, as evidenced by President Donald Trump’s Middle East tourskipping over Israel.\n\nThe shift in Israel’s global standing was further evidenced by a recent Financial Timeseditorialtitled “The West’s shameful silence on Gaza”, as European threats to suspend trade agreements have begun to bite.\n\nFrench President Emmanual Macron has shifted his tone toward overt criticism, saying this week that European nations must “harden the collective position” against Israel over Gaza’s worsening humanitarian crisis. Even Germany's new chancellor said Berlin would not export weapons used to break humanitarian law, in a break from 19 months of loyal support for Israel's war.\n\nWithin Israel itself, one of the most striking signs of fracture came in a recent statement from Yair Golan, leader of the Democrats party,who declared: “A sane country does not fight against civilians, does not kill babies as a hobby, and does not give itself the aim of expelling populations.”\n\nGolan, a former deputy militarychief of staff, wasdisciplinedtwo decades ago for employing the banned “neighbour procedure” in field operations, a method in which civilians are used to persuade their neighbours to surrender to the army.\n\nThis context suggests that Golan is no ethical pacifist. Rather, like many former Israeli generals, he realises that Israel is on its way to becoming a pariah state, incapable of surviving in the Middle East without western support.\n\nIndeed, many Israelis who were once fervent supporters of the war now frame the Gaza genocide as a political gambit for Netanyahu’s survival. Yet this was a war many in Israeli society wanted andsupported, including Golan himself.\n\nToday, public discourse in Israel oscillates between those who wish to continue the genocide, and those who are worried about the repercussions. This fracture is a byproduct of Israel’s failure to ethnically cleanse Gaza, and the fact that it will have to face armed resistance for many years to come.\n\nAmid this backdrop, Netanyahu’s far-right coalition partners speak of returning settlements to Gaza, a move that would place Israel squarely on the blacklist of pariah states.\n\nSadly, neither Golan nor others in Israel’s political and civil spheres - not even those who oppose the war - are prepared to admit that the state has carried out a genocide. But still, the public backlash against Golan’s remarks took its toll: days later, in atelevised interview, he declared that Israel “has not committed war crimes in Gaza”.\n\nDuring a visit to the southern city of Beersheba on Tuesday, angry Zionist crowdsheckled and booedGolan, who - despite retracting his earlier statements - is now being portrayed around the world as a supposed alternative to Netanyahu, even though he offers no real alternative.\n\nRegrettably, this is likely to be the future: the West will scavenge for Israeli movements and leaders who speak out against the war, without offering a genuine moral alternative. Similar to the periods after the First and Second Intifadas, millions of dollars will flow into Israel’s “peace industry”, which will talk about Arabs and Jews living together, without confronting the essential political questions that brought us to this reality.\n\nIn the meantime, we must support every statement and initiative that contributes to ending the war - because what matters now is Gaza, and not only the children of Gaza, but also the youths, the women, the men and the elderly.\n\nTo prevent further disaster, we must demand more from Israelis, including a real acknowledgment of their actions over the past 600 days.\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Eye.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456",
      "url": "https://www.middleeasteye.net/opinion/war-gaza-world-turning-point-israel-yet-reckon-crimes"
    }
  }
]