[
  {
    "source": "Times of Israel",
    "title": "New US deal outline would see 10 live hostages freed, 60-day truce, option to resume war",
    "url": "https://www.timesofisrael.com/new-us-deal-outline-would-see-10-live-hostages-freed-60-day-truce-option-to-resume-war/",
    "content": "The new proposal from US special envoy Steve Witkoff for a deal between Israel and the Hamas terror group would see the release of 10 living Israeli hostages held in Gaza and the return of the bodies of 18 deceased hostages, in exchange for a 60-day ceasefire, an Israeli official confirmed to The Times of Israel on Thursday.\n\nThe confirmation came as right-wing ministers, and some hawkish hostage families, came out in opposition to the proposed deal, arguing that Hamas is weakened and now is the time to force the terror group to surrender.\n\nAs part of theUS proposal, the United Nations would resume providing humanitarian aid to the Palestinians, in place of the new Israeli-backed mechanism that started operating this week, the Israeli official said. The UN has declined to cooperate with the new mechanism, saying it is insufficient to address the needs of Gaza’s civilian population, and allows Israel to weaponize the food supply.\n\nThe text of Witkoff’s proposed agreement will not include an Israeli promise to end the war, according to the Israeli official.\n\nThis had until now been the major sticking point, with Israel insisting any ceasefire would be temporary and Hamas insisting on a permanent end to the fighting. The previous hostage-ceasefire deal collapsed when Israel declined to move forward with talks to end the war.\n\nThe pan-Arab channel Al Ghad reported Thursday that the outline was submitted overnight to both Hamas and Israel, and that it calls for half of the agreed-upon number of hostages to be released on the first day of the truce, and the other half on the seventh day.\n\nIn return, Israel would release 125 Palestinian terror convicts serving life sentences, 1,111 Gazans detained since the start of the war on October 7, 2023, and 180 bodies of Palestinians currently held by Israel, according to Al Ghad.\n\nThe Arab channel also reported that the proposal contains an American guarantee that negotiations would continue throughout the ceasefire until a permanent ceasefire is reached.\n\nOn Wednesday, Hamas said it had reached an agreement with Witkoff on a “general framework” for a ceasefire deal and now awaited a “final response.”\n\nThe group claimed that the framework it had approved would secure a “permanent ceasefire,” the complete withdrawal of Israeli forces from Gaza, the flow of humanitarian aid, and a committee of independent Palestinian technocrats assuming governing control over the Strip instead of Hamas.\n\nOn Thursday, the same Israeli official told The Times of Israel that a Washington meeting earlier this week between Witkoff and Strategic Affairs Minister Ron Dermer on the hostage issue and on Iran was “uneasy,” saying Witkoff was getting impatient with Israel, especially around “drama.”\n\nThe official pointed to Prime Minister Benjamin Netanyahu’s video on Monday in which he said he hoped to make an announcement regarding hostages held in Gaza “today or tomorrow.”\n\nNetanyahu later walked back the claim.\n\nDiaspora Minister Amichai Chikli, from Netanyahu’s Likud party, on Thursday voiced his objection to the reported hostage deal outline, citing the fact that it continues the phased framework rather than seeing all the hostages released at once.\n\n“Enough with these salami tactics,” Chikli tweeted, advocating for letting the IDF “complete the mission” of taking over Gaza and compelling Hamas to surrender and disarm.\n\nHe also called for agreeing on the return of all abductees in return for letting surviving Hamas leaders leave the Strip.\n\nFar-right settlements Minister Orit Strock exhorted Prime Minister Benjamin Netanyahu on X, arguing that Hamas is “on its knees” and that Israel mustn’t “fold” now.\n\nAnd Finance Minister Bezalel Smotrich, reiterating comments he made on Wednesday, stressed his opposition to the new proposal.\n\n“I object to giving a lifeline to Hamas,” Smotrich told Radio 103FM on Thursday. “Hamas is in distress. The new [Israeli-backed] system for handing out aid cuts off Hamas from the residents.\n\n“We’re not leaving areas we’ve conquered,” he added, in response to reports that the outline would include an IDF pullout from areas recently taken over by the IDF, including the Morag Corridor.\n\nSome relatives of hostages also criticized the reported proposal.\n\n“This is a cruel and immoral deal that doesn’t achieve the goal” of removing Hamas from Gaza,” captiveAvinatan Or’s uncle, Shimon Or, told Ynet.\n\nThe hostage’s uncle accused Netanyahu of clinging on to an outdated idea that “one can make deals with Hamas,” and arguing that even if the war is halted, the terror group won’t release all the hostages.\n\nYael Adar, mother ofTamir Adar, who was killed fighting terrorists on October 7 before his body was abducted to Gaza, told the outlet that she prefers a comprehensive deal that returns all the hostages since “partial deals always pose the question of who’s on the list.”\n\nPolls have consistently shown that a majority of the Israeli public supports a deal to secure the release of all the hostages, even at the cost of ending the war against Hamas.\n\nNetanyahu, however, has said he will agree only to a temporary ceasefire, so long as Hamas remains in power and retains its arms. He insists on resuming fighting in Gaza after any temporary truce, until Hamas is eliminated and all hostages are freed. He also recently added to these demands the implementation of US President Donald Trump’s proposal to relocate Gazans outside of the Strip.\n\nThe premier last week called back an Israeli negotiation team from Doha, citing Hamas’s refusal to accept Witkoff’s previous proposal for a short-term ceasefire in exchange for the release of half the living hostages, which Israel had agreed to.\n\nNetanyahu has expressed openness to holding negotiations this time on a permanent ceasefire once a temporary truce is reached. However, Israel has reportedly pushed back on Hamas’s demands for guarantees from the mediators that Jerusalem be kept at the negotiating table.\n\nTerror groups in the Gaza Strip are holding 58 hostages, including 57 of the 251 abducted by Hamas-led terrorists on October 7, 2023.\n\nThey include the bodies of at least 35 confirmed dead by the IDF, and 20 are believed to be alive. There are grave concerns for the well-being of three others, Israeli officials have said.\n\nHamas released 30 hostages — 20 Israeli civilians, five soldiers, and five Thai nationals — and the bodies of eight slain Israeli captives during a ceasefire between January and March, and one additional hostage, a dual American-Israeli citizen, in May as a “gesture” to the United States. The terror group freed 105 civilians during a weeklong truce in late November 2023, and four hostages were released before that in the early weeks of the war. In exchange, Israel has freed some 2,000 jailed Palestinian terrorists, security prisoners, and Gazan terror suspects detained during the war.\n\nEight hostages have been rescued from captivity by troops alive, and the bodies of 41 have also been recovered, including three mistakenly killed by the Israeli military as they tried to escape their captors, and the body of a soldier who was killed in 2014.\n\nThe body of another soldier killed in 2014, Lt. Hadar Goldin, is still being held by Hamas, and is counted among the 58 hostages.\n\n\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "IDF downs missile fired from Yemen after 6th Houthi attack in a week",
    "url": "https://www.timesofisrael.com/idf-downs-missile-fired-from-yemen-after-6th-houthi-attack-in-a-week/",
    "content": "A ballistic missile launched at Israel by the Iran-backed Houthis in Yemen was successfully intercepted by air defenses, the military said Thursday night, in what has recently become an almost daily occurrence.\n\nThe missile set off sirens shortly after 9:20 p.m. across central Israel, several West Bank settlements, and towns near Jerusalem, sending millions to bomb shelters.\n\nThe attack also briefly halted the final of the Israel State Cup, held at Bloomfield Stadium in Tel Aviv, where tens of thousands of soccer fans gathered to watch Hapoel Beersheba play Beitar Jerusalem.\n\nPreceding the sirens by about three minutes, an early warning was issued by the Home Front Command to residents, alerting them of the long-range missile attack via a push notification on their phones.\n\nThe Israel Defense Forces later announced it was investigating after an Aviv Geffen concert at Tel Aviv’s Yarkon Park was not halted amid the attack, despite sirens sounding in the area. The military said it received reports that attendees did not hear the sirens.\n\n“The performance was not stopped by security forces at the time of the alert, and the incident is being investigated,” the IDF said.\n\nThere were no reports of injuries or damage in the attack, which marked the sixth time in the past week that the Houthis have fired on Israel.\n\nThe Houthis took responsibility for the missile fire, claiming to have targeted Ben Gurion Airport. Earlier this month, a Houthi missile slipped through air defenses andhit the groundsof the airport, injuring six people, none of them seriously.\n\nThursday’s missile fire was the first attack since Israel, on Wednesday, carried out anairstrikein Yemen, targeting the Houthi-held Sanaa International Airport and destroying a plane that was in use by the Iran-backed terror group.\n\nA separate strike earlier this monthdestroyed the airport’s terminaland six planes, and left craters on its runway, according to Yemeni authorities. The airfieldreopenedfor a flight 11 days later.\n\nAlso this month, the Israeli Air Force struck the Houthi-controlledHodeida and Salif portsin Yemen in response to the Iran-backed group’s repeated attacks on Israel.\n\nThe Houthis vowed to respond and have since continued their missile attacks.\n\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — began attacking Israel and general maritime traffic in November 2023, a month after the October 7 Hamas massacre.\n\nThey held their fire when a ceasefire was reached between Israel and Hamas in January 2025.\n\nBy that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\n\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis in Yemen have launched 42 ballistic missiles and at least 10 drones at Israel. Several of the missiles have fallen short.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "US judge says she will block Trump freeze on foreign students at Harvard",
    "url": "https://www.timesofisrael.com/us-judge-says-she-will-block-trump-freeze-on-foreign-students-at-harvard/",
    "content": "CAMBRIDGE, Massachusetts (AFP) — Thousands of Harvard students in crimson-fringed gowns celebrated their graduation Thursday, as a federal judge said she would temporarily block President Donald Trump’s bid to bar the prestigious university from enrolling international scholars.\n\nTrump has made Harvard the central target of his campaign against elite US universities, which he has threatened with funding freezes and action against their foreign students over what he says is liberal bias and antisemitism.\n\nA federal judge in Boston said she would issue an order that “gives some protection” to international students while courts consider the legality of Trump’s effort to block Harvard from enrolling foreign students.\n\n“We want to make sure there’s no more shenanigans between now and then,” said Harvard’s lawyer Ian Gershengorn.\n\n“Our students are terrified, and we’re [already] having people transfer” to other universities, he said.\n\nIn an eleventh-hour filing ahead of the hearing, the Trump administration issued a formal notice of intent to withdraw Harvard’s ability to enroll foreign students, kickstarting the process.\n\nThe filing gave Harvard 30 days to produce evidence showing why it should not be blocked from hosting and enrolling foreign students.\n\nJudge Allison Burroughs had already temporarily paused the policy affecting some 27 percent of Harvard’s student body, extending that pause Thursday.\n\nShe said she would seek to determine whether the approvals “were terminated for a retaliatory motive.”\n\nA law professor present in the packed court said the Trump administration was prolonging the suffering of international students.\n\n“Harvard is in this purgatory. What is an international student to do?” said the Harvard Law School graduate, who declined to be named.\n\nThere also remained “this specter of other actions” the government could take to block Harvard from having international students, she added.\n\nThe Ivy League institution has continually drawn Trump’s ire while publicly rejecting his administration’s repeated demands to give up control of recruitment, curricula, and research choices.\n\n“Harvard is treating our country with great disrespect, and all they’re doing is getting in deeper and deeper,” Trump said Wednesday.\n\nHarvard President Alan Garber got a huge cheer Thursday when he mentioned international students attending the graduation with their families, saying it was “as it should be” — but Garber did not mention the Trump fight directly.\n\nHe at one point received a standing ovation, which one student told AFP was “revealing of the community’s pride and approval.”\n\nGarber has led the legal fightback in US academia after Trump targeted several prestigious universities — including Columbia, which made sweeping concessions to the administration to restore $400 million of withdrawn federal grants.\n\nHe has acknowledged that Harvard does have issues with antisemitism and that it has struggled to ensure that a variety of views can be safely heard on campus.\n\nAhead of the ceremony, members of the Harvard band, sporting distinctive crimson blazers and brandishing their instruments, filed through the narrow streets of Cambridge, Massachusetts — home to the elite school, America’s oldest university.\n\nIn front of a huge stage, hundreds of students assembled to hear speeches, including one entirely in Latin, in a grassy precinct that was closed off to the public for security.\n\nMany students from the Harvard Kennedy School of Government carried inflatable plastic globes at the ceremony to symbolize the international makeup of the school’s student body.\n\n"
  },
  {
    "source": "Times of Israel",
    "title": "National Security Council sharpens warning against ‘high risk’ travel to Sinai",
    "url": "https://www.timesofisrael.com/national-security-council-sharpens-warning-against-high-risk-travel-to-sinai/",
    "content": "The National Security Council on Thursday renewed and sharpened its warning to Israelis to stay away from the popular Sinai Peninsula.\n\n“The terrorist threat in this area has been high for some time, and recently these threats against visiting Israelis have become more acute,” said the NSC, which has designated Sinai a “high risk” destination since the Gaza war was sparked by the Hamas onslaught of October 7, 2023.\n\nThe NSC has classified the danger to Israelis in Sinai as Level 4, “High Risk,” the highest threat level in the NSC’s classification, which applies to the rest of Egypt as well.\n\nIsraelis are called on to stay away or leave if they are already there, “due to the fear that terrorist elements will attempt to harm Israelis,” the NSC has said of Egypt and Sinai specifically.\n\nThe peninsula, which Israel occupied in 1967 and returned to Egypt in 1982 following the two countries’ 1979 peace agreement, is one of the few foreign destinations that Israelis can reach by land. Before the war, it attracted large numbers of Israeli tourists for its pristine, calm beaches and low prices.\n\nTravel from Israel to Egypt hasdropped precipitouslyamid the war and the heightened threat to Israeli tourists. On October 8, 2023, a day after the Hamas attack,two Israeli tourists were killedby a policeman in Alexandria. In the same city, anIsraeli-Canadian businessman was murderedon May 7, 2024, under unclear circumstances.\n\nSinai itself has seen no terror attacks with Israeli victims since 2004, when atruck drove into the lobby of the Taba Hiltonand exploded, killing 31 people, including 12 Israelis. In 2014, another bombing by Islamistskilled three South Korean pilgrimsand their Egyptian bus driver, only 100 yards away from the border crossing to Eilat, Israel’s southernmost city.\n\nMeanwhile, Northern Sinai, which borders Gaza, has seen insurgent attacks by Islamist groups against Egyptian security forces, though these have become less frequent in recent years.\n\nGianluca Pacchiani contributed to this report.\n\n"
  }
]