[
  {
    "source": "Middle East Eye",
    "title": "Israeli opposition leader Yair Lapid tells Netanyahu to accept Gaza truce deal",
    "url": "https://www.middleeasteye.net/news/gaza-war-israel-yair-lapid-tells-netanyahu-accept-truce-deal",
    "published": null,
    "content": "Israeliopposition leader Yair Lapid has called on Prime Minister Benjamin Netanyahu to accept a ceasefire proposal mediated by theUS.\n\nThe call comes as a number of Israeli politicians voice their opposition to Israel's continued military operations in Gaza.\n\n“Israel must publicly and immediately accept the outline published this morning by American mediator Steve Witkoff,” Lapid posted on X.\n\nUS envoy Witkoff's proposal involves the exchange of Israeli captives held by Hamas for Palestinians held by Israel and a temporary ceasefire that would lead to talks for an end to the conflict.\n\n“I remind Netanyahu: He has a full safety net from me to accept the outline, even if [National Security Minister Itamar] Ben Gvir and [Finance Minister Bezalel] Smotrich try to torpedo it.”\n\nExtreme right figures within Netanyahu's already far-right cabinet like Ben Gvir and Smotrich have conditioned their support of the Israeli prime minister on an expansionist position both in Gaza and the occupied West Bank.\n\nIn remarks made while celebrating Israel's occupation of the old city of Jerusalem earlier this week, Smotrich doubled down on his intent to settle Gaza with Israelis and the expulsion of its Palestinian population.\n\n\"We are conquering the Land of Israel, liberating Gaza, settling Gaza, and defeating the enemy,\" Smotrich said to crowds that had chanted \"death to Arabs\" as they marched through Jerusalem's Old City and attacked Palestinians.\n\n\"With God's help, we will expand Israel's borders, bring about complete redemption, and rebuild the Temple here,\" he said, referring to al-Aqsa Mosque, which settlers raided earlier on Monday.\n\nThat posture has irked figures in Israel's centre, who are worried that the Netanyahu' government's aggressive posture on Gaza and Palestinians generally is threatening Israel's international standing.\n\nLast week, formerIsraeliPrime Minister Ehud Olmert condemned his country's actions inGaza, accusing the government of killing innocentPalestinians.\n\nIn a BBC interview on Tuesday, Olmert, who served as the prime minister of Israel from 2006 to 2009, said what Israel was doing in Gaza is \"very close to a war crime\".\n\nHe told the network that the “obvious appearance” of the war on Gaza is that \"thousands of innocent Palestinians are being killed, as well as many Israeli soldiers,\" adding that \"from every point of view, this is obnoxious and outrageous.\n\n\"The war has no objective and has no chance of achieving anything that could save the lives of the hostages... We are fighting Hamas murderers, we are not fighting innocent civilians, and this must be clear,\" Olmert said.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Why the UK refuses to do the one thing that could stop Israel's 'intolerable' war on Gaza",
    "url": "https://www.middleeasteye.net/opinion/uk-refuses-do-one-thing-could-stop-israel-intolerable-war-gaza-why",
    "published": null,
    "content": "WhatIsraelis doing in Gaza is “morally wrong and unjustifiable”, its actions “intolerable” and “an affront to the values of the British people”.\n\nThese are not the words of a pro-Palestineactivist, but of theUKforeign secretary,David Lammy, who has now suspended negotiations on a new free trade agreement and vowed to review co-operation on the 2030 bilateral road map.\n\nBut the UK government still won’t take the single fastest and most effective step: ending military cooperation with Israel and halting all arms sales.\n\nLammy said in parliament that “arms are not getting to Israel that could be used in Gaza”. This is false. The UK government last yearsuspendeda small number of arms export licences - around 10 percent - after determining that Israel is not committed to complying with international humanitarian law, but it allowed UK participation in the F-35 fighter jet programme to continue.\n\nIn addition, new data from both Israel and the UK raises concerns about the scale and end use of UK-supplied weaponry.\n\nIn its September 2024 decision to restrict certain arms sales, the government decided on the narrowest possible approach: it suspended licences for weapons with a direct use in Gaza, but it did not halt wider arms exports to Israel for use by the army - such as for training purposes or for its illegaloccupationof the West Bank - or for Israeli industry use.\n\nYet there is a much wider pattern ofBritish military collaborationwith Israel and its illegal practices, beyond direct violence in Gaza.\n\nEven within the government’s narrow position, there is a massive loophole. The suspension does not cover components that go to the USA to be put into F35s to be sent to Israel. UK companies provide15 percentof every new F-35 fighter jet made.\n\nNeither does the suspension cover components that reach Israel via a global spare parts pool.  The pool is coordinated by the US Department of Defense and arms companies Lockheed Martin and Pratt & Whitney.\n\nYet apparentlythere is no system in placeto track the movement of parts into and out of the pool - which the British government says makes it impossible for it to prevent UK-made parts from reaching Israel.\n\nThis is hard to believe, to the point of absurdity. The world’s largest military producer and massive arms companies, unable to track their supply chain? If faulty parts were found, you can bet they’d want to pinpoint where they came from.\n\nInstead, this appears to be a question of political will: tracking parts to avoid them being used in a genocide simply isn’t on the agenda.\n\nWe know that Israel is using F-35s to bomb Gaza, assist ground troops and implement the blockade. The Israeli army has reportedly conducted more than15,000 flight hoursand 8,000 missions over Gaza since 7 October 2023. This past March, Israelused F-35sto break the ceasefire, killing more than 400 Palestinians in a single day.\n\nFollow Middle East Eye's live coverage of the Israel-Palestine war\n\nUK parts have been central to this killing spree. The UK government licence for the F-35 was used14 timesmore in 2023 than in any previous year.\n\nThe UK government accepts thatthere is a clear riskthat F-35 components might be used to commit or facilitate serious violations of international humanitarian law. Nonetheless, the governmentassertsin court documents that this is outweighed by the “immensely serious and imminent risks to international peace and security” posed by a suspension of F-35 parts.\n\nWhat are these immensely serious and imminent risks?\n\nThe UK government's position is growing increasingly untenable, and seems more brittle by the day\n\nApparently, they are too sensitive for the public to know. Court documents are heavily redacted, leaving only vague claims about damage to the credibility ofNatowar plans and a potential reduction of Nato air control in the event of prolonged disruption or conflict in other parts of the world.\n\nThese ambiguous risks are apparently deemed to be more serious than genocide or other war crimes against Palestinians, and more imminent than the actually occurring, live-streameddevastation of Gaza. Cloaked in the language of national security, and hidden behind the black pen of redactions, we are asked to take these claims at face value, despite what we know is happening in Gaza.\n\nIn addition to the F-35 loophole,a new reportby the Palestinian Youth Movement, Workers for a Free Palestine and Progressive International - relying on data from the Israel Tax Authority - suggests that the UK might have continued directly shipping F-35 parts to Israel even after the suspension.\n\nMPZarah Sultanaand 41 of her colleagues, along with a number of other groups, have demanded that Lammy respond to questions raised by the report. The government did not respond to the letter, and waschallengedin Parliament about this failure.\n\nFurthermore, the latest UK government licensing data shows that licences worth £127.6 million ($172m) were granted to Israel between October and December 2024, the months following the suspension. That’smore licences than in 2020-23 combined.\n\nThe equipment licensed is mostly military radars, components, software and targeting equipment, prompting the parliamentary business and trade committee to ask government ministers fororal evidencein an effort to understand how they can be certain this equipment isn’t being used in Gaza.\n\nAs all of this has been going on, the UK government has beenin courton a case brought by the Palestinian human rights organisation Al-Haq and the Global Legal Action Network. They have spent the past year and a halffighting the governmentover its arms export policy, and more recently over its decision to exempt F-35 parts from the licensing suspension.\n\nThe government’s main strategy has been toclaimthe court doesn’t have jurisdiction to assess the case. If the judges accept this, it will be a death knell for arms export control policy. If the courts cannot assess whether the government implemented its own legally binding policy properly, what is the point of having controls?\n\nThe UK government’s position is growing increasingly untenable, and seems more brittle by the day. Its suspension of trade talks with Israel is a paltry response to what it calls an intolerable situation.\n\nJust hours after Lammy’s statement, anotherRAF surveillance planetook off towards Gaza to provide intelligence to Israel; and days later, UK trade envoy  Lord Austinvisited Israelto,in his words, “drum up business for Britain”.\n\nThe mismatch between government practice and Lammy’s confected outrage speaks volumes.\n\nMeanwhile, the government is using counter-terrorism legislation to punish Palestine activists, promptingUN expertsto criticise its heavy handedness.\n\nOngoing public and parliamentary opposition to Israel’s actions in Gaza is forcing the government into ever-more contorted justifications to avoid the one thing that would materially force Israel to reconsider its practices: suspending all arms transfers to and from Israel, and halting all military cooperation.\n\nThis would have a swift and concrete effect on Israel’s ability to carry out its assault on Palestinians and its occupation of Palestinian land.\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Eye.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Benedict Cumberbatch among more than 300 artists urging Starmer to end UK arms sales to Israel",
    "url": "https://www.middleeasteye.net/news/over-300-artists-public-figures-call-uk-starmer-end-arms-sales-israel",
    "published": null,
    "content": "More than 300 British artists, doctors, activists and academics have signed anopen letterurging British Prime Minister Keir Starmer to endUKcomplicity in Gazawar crimesand broker an immediate and permanent ceasefire.\n\nThe prominent public figures have also demanded that the prime minister suspend all UK arms sales toIsrael.\n\n\"We urge you to take immediate action to end the UK’s complicity in the horrors inGaza,\" the letter starts.\n\n\"Violence stamped with UK inaction - flown with parts shipped from British factories to Israel, could be obliterating families in seconds. Each arms shipment makes our country directly complicit in their deaths.\"\n\nAmongst the signatories are singer-songwriter Dua Lipa, actors Benedict Cumberbatch, Brian Cox, Toby Jones and Andrea Riseborough, broadcaster Gary Lineker, film director Danny Boyle, and Holocaust survivor Stephen Kapos.\n\nThe main demands outlined in the letter urge Starmer to suspend UK arms sales and licences to Israel, ensure full humanitarian access across Gaza without military interference, broker an immediate ceasefire, and put an end to the starvation wrought on the besieged enclave.\n\n\"Over 15,000 children have already been killed - including at least 4,000 under the age of four. Bedrooms where children once slept, kitchens where families shared meals, schools where they learned - all reduced to rubble while Britain stands by,\" the open letter read.\n\n\"History is written in moments of moral clarity. This is one. The world is watching and history will not forget. The children of Gaza cannot wait another minute. Prime Minister, what will you choose? Complicity in war crimes, or the courage to act?\"\n\nSince the start of the war on Gaza, the Israeli military has killed more than 54,000 people, the majority of them children and women, and wounded more than 123,300 people.\n\nThe Government Media Office in Gaza reported on Wednesday that more than 18,000 children are estimated to have been killed over 19 months of Israeli attacks, including 16,854 confirmed deaths.\n\nAmong the children killed, 916 were under one year old; 4,365 were aged one to five; 6,101 were between six and 12; and 5,124 were aged 13 to 17.\n\nThe signatories have condemned the total Israeli blockade of the Gaza Strip that has left the population facing acute hunger.\n\nThey stressed that the UK must ensure \"full humanitarian access across Gaza for experienced aid organisations without military interference.\"\n\n\"Right now, children in Gaza are starving while food and medicine sit just minutes away, blocked at the border. Words won’t feedPalestinianchildren - we need action... Mothers, fathers, babies, grandparents - an entire people left to starve before the world’s eyes,\" the letter said.\n\n\"290,000 children are on the brink of death - starved by the Israeli government  for more than 70 days. They cry until they can’t cry anymore - until hunger takes even their voices. And their parents are left to do the unthinkable: hold them, and wait.\"\n\nIsrael sealed off Gaza’s borders on 2 March, blocking the entry of all international aid and goods, including basic food items, hygiene supplies, and fuel.\n\nOn 1 April, all 25 bakeries supported by the World Food Programme across the Gaza Strip shut down due to the lack of wheat flour and fuel.\n\nSince Tuesday, the Gaza Humanitarian Foundation, a controversial US-backed group that has been approved by Israel to take over aid distribution in the enclave, has claimed to have handed out just 14,000 food boxes to Palestinians - a fraction of what aid agencies say is needed to address the mass starvation unfolding in the strip.\n\nThe new aid system, which limits food distribution to a small number of hubs guarded by American security contractors, seeks to wrest distribution away from aid groups led by the United Nations.\n\nThe Israeli military on Tuesdayfired shotsin the area outside a GHF distribution site, as Palestinians waiting for aid briefly rushed inside the facility due to long delays conducting security checks on recipients.\n\nIsraeli gunfire killed three and wounded at least 47 others.\n\nThe UN and other major humanitarian organisations have rejectly the new system, saying it won't be able to meet the needs of Gaza's 2.1 million people and allows Israel to use food control as a weapon to control the population.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "UN and aid groups condemn US-Israeli initiative after deadly scenes in Gaza",
    "url": "https://www.middleeasteye.net/news/un-and-aid-groups-condemn-us-israeli-initiative-after-deadly-scenes-gaza",
    "published": null,
    "content": "The United Nations and aid groups have spoken out after threePalestinianswere killed byIsraelifire and dozens injured at an aid distribution point set up by an Israeli-US-backed initiative.\n\nThere werechaotic scenes in Rafah, southern Gaza, on Tuesday as starving Palestinians rushed inside a facility holding aid, due to long delays conducting security checks on recipients.\n\nIsrael’s military opened fire on the crowds as they rushed in, killing at least three Palestinians.\n\nAt least 47 others were wounded and seven missing, according to Palestinian authorities in Gaza and the UN.\n\nThe Gaza Humanitarian Foundation (GHF) denied such reports, while the Israeli military said it fired “warning shots” and later re-established control of the facility.\n\nAccording to Israeli media, Americans affiliated with the GHF had to be rescued once they lost control of the facility.\n\nUN spokesperson Stephane Dujarric described the scenes as “heartbreaking, to say the least”.\n\n“We and our partners have a detailed, principled, operationally sound plan - supported by member states - to get aid to a desperate population,” Dujarric told reporters.\n\n“We continue to stress that a meaningful scale-up of humanitarian operations is essential to stave off famine and meet the needs of all civilians, wherever they are.”\n\nDujarric added that aid needed to be distributed in a way that was independent and impartial.\n\n“We saw the plan that [the GHF] published and that they presented to us, and it is not done with the parameters that we feel match our principles, which we apply across the board, from Gaza to Sudan to Myanmar, to anywhere you want to talk about.”\n\nPhilippe Lazzarini, head of Unrwa, the UN agency for Palestinian refugees, said Israel’s model for providing aid was wasteful and a “distraction from atrocities”.\n\n“The model of aid distribution proposed by Israel does not align with core humanitarian principles,” Lazzarini said on Wednesday.\n\n“We have seen yesterday the shocking images of hungry people pushing against fences, desperate for food. It was chaotic, undignified and unsafe.”\n\nAhmed Bayram of the Norwegian Refugee Council called on Israel and the US to scrap the initiative.\n\nHe said: “This is not how aid is done; this is not how aid should be distributed, not least obviously an occupier doing that - a country that has destroyed and flattened Rafah, asking people to come back to Rafah, that has displaced people out of Rafah, and now tells them to come back and receive whatever they can get hold of.”\n\nThe GHF said in a statement that it had distributed 8,000 food boxes, which it said amounted to around 462,000 meals.\n\nIsraeli Prime Minister Benjamin Netanyahu played down the chaotic scenes.\n\n“There was some loss of control momentarily. Happily, we brought it back under control,” he said.\n\nHe also went on to falsely claim that there was no proof of malnutrition in Gaza, stating: “You don’t see one, not one emaciated [person] from the beginning of the war to the present.”\n\nThe GHF is an Israeli-backed organisation established in early 2025 to manage a new model of humanitarian aid distribution in the Gaza Strip.\n\nIt was incorporated in Switzerland in February 2025, with a US-based counterpart also registered.\n\nThe organisation presented itself as an independent and neutral body, aiming to deliver aid directly to Palestinian civilians through a network of four secure distribution sites in southern and central Gaza.\n\nAccording to the GHF, the aid distribution sites are managed by private US security and logistics firms, including UG Solutions and Safe Reach Solutions (SRS), that are responsible for securing distribution hubs and overseeing vehicle checkpoints.\n\nBoth SRS and UG Solutions have faced scrutiny regarding their legitimacy and transparency. Critics, including Israeli opposition leader Yair Lapid, have suggested that these entities might be “shell companies” designed to obscure Israeli government involvement and funding in the aid process.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Trump administration on the defensive after Gaza aid plan spirals into chaos",
    "url": "https://www.middleeasteye.net/news/trump-administration-defensive-after-gaza-aid-plan-spirals-chaos",
    "published": null,
    "content": "USState Department spokesperson Tammy Bruce kicked off Tuesday's briefing with \"great news to report out of Gaza\", despite taking to the podium just hours after the scandal-plagued US-Israeli aid distribution scheme descended into chaos, with gunfire ringing out while desperate Palestinians rushed the makeshift facility to obtain food.\n\n\"The Gaza Humanitarian Foundation (GHF), under the humanitarian principles of independence and impartiality, has commenced providing life-saving aid to the people of Gaza who desperately need it,\" Bruce said. \"Approximately 8,000 food boxes have been distributed so far. Each box feeds 5.5 people for three and a half days, totalling 462,000 meals.\"\n\nBut order had quickly disintegrated into a stampede earlier in the day, and many who made the long trek from northern to southern Gaza did not receive any aid at all.At least three Palestinians were killed and 46 wounded by Israeli fire during the chaos, as throngs of starving people rushed to retrieve food packages, Arabic media reported.\n\nWhen pressed on the escalation into violence at the facility, Bruce told reporters Hamas was to blame.\n\n\"Hamas still has weapons. Hamas is in a situation here where all of this could have been stopped, of course, if they had released the hostages and put down their weapons, but they refused to do so. They've also rejected ceasefires,\" she said.\n\n\"The fact of the matter is, Hamas has been opposed to this dynamic. They have attempted to stop the aid movement through Gaza to these distribution centres.\"\n\nOn Sunday, the head of the United Nations World Food Programmerefutedthe claim that Hamas was stealing aid coming into Gaza.\n\n'Was this going to be like going to the mall or through a drive-thru? No, it wasn't'\n\n- Tammy Bruce, State Department spokesperson\n\nAnd in March, it was Israel that resumed bombing Gaza after a six-week ceasefire that it refused to extend.\n\n\"The bottom line is, the real story here is that the aid is moving through and in that kind of an environment, it's not surprising that there might be a few issues,\" Bruce said.\n\nThose \"issues\" involved the deaths of at least three Palestinians at the GHF site.\n\n\"Was this going to be like going to the mall or through a drive-thru? No, it wasn't. This is a complicated environment, and the story is the fact that it's working,\" Bruce insisted.\n\n\"Whatever it was that was hindering the aid to the Gazan people has been overcome,\" she added, after being reminded by a reporter that Israel maintains a full blockade of Gaza.\n\nGHF's CEO, a former US Marine,resignedon Sunday just before operations were due to commence because he could not act impartially, he said in a statement.\n\nJake Wood's departure came as investigations in TheWashington Postand TheNew York Timesover the weekend raised significant questions about the origins of the organisation and its ties to Israeli officials.\n\nAs critical questions mounted in the room, Bruce distanced the US government from GHF.\n\n\"I don't speak for this foundation... This is not a State Department effort. We don't have a plan,\" she told reporters.\n\nSo, how can reporters contact GHF, which remains a mysterious organisation with no publicly available communications channel? A reporter asked.\n\n\"I think there's a thing called the internet,\" Bruce responded. \"I think a number of you understand research.\"\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  }
]