[
  {
    "source": "Middle East Eye",
    "title": "Israeli forces kill three starving Palestinians queuing for food, raising death toll of aid seekers to 75",
    "url": "https://www.middleeasteye.net/news/israel-kills-starving-palestinians-seeking-aid-southern-gaza",
    "published": null,
    "content": "Israeliforces shot dead three starvingPalestiniansat aUS-Israeli relief distribution centre in southernGazaon Monday, raising the number of those killed whilst trying to obtain food to more than 75 people in less than six days.\n\nGaza's Health Ministry reported that three Palestinians were killed and at least 35 wounded when Israeli forces opened fire near an aid distribution site in Rafah operated by the US and Israeli-backed Gaza Humanitarian Foundation (GHF).\n\nThe ministry reported that according to its own tally, at least 75 Palestinians had been killed and more than 400 wounded whilst queuing for food since the GHF launched its operations in Gaza on 27 May.\n\nMonday's killings came hours after Israeli forcesmowed downat least 35 Palestinians at two US-Israeli food distribution points in Rafah and central Gaza.\n\nEyewitnesses and local officials told Middle East Eye that Israeli troops opened fire directly on civilians, with many of the fatalities receiving gunshot wounds to their head or chest.\n\n\"I was standing among the crowd, but when people started rushing toward the distribution point, I couldn’t move with them because there were hundreds pushing forward,\" Marwa al-Naouq told MEE on Sunday.\n\n\"Then a quadcopter appeared and began firing at them. After that, the Israeli army opened fire directly on the crowd, and American security forces fired tear gas canisters.\n\n\"Dozens were killed and injured as people ran in every direction, trying to escape.\"\n\n\n\nSince launching operations last Tuesday, the GHF has claimed - without providing any evidence - to have handed out tens of thousands of food boxes to needy Palestinians - a fraction of what aid agencies say is needed to address the mass starvation unfolding in the strip.\n\n'Corralling desperate families behind fences and placing aid under armed guard violates not only humanitarian principles but common decency'\n\n-Rob Williams, War Child Alliance\n\nThe new aid system, which limits food distribution to a small number of hubs guarded by American security contractors, seeks to wrest distribution away from aid groups led by the United Nations.\n\nThe UN and other major humanitarian organisations have repeatedly criticised the mechanism, with Doctors Without Borders (MSF)warningthat \"weaponising aid in this manner may constitute crimes against humanity.\"\n\n\"Today's events have shown once again that this new system of aid delivery is dehumanising, dangerous and severely ineffective,\" Claire Manera, MSF's emergency coordinator, said in a statement on Sunday.\n\n\"It has resulted in deaths and injuries of civilians that could have been prevented. Humanitarian aid must be provided only by humanitarian organisations who have the competence and determination to do it safely and effectively,\" she added.\n\nRob Williams, the CEO of the rights group War Child Alliance, has also criticised the US and Israeli-backed aid mechanism, saying the scenes in Rafah are a \"devastating indictment of a model that should never have existed\".\n\n\"Corralling desperate families behind fences and placing aid under armed guard violates not only humanitarian principles but common decency,\" he said.\n\n\"The true monstrosity of this ugly system lies the draping of a 'humanitarian' disguise over the military deployment of food as a means of displacing a population,\" he added.\n\nSince 2 March, Israel has barred all supplies from entering Gaza, including food, water and medicine, in a bid to force Hamas into renegotiating the ceasefire deal agreed in January.\n\nIsrael wants the Palestinian group to release the remaining Israeli captives held in Gaza in exchange for humanitarian aid, an extended truce and more Palestinian prisoners held in Israeli jails.\n\nBut Hamas has insisted on an Israeli commitment to a permanent ceasefire, saying any \"partial deals\" will allow Israel to resume the killing in Gaza.\n\nSince reneging on the ceasefire deal, Israeli forces have killed at least 4,000 people in attacks targeting tents, hospitals and school-turned-shelters.\n\nAccording to Palestinian health and government officials, at least 54,000 Palestinians have been killed by Israeli forces since October 2023, including more than 28,000 women and girls.\n\nThe figure also includes at least 1,400 health sector professionals, 280 UN aid workers - the highest staff death toll in UN history - and at least 180 journalists, the highest number of media workers killed in conflict since the Committee to Protect Journalists (CPJ) began recording data in 1992.\n\nIn January, the medical journal the Lancet reported that fatalities were probably underreported by 41 percent.\n\nThe study estimated that 59.1 percent of those killed were women, children and people over the age of 65. It did not provide an estimate of Palestinian fighters among the dead.\n\nThat toll represented 2.9 percent of Gaza's pre-war population, \"or approximately one in 35 inhabitants\", the study said.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Palestinian doctor who lost nine children in Israeli attack dies from wounds",
    "url": "https://www.middleeasteye.net/news/palestinian-doctor-who-lost-nine-children-israeli-attack-dies-wounds",
    "published": null,
    "content": "APalestiniandoctor, who lost nine children in anIsraelistrike in late May, has died from wounds sustained in the same attack.\n\nHamdi al-Najjar, 40, is survived by his wife Alaa al-Najjar, a doctor at al-Tahrir hospital within the Nasser Medical Complex, and his 11-year-old son Adam, who is still receiving treatment for his injuries.\n\nShortly before the strike on 23 May, Alaa had left for work with Hamdi, who then returned home.\n\nNot long after, an Israeli strike hit their house in the Qizan al-Najjar area in southern Khan Younis, killing nine of their 10 children and wounding the 10th.\n\nAlaa, a paediatric specialist, was treating victims of Israeli bombardments that day when her own children and husband were brought to her.\n\nNajjar sustained serious wounds and remained in intensive care until he died on Saturday, nearly a week after the attack.\n\nFootage released by the Palestinian Civil Defence showed rescue crews pulling the children’s bodies from the rubble, as flames engulfed the family's home.\n\nHampered by a lack of proper equipment and the vast scale of destruction, civil defence workers could be heard calling into the rubble, desperately searching for signs of life.\n\nThe civil defence team reported that seven bodies were recovered and transferred to Nasser hospital, where their mother works. Two others, including a six-month-old baby, remained trapped under the rubble at the time.\n\nThe children were identified as Yahya, Rakan, Ruslan, Jubran, Eve, Revan, Sayden, Luqman and Sidra.\n\nSpeaking to Middle East Eye following the Israeli assault on the family home, Ali al-Najjar, Hamdi's brother, said he had found Hamdi lying motionless on the ground, with his son beside him. The home was engulfed in flames.\n\n“The children were completely burnt,” he said. “I carried my nephew Adam and my wounded cousin and rushed them to the hospital.”\n\nMoments later, he returned to the burning home - only to see his sister-in-law, the children's mother, arrive in horror. “She had run on foot from the hospital to the house,” he said.\n\n“Four of her children were pulled out, charred, right in front of her eyes,” he said.\n\nAli described the ongoing agony of not knowing the fate of two missing children. “Seven children were pulled from under the rubble, and two - Yahya, 13, and Sidra, just six months old - are still missing. We cannot find them.”\n\nHe said civil defence teams resumed the search the next morning but found nothing. “Their mother cannot even identify the bodies, the children are so badly burned she cannot tell who is who.”\n\nAli questioned the reason behind the strike. “I don’t know why they were targeted. Why would they target my brother? There’s no reason, unless it was because his wife is a doctor.”\n\nThe health ministry reported on Sunday that at least 54,418 Palestinians have been killed in ongoing Israeli attacks across the blockaded Strip.\n\nAccording to the Government Media Office inGaza, at least 1,580 of those killed since 7 October 2023 were medical personnel.\n\nEarlier this year, the UNwarnedthat a \"pattern\" of destruction of Gaza's hospitals by Israeli forces has pushed its healthcare system to the \"point of almost complete collapse\".\n\nSince the report was published, the Israeli military has repeatedly targeted healthcare professionals, civil defence teams, aid workers and even patients.\n\nThe latest instance of Israeli aggression on healthcare came on Sunday when the Noura al-Kaabi Kidney Dialysis Centre in the northern Gaza Strip was bombed.\n\nThe Palestinian health ministry warned that the destruction of the centre poses a \"catastrophic threat to the health of kidney patients, the consequences of which are unpredictable\".\n\n\"The occupation is working according to a dangerous methodology to empty the northern Gaza Strip of hospitals and specialised care centres,\" it added in a statement.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "'Hypocrisy': Zadie Smith faces backlash after signing letter calling for Gaza ceasefire",
    "url": "https://www.middleeasteye.net/trending/hypocrisy-zadie-smith-faces-backlash-after-signing-letter-ceasefire-calling-gaza-ceasefire",
    "published": null,
    "content": "On Wednesday, a total of 380 writers and organisations signed alettercondemning the Israeli government’s actions in Gaza as “genocidal” and urged for an immediate ceasefire.\n\nAmong the signers were Zadie Smith, Ian McEwan, Russell T Davies, Hanif Kureishi, Frank Cottrell-Boyce, and George Monbiot.\n\nThe letter states that describing the situation in Gaza as \"genocide\" or involving \"acts of genocide\" is no longer a matter of debate among international legal experts or human rights groups. It was also signed by notable authors and figures such as William Dalrymple, Jeanette Winterson, Brian Eno, Kate Mosse, Irvine Welsh, and Elif Shafak.\n\nThis letter coincided with anotherletterpublished on Thursday to the UK government by 300 British artists, doctors, activists and academics, who urged British Prime Minister Keir Starmer to end UK complicity in Gaza war crimes and help broker an immediate and permanent ceasefire.\n\nSinger-songwriter Dua Lipa, actors Benedict Cumberbatch, Brian Cox, Toby Jones, Andrea Riseborough, and broadcaster Gary Lineker are among the signatories of this letter.\n\nSome of the letter's signatories, like Lineker and Cox, for instance, have been vocal about the war for months, but many others have remained silent.\n\nWhile many on social media cheered on these letters and supported the calls for a ceasefire by such prominent names, many said the letter was a little too late.\n\nWe reject these letters. The time has passed for these letters to have any legitimacy. These letters are now used to whitewash the silence and worse whitewash the active complicity of authors like@ZadieSmithin the genocide of the Palestinian people.https://t.co/tqouO4zZXD\n\nSpecifically regarding the letter signed by Smith and other authors, many social media usersexpressed anger due to her previous comments about Israel and Palestine in a 4 May 2024 New Yorkerarticle.\n\nIn this article, while talking about Israel’s war on Gaza and the crackdown on pro-Palestinian students on western campuses, Smith wrote, “In the case of Israel/Palestine, language and rhetoric are and always have been weapons of mass destruction.”\n\nAt the time, many on social media harshlycriticisedthese statements, saying that Smith compared the language of the students protesting in support of Palestine to weapons of mass destruction.\n\nToday, when the letter by Smith and other prominent authors came out, the same anger resurfaced, with many showing their resentment towards the author.\n\nZadie Smith signed an open letter calling Israel's actions in Gaza genocide. When tens of thousands of Palestinians had already been killed, she was calling for \"nuance.\" Now, she's trying to save her reputation. I threw all her books in the bin and will never buy another.\n\nMany suggested that Smith helped “manufacture consent for criminalising Palestine solidarity campus protests” with that New Yorker article, but now is only trying to “save her career”.\n\nZadie Smith helped manufacture consent for criminalizing Palestine solidarity campus protests by calling protest slogans \"weapons of mass destruction,\" and now she wants to subscribe to the letter calling it a genocide. Girl, fuck all the way off\n\nMany social media users said that Smith is only “trying to rewrite her culpability” because of the discourse she used in the New Yorker article, criminalising students and having a reductive stance on Israel’s war on Gaza.\n\nGod give me the strength to handle repulsive pro-genocide people trying to rewrite their culpability. The day started with Zadie \"I know I said protesting genocide is evil but now it wins Pulitzers so I changed my mind\" Smith and now this absurdity.https://t.co/mixyME7b5J\n\nIn the face of such letters, many social media users also referred to what they termed as “hypocrisy” and “two-siding” Israel’s war on Gaza, which until now has killed over 54,000 people since October 2023.\n\nWorth revisiting this Radar now that Zadie Smith has come around a year later. I'm glad she's signed the pro-Palestine letter. I just wish it didn't take over year and a half of obvious genocide for her to stop both sidesing the issue.https://t.co/QzJmztH70m\n\nSince Israel’s war on Gaza started, many prominent artists have repeatedlycalledfor a ceasefire and a stop to the war on the enclave.\n\nThese letters are the latest examples of such calls, and they have garnered more reaction and support because they include prominent figures from the film and literary worlds.\n\nArtists have also faced censorship and criticism from pro-Israeli supporters due to their advocacy for Palestine.\n\nOne example of this was when over 750 artists signed alettercriticising the Royal Academy of Arts for “anti-Palestinian censorship” after it removed two artworks about Israel’s war on Gaza from its Young Artists’ Summer Show.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Why I support the UK taking a more nuanced position on Hamas",
    "url": "https://www.middleeasteye.net/opinion/why-i-support-uk-taking-more-nuanced-position-hamas",
    "published": null,
    "content": "The reputation of Hamas sank to its lowest point after its attack on 7 October 2023, in which1,200 Israelisand foreigners were killed and251 taken hostage.\n\nInIsrael, this attack provoked a tsunami of anger, strident calls for revenge, demands for the ethnic cleansing of Gaza, and a national consensus in support of the total eradication of Hamas. The result has been the longest, deadliest and most ruinous war in the history of the Arab-Israeli conflict.\n\nHamas is a social movement and political organisation with a military wing,al-Qassam Brigades. The military wing was proscribed by theBritishgovernment as a terrorist organisation in March 2001, and in November 2021, former Home Secretary Priti Pateladded the political organisationto the list of proscribed groups.\n\nThis decision marked an abrupt reversal of the government’s previous policy, which made a clear distinction between Hamas’s political and military wings.\n\nPatel, a staunchsupporter of Israel, argued, unconvincingly in my opinion, that the distinction between the two wings was no longer tenable. For its part, Israel has always denied that there is any difference between the two wings.\n\nIn August 2017, as secretary of state for international development, Patelwent on a tripto Israel accompanied by Lord Polak, honorary president of Conservative Friends of Israel (CFI) and a major fund-raiser for the Tory party. She had previously served as an officer for CFI’s parliamentary group between2011 and 2014.\n\nWhile pretending to be on a private holiday, Patel held12 secret meetingswith high-ranking Israeli officials, including Prime Minister Benjamin Netanyahu.\n\nUpon her return, she asked her officials toexplore the possibilityof diverting some of the foreign aid budget to enable the Israeli army to carry out humanitarian work in the occupied Golan Heights. She was subsequentlyforced to resignfor concealing the nature and purpose of her trip to Israel.\n\nIn 2019, then-Prime Minister Boris Johnson rehabilitated Patel by appointing her ashome secretary. Johnson shared her Manichean view of the Middle East struggle, in which Israel represents the forces of light andPalestiniansthe forces of darkness.\n\nThe change of policy towards Hamas was announced not by the foreign secretary, but by the home secretary. Patel said that designating the whole of Hamas as a terrorist organisation should be seen through a domestic prism: it would help toprotect Jewsin this country.\n\nThis argument is baseless. Hamas does not carry out operations outside Israel and the occupied Palestinian territories, it has no presence in Britain, and it poses no threat to British Jews in this country.\n\nFollow Middle East Eye's live coverage of the Israel-Palestine war\n\nHamas’s 2017 “Document of General Principles and Policies” (unlike the 1988 Hamas Charter)explicitly distinguishesbetween Judaism as a religion and Zionism as a political project. It affirms that Hamas’s conflict with Israel is due tooccupation, not religion, and states that it would accept the creation of a Palestinian state within the 1967 borders without recognising Israel.\n\nHamas has now instructed Riverway, a London law firm, tomake an applicationto the home secretary to remove the government’s designation of the movement as a proscribed terror group and recognise its legitimate role as a Palestinian resistance movement engaged in a struggle for self-determination and liberation.\n\nThe application is made byMousa Abu Marzouk, the former head of Hamas’s political bureau. I am among 19 experts supporting this legal filing through reports on the history and context of Palestinian dispossession. My report describes the central role played by Britain in facilitating this dispossession, from theBalfour Declarationof 1917 up until the present.\n\nWestern media outlets have relied heavily on the Israeli narrative of 7October,includingits countless false allegations and outright fabrications, such as the story of 40 decapitated babies, while under-reporting the Palestinian side of the story.\n\nOne of Abu Marzouk’s most significant correctives to the dominant narrative concerns the background to the Hamas-led 7 October attack. According to him, Hamas sought to achieve specific military objectivesduring the operation, with clear instructions not to target women, children and the elderly.\n\nSince deviations from these instructions admittedly occurred, Hamas isprepared to cooperatewith the International Criminal Court and any other neutral third party in an independent and transparent investigation into the events of that day. This position stands in sharp contrast to Israel’s denial of journalists’ entry into Gaza, and its refusal to allow any independent investigation of the atrocities and war crimes committed by its forces.\n\nTo explain Hamas’s behaviour is not to justify it. Killing civilians is wrong, period. But here, as always, the context is all-important. The attack of 7 October did not occur in a vacuum. It occurred against the backdrop of decades of brutal and suffocating military occupation. Moreover, as a people living under unlawful military occupation, Palestinians have a right to resist, including the right to armed resistance.\n\nIn effect, labelling Hamas’s political leaders as terrorists pure and simple gives Israel a free pass to inflict death and destruction on Gaza without being held to account. The terrorist framing also stands in the way of a more balanced and nuanced understanding of the history, motives, policies and principles of Hamas.\n\nThe Hamas side of the story is hardly ever heard in the West, yet it makes a compelling reason for removing its political wing from the list of proscribed organisations.\n\nHere are some of the most relevant facts: in January 2006, Hamaswon a clear victoryin fair and free all-Palestine elections, and proceeded to form a government. Israel refused to recognise this government and resorted to a series of draconian measures to undermine it, supported by theUnited Statesand European Union.\n\nIn March 2007, Hamas formed aunity governmentwith its rival party Fatah, but Israel refused to negotiate with them. Instead, Israel and the US encouraged Fatah to stage a coup todrive Hamas out of power. Hamas pre-empted the Fatah coup by seizing power in Gaza, which led to Israel imposing a blockade on the enclave - a form of collective punishment proscribed by international law - which remained in force for 16 years before the Hamas attack on 7 October.\n\nThe home secretary would do well to read the 700 pages of evidence that underpin this application for deproscription before making up her mind\n\nThe distinction between the political and military wings of Hamas has always been crucial. Patel’s decision to proscribe Hamas in its entirety was a politically motivated move that disregarded Hamas’s democratic road to power and its growing politicalmoderationonce in power.\n\nCasting the whole of Hamas as a terrorist organisation also served to bolster Israel’s hardline position, its refusal to negotiate, and its reliance on brute military force. Proscription by Britain and other western powers in effect endorsed Israel’s refusal to put Hamas’s willingness to compromise to the test.\n\nIsrael’s recurrent military offensives in Gaza since 2008 are chillingly described by its generals as “mowing the lawn”. Under this grim rubric, the next war is always just around the corner. In the post-7-October military offensive, Israel has gone much, much further than ever before, committing the crime of crimes: genocide.\n\nAs Abu Marzouk points out in his witnessstatement, Britain is not an innocent bystander in the genocide that is unfolding before our eyes in Gaza. The Israeli-Palestinian conflict was made in Britain. Britain was the colonial power that enabled the Zionist settler-colonial movement to embark on the systematic takeover of Palestine.\n\nThe war in Gaza is the latest and cruellest phase in this long-term colonial effort to displace, dispossess and ethnically cleanse the Palestinian people. Hamas is a vital segment of Palestinian society and the vanguard of its resistance to Israel’s illegal occupation.\n\nDeproscribing the political wing of Hamas would constitute a small step towards rectifying a monumental historical wrong. The home secretary would do well to read the 700 pages of evidence that underpin this application for deproscription before making up her mind.\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Eye.The purpose of this article is to set out the author’s reasons for supporting Abu Marzouk’s application. Nothing in this article should be understood as inviting or otherwise encouraging readers to support, or express support for, Harakat al-Muqawamah al-Islamiyyah (Hamas).\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Brazilian oil trade unions urge Lula to impose energy embargo on Israel",
    "url": "https://www.middleeasteye.net/news/brazilian-oil-trade-unions-urge-government-impose-oil-embargo-israel",
    "published": null,
    "content": "Two of the largest federations of trade unions for oil workers in Brazil have called on the government to impose an energy embargo onIsrael.\n\nThe National Federation of Oil Workers and the Single Federation of Oil Workers sent a joint letter to President Luiz Inacio Lula da Silva and key ministers in the Brazilian government on Wednesday, urging them to take more concrete action against Israel’s “genocide” inGaza.\n\nReferring to comments made by Lula in February, the federations said that Brazil needs to go beyond public rhetoric and implement an energy embargo against Israel in accordance with its international legal obligations to prevent the “ongoing Nakba” - meaning ‘catastrophe’ in Arabic and referring to the mass displacement and dispossession of Palestinians in 1948 when Israel was created.\n\nIn February, President Lula, while he was attending the African Union Summit in Ethiopia, accused Israel of committing “genocide” against Palestinians in Gaza and compared itswar on Gazawith Nazi Germany’s extermination of Jews.\n\nThe letter highlighted that 2.7m barrels of crude oil were exported from Brazil to Israel in 2024 alone, representing a significant portion of Israel's military fuel supply, and Brazil had a global responsibility to avoid complicity in war crimes, as articulated by legal experts and international judicial bodies.\n\nThe letter cited action taken by other countries, such as Colombia’s suspension of coal exports to Israel, and global grassroots campaigns such as #BlockTheBoat, where dockworkers around the world have refused to load Israeli ships and cargo and transport arms to Israel.\n\nIn the United States,Block the Boatwas organised by theArab Resource and Organizing Centerin San Francisco.\n\nIn addition to the immediate suspension of oil exports to Israel, the federations urge the Brazilian government to suspend projects with Israeli energy companies, and support United Nations-led sanctions and measures to hold Israel to account.\n\nSignatories said this was an opportunity for Brazil to “honour its diplomatic legacy, affirm its position on the right side of history, and ensure that its economic policies reflect its ethical and legal commitments to human rights and international law\".\n\nThe Single Federation of Oil Workers is a national trade union, while the National Federation of Oil Workers is a trade union federation comprised of independently operating oil workers' unions.\n\nLula has been a longtime supporter of Palestine.\n\nHis commentto reporterson 17 February in Ethiopia sparked a diplomatic backlash when he said that Israel’s actions in Gaza were not a war, \"It's a genocide\".\n\n'What's happening in the Gaza Strip with the Palestinian people hasn't happened at any other moment in history. Actually, it has happened: when Hitler decided to kill the Jews'\n\n-Luiz Inacio Lula da Silva, Brazilian president\n\n\"It's not a war of soldiers against soldiers. It's a war between a highly prepared army, and women and children,\" he said.\n\n\"What's happening in the Gaza Strip with the Palestinian people hasn't happened at any other moment in history. Actually, it has happened: when Hitler decided to kill the Jews.\"\n\nIsraeli Prime Minister Benjamin Netanyahu said Lula’s Nazi Germany comparison was “disgraceful and grave”, while Foreign Minister Israel Katz said that Lula would be “a persona non grata in Israel” until he took back his comments.\n\nLula refused to take back his comments and recalled Brazil’s ambassador from Israel.\n\nReutersreportedthat his approval ratings fell from 54 percent to 51 percent after his comments.\n\nLula also backed South Africa’s International Court of Justice case against Israel in January, which ruled that a “plausible genocide” was happening in Gaza.\n\nAn official statement highlighted Lula’s role in the decision: “The president expressed his support for South Africa’s initiative to bring Israel before the ICJ to determine that Israel immediately ceases all acts and measures that may constitute genocide or related crimes under the Convention on the Prevention and Punishment of the Crime of Genocide.”\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Israel blocks Arab ministers from occupied West Bank visit",
    "url": "https://www.middleeasteye.net/news/arab-ministers-condemn-israeli-move-block-west-bank-visit",
    "published": null,
    "content": "A delegation of Arab foreign ministers has condemnedIsrael’s decision to block their planned visit to the occupied West Bank.\n\nThe delegation - including ministers fromSaudi Arabia,Egypt,JordanandBahrain- was scheduled to meetPalestinianPresident Mahmoud Abbas in Ramallah on Sunday.\n\nHowever, the visit was postponed after Israeli authorities warned late Friday that they would deny the ministers entry, according to the Jordanian foreign ministry.\n\nAs the occupying power controlling the West Bank's border with Jordan, Israel's approval was required for the delegation to travel.\n\nIn a joint statement, the ministers denounced the move as a “violation of Israel’s obligations as an occupying power” and said it reflected “the arrogance of the Israeli government, its disregard for international law, and its ongoing illegitimate policies\".\n\nThe Palestinian ambassador to Saudi Arabia told local media the visit was meant to underscore the importance of the Palestinian cause to Arabs and Muslims.\n\nAn Israeli official, speaking to the Ynet news outlet, described the planned meeting as a “provocative” attempt to promote the establishment of a Palestinian state.\n\n“Such a state would undoubtedly become a terrorist state in the heart of the land of Israel,” the official claimed. “Israel will not cooperate with efforts that threaten its security.”\n\nSaudi Arabian Foreign MinisterFaisal bin Farhan,who was set to lead the delegation, would have been the highest-ranking Saudi official to visit the occupied West Bank in nearly 60 years.\n\nThe incident comes as Israel faces mounting international pressure to support a two-state solution, backed by the United Nations and several European governments.\n\nIn June, Saudi Arabia and France are set to co-chair an international conference in New York to discuss the future of Palestinian statehood.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Saudi top diplomat to make rare trip to occupied West Bank",
    "url": "https://www.middleeasteye.net/news/saudi-top-diplomat-make-rare-trip-occupied-west-bank",
    "published": null,
    "content": "Saudi Arabian Foreign Minister Faisal bin Farhan will visit the occupied West Bank this weekend, making him the highest rankingSaudiofficial to visit in almost 60 years, the Palestinian Authority (PA) revealed on Friday.\n\nBin Farhan will lead a ministerial delegation comprised of his counterparts inJordan,Egypt, and other Arab nations, the Palestinian ambassador to Saudi Arabia told local media, adding that the trip is intended to convey the centrality of the Palestinian cause to Arabs and Muslims.\n\nThe move appears similar to the trip bin Farhan organised to Washington in the early months ofIsrael's war on Gaza, in a bid to showcase a united Arab front in support of a ceasefire.\n\nIt also appears to be an attempt at lending credibility to the PA as an alternative to Hamas in Gaza, despite the PA's plummeting popularity among Palestinians.\n\nThe trip is rare and unusual, given that the last time a Saudi official visited Ramallah, he had been appointed a non-resident ambassador to Palestine.\n\nNayef al-Sudairi arrived just weeks before the 7 October 2023 Hamas-led attacks on southern Israel, and before him, King Faisal had visited in 1966.\n\nThose attacks were intended to and indeed derailed Saudi-Israeli normalisation talks, Hamas officials revealed over the course of the war.\n\nWith the kingdom being the de facto leader of the Arab world, it can set an agenda with the kind of influence few of its neighbours possess - and normalising with Israel would have likely dashed ambitions for Palestinian statehood.\n\nThe Times of Israel reported on Friday evening that Israel would block Farhan and his delegation's visit. Israel has control of the occupied West Bank's land border with Jordan.\n\nIf Israel follows through on the threat, it could further strain relations with Riyadh and other regional countries.\n\nSince 2023, Saudi Arabia has made it clear that normalisation would only be pursued with a clear pathway to a Palestinian state.\n\nEarlier this year, Saudi Crown Prince Mohammed bin Salman called Israel's now 19-month-long war on Gaza a \"genocide\", echoing assessments by the United Nations and countless rights organisations, among other leading historians and experts.\n\nMore than 54,000 Palestinians have been killed so far, with some experts believing the figure to be a significant undercount.\n\nNext month, a meeting in New York co-chaired by Saudi Arabia and France is expected to outline the necessity of establishing a Palestinian state, and rebuild support for the concept of the two-state solution, a plan outlined in the 1993 Oslo Accords.\n\nSeveral European nations have recently recognised the state of Palestine, including Ireland, Spain, and Norway.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "UK: Cambridge students relaunch pro-Palestine encampment",
    "url": "https://www.middleeasteye.net/news/uk-cambridge-students-relaunch-pro-palestine-encampment",
    "published": null,
    "content": "Students at theUK’s University of Cambridge haverelauncheda protest encampment outside Trinity College, one of its largest and wealthiest colleges, calling on the institution to disclose and divest from companies complicit inIsrael’s war on Gaza.\n\nThe group behind the protest, Cambridge for Palestine (C4P), is demanding the University “take urgent steps” to end what it calls its “moral and material complicity in Israel’s genocide ofPalestinians.”\n\nC4P says Trinity College holds investments in companies such as Elbit Systems, Caterpillar, L3Harris Technologies, and Barclays - despite the university's previous commitment to review its “responsible investment” policy following a similar months-long encampment last year.\n\nIn a statement, C4P said the renewed protest came after “months of student, faculty, and community frustration” over the University’s failure to honour those pledges.\n\nThe group outlined four core demands, including full disclosure of financial ties to companies implicated in Israeli violations of international law, full divestment from them, and reinvestment in Palestinian communities.\n\nThis includes support for Palestinian students and academics at Cambridge, rebuilding higher education institutions in Gaza, and forming partnerships with Palestinian universities.\n\nC4P also demanded the need for the university to \"protect the academic freedoms and safety of all University of Cambridge affiliates,\" as well as reversing \"targeted anti-protest policies that restrict pro-Palestine speech\".\n\nIn March, the University wasgranteda High Court order barring pro-Palestine actions from three locations on its campus until the end of July 2025 - a reduced version of its original bid to secure a five-year ban on 27 February, which was rejected in court.\n\n\"This is the first major action on Cambridge's campus after the university enacted repressive measures to criminalise protest for Palestine,\" a student camper, who wished to remain anonymous for security reasons, told Middle East Eye.\n\n\"We know that our acts of protest come with risks of further repression and targeting, yet the escalation of genocide demands our action. There are no universities left in Gaza. We will not deterred when our university funds mass murder.\"\n\n'So long as Cambridge and its colleges remain backers of the Zionist project, we will continue to return'\n\n- C4P representative\n\nCambridge University is made up of 31 self-governing colleges which operate autonomously, including in their financial investments. Many of them have faced protests over their investments since the launch of Israel's war on Gaza in October 2023.\n\nOn 20 May,King's Collegeannounced it would divest millions from the arms industry and companies complicitin \"the occupation of Ukraine andPalestinianterritories,\" becoming the first Oxford or Cambridge college to take such measures.\n\n\"Cambridge for Palestine is here to show the University that we are back,\" C4P representative said in a statement.\n\n\"So long as Cambridge and its colleges remain backers of the Zionist project, we will continue to return and disrupt the University's violence shrouded in so-called normalcy.\"\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "War on Gaza: The world is turning, but Israel has yet to reckon with its crimes",
    "url": "https://www.middleeasteye.net/opinion/war-gaza-world-turning-point-israel-yet-reckon-crimes",
    "published": null,
    "content": "As the father of a four-year-old daughter and a newborn baby, as I watch the international response to thegenocide in Gaza, I cannot help but wonder: at what age will my children cease to be considered children, and their lives be deemed less important?\n\nThe world is shocked at the number of children being killed andstarved in Gaza, but there remains no substantive critique of whatIsraelhas done over these past 19 months to allPalestiniansin Gaza. The threshold of demands has been lowered to merely alleviating the humanitarian crisis.\n\nIsrael has succeeded in destroying Gaza’s infrastructure, healthcare system, municipalities, education networks, families, mosques and churches - in short, every framework that organised human life.\n\nBut now, having exhausted its “target bank” and with nothing left to bomb, Israel is striking refugee tent camps andburning people alive. Such cruelty, along with the passage of time and mounting international pressure, have led to a turning point, both globally and within Israeli society.\n\nDespite the support provided to Israel by two successiveUSpresidents and the consensus among Democrats and Republicans alike to give Israel a free hand, Prime Minister Benjamin Netanyahu has failed to defeat Hamas or secure the release of the remaining hostages.\n\nAcross the spectrum, Israel’s political establishment adopted a revenge narrative from day one, priming the Israeli public to be complicit in its forthcoming crimes.\n\nIsrael’s failure was not its inability to free the hostages or disarm Hamas. As early asNovember 2023, Israel could have reached a deal to free all the hostages, while various proposals have been advanced to settle the conflict, including bringing in other entities, such as the Palestinian Authority, to govern Gaza.\n\nBut Israel’s real objective is clear: to empty Gaza of its population. As Finance MinisterBezalel Smotrich’s recent statements candidly reveal, the true aim of the war is to conquer Gaza, expel its Palestinian residents, and occupy the territory. This was the original intention all along.\n\nThis has resulted in two strategic failures for Israel. Firstly, it has failed to compelEgyptandJordanto participate in this scheme and accept Palestinian refugees.\n\nIsrael’s second failure is moral. The government and Israeli society itself have normalised a narrative of genocide and ethnic cleansing, defending this stance with euphemisms like “voluntary migration” and “encouraging relocation”.\n\nFollow Middle East Eye's live coverage of the Israel-Palestine war\n\nNow, with the intensification ofinternational criticism, cracks have begun to appear in the Israeli consensus. The insistence of thousands of activists and media figures worldwide - Palestinian and non-Palestinian alike - to continue speaking out on Gaza has generated sufficient pressure to make an impact.\n\nThis initially affected Israeli tourists, who discovered that most people around the world view genocide as an unforgivable atrocity, prompting Israel’s foreign ministry to remind Israelis tosuppress national symbolsabroad, fuelling a silent boycott of Israeli academics and cultural figures.\n\nThe West will scavenge for Israeli movements and leaders who speak out against the war, without offering a genuine moral alternative\n\nWe are now seeing a shift in the tone of western foreign policies - late, but significant. The US administration’s decision to hold direct negotiations with Hamas to secure the release of dual citizenEdan Alexanderreinforced the feeling among Israelis that their government is not genuinely interested in advancing a hostage deal.\n\nConversely, the US has grown weary of Israel, as evidenced by President Donald Trump’s Middle East tourskipping over Israel.\n\nThe shift in Israel’s global standing was further evidenced by a recent Financial Timeseditorialtitled “The West’s shameful silence on Gaza”, as European threats to suspend trade agreements have begun to bite.\n\nFrench President Emmanual Macron has shifted his tone toward overt criticism, saying this week that European nations must “harden the collective position” against Israel over Gaza’s worsening humanitarian crisis. Even Germany's new chancellor said Berlin would not export weapons used to break humanitarian law, in a break from 19 months of loyal support for Israel's war.\n\nWithin Israel itself, one of the most striking signs of fracture came in a recent statement from Yair Golan, leader of the Democrats party,who declared: “A sane country does not fight against civilians, does not kill babies as a hobby, and does not give itself the aim of expelling populations.”\n\nGolan, a former deputy militarychief of staff, wasdisciplinedtwo decades ago for employing the banned “neighbour procedure” in field operations, a method in which civilians are used to persuade their neighbours to surrender to the army.\n\nThis context suggests that Golan is no ethical pacifist. Rather, like many former Israeli generals, he realises that Israel is on its way to becoming a pariah state, incapable of surviving in the Middle East without western support.\n\nIndeed, many Israelis who were once fervent supporters of the war now frame the Gaza genocide as a political gambit for Netanyahu’s survival. Yet this was a war many in Israeli society wanted andsupported, including Golan himself.\n\nToday, public discourse in Israel oscillates between those who wish to continue the genocide, and those who are worried about the repercussions. This fracture is a byproduct of Israel’s failure to ethnically cleanse Gaza, and the fact that it will have to face armed resistance for many years to come.\n\nAmid this backdrop, Netanyahu’s far-right coalition partners speak of returning settlements to Gaza, a move that would place Israel squarely on the blacklist of pariah states.\n\nSadly, neither Golan nor others in Israel’s political and civil spheres - not even those who oppose the war - are prepared to admit that the state has carried out a genocide. But still, the public backlash against Golan’s remarks took its toll: days later, in atelevised interview, he declared that Israel “has not committed war crimes in Gaza”.\n\nDuring a visit to the southern city of Beersheba on Tuesday, angry Zionist crowdsheckled and booedGolan, who - despite retracting his earlier statements - is now being portrayed around the world as a supposed alternative to Netanyahu, even though he offers no real alternative.\n\nRegrettably, this is likely to be the future: the West will scavenge for Israeli movements and leaders who speak out against the war, without offering a genuine moral alternative. Similar to the periods after the First and Second Intifadas, millions of dollars will flow into Israel’s “peace industry”, which will talk about Arabs and Jews living together, without confronting the essential political questions that brought us to this reality.\n\nIn the meantime, we must support every statement and initiative that contributes to ending the war - because what matters now is Gaza, and not only the children of Gaza, but also the youths, the women, the men and the elderly.\n\nTo prevent further disaster, we must demand more from Israelis, including a real acknowledgment of their actions over the past 600 days.\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Eye.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Hamas is studying another US ceasefire proposal for Gaza. What has changed?",
    "url": "https://www.middleeasteye.net/news/hamas-studying-another-us-ceasefire-proposal-gaza-what-has-changed",
    "published": null,
    "content": "Hamas said on Thursday it was studying aGazaceasefire proposal byUSenvoy Steve Witkoff, which Israel announced it had accepted, as starvation stalks the enclave andIsraelramps up its air strikes.\n\n\"The leadership of the Hamas movement has received Witkoff's new proposal from the mediators and is currently studying it responsibly, in a manner that serves the interests of our people, provides relief, and achieves a permanent ceasefire in the Gaza Strip,” Hamas said.\n\nWitkoff sounded an optimistic note speaking at the White House on Wednesday, saying, “I have some very good feelings about getting to… a temporary ceasefire and a long-term, peaceful resolution of that conflict.”\n\nUS President Donald Trump on Thursday confirmed that Prime Minister Benjamin Netanyahu had accepted a new ceasefire proposal from Witkoff, but added that Hamas had not yet accepted.\n\nHowever, reports that Israel and Hamas were nearing an agreement have occurred regularly throughout the 18 months of war, only to wither a few days later.\n\nHamas and Israel reached a brief three-stage ceasefire in January, but the dealcollapsedin March after Israel took back several of its captives and resumed bombing Gaza, walking away from the deal before talks with Hamas on a permanent end to the war could start.\n\nWhile the Trump administration has broken with Israel on bombing the Houthis, negotiating a nuclear deal with Iran, and lifting sanctions onSyria, it has given Israel full backing to wage war on Gaza.\n\nAccording to Axios, the latest Witkoff proposal is similar to the one Israel broke in March.\n\nIt calls for the release of captives in return for 60 days of no fighting.\n\nThe deal would set a timeline for Hamas and Israel to begin negotiating a permanent end to the war and withdrawal of Israeli troops.\n\nSeveral factors have changed since then, but it's unclear how they might impact the talks.\n\nIn May, the Trump administration began to rely on a new intermediary with Hamas, Palestinian-American businessman Bishara Bahbah.\n\nThe national chairman for Arab Americans for Trump established a backchannel for Hamas directly to the Trump administration that led to the release of US-Israeli citizen Edan Alexander from captivity earlier this month.\n\nDespite the new diplomatic shake-up, the main roadblock to a deal has not changed.\n\nHamas wants a guarantee that, in return for returning the 20 captives believed to be alive, Israel will agree to a permanent end to the war.\n\nIsraeli media reported on Thursday that Netanyahu was prepared to move forward with a temporary truce.\n\nNetanyahu has regularly insisted on the right to resume fighting and has pledged to totally disarm and eliminate Hamas.\n\nSpeaking in May, Netanyahu said for the first time that one of his conditions for ending the war was the right to enact aplanfloated earlier this year by Trump, which called for the forcible displacement of Palestinians from Gaza.\n\nIsrael did withdraw from some points in Gaza in January and February, but it has established the Netzarim Corridor to deploy troops from east to west of Gaza quickly.\n\nHamas is unlikely to forget that Israel quickly reoccupied the enclave in March with little public pressure not to from the US, orEgyptandQatar, the two Arab mediators.\n\nIsrael's military said on Monday it wants to control 75 percent of Gaza and force roughly two million Palestinians there into a narrow zone in the south near the Egyptian border.\n\nThere was some confusion on Monday after media reports said that Hamas had agreed to a 60-day ceasefire proposed by Witkoff, only for Israel to deny the offer was on the table.\n\nTalks are ongoing as Gaza descends into anarchy and starvation. Israel has been blockading the entry of all food, water, and medicine into the enclave until recently.\n\nThe US and Israel established a controversial organisation in May dubbed the Gaza Humanitarian Foundation to distribute aid. Its aid centre in Rafah, staffed by American mercenaries, was overrun with thousands of starving Palestinians.\n\nThe Israeli military opened fire on the crowd, and images on social media showed Palestinians boxed into narrow fences to obtain aid.\n\nThe foundation has been slammed by the UN and other aid groups for militarising aid. On Wednesday, four Palestinians died storming a UN warehouse in search of food.\n\nAt least 44 Palestinians were killed by Israeli strikes across Gaza on Thursday. The total death toll since the war began in October 2023 has surpassed 54,000.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Hamas accepts Witkoff truce outline with amendments aimed at ending war",
    "url": "https://www.middleeasteye.net/news/exclusive-hamas-seeks-changes-us-backed-gaza-ceasefire-proposal",
    "published": null,
    "content": "Hamas has agreed to the outline of a ceasefire deal drafted by US envoy Steve Witkoff, with amendments that include guarantees it would lead to negotiations aimed at permanently ending theIsraeli war on Gaza, Middle East Eye has learnt.\n\nThe 13-point outline with Hamas's changes, obtained by MEE through informedPalestiniansources, details terms the group has conditionally accepted.\n\nThese include a 60-day ceasefire, with US President Donald Trump proposed as guarantor ofIsrael’s compliance.\n\nAs part of the agreement, Hamas has agreed to release 10 living Israeli captives and the remains of 18 others, in exchange for a number of Palestinian prisoners to be agreed upon.\n\nHowever, the group proposed that the releases be carried out in phases: four living captives would be freed on day one, two on day 30, and the final four on day 60. The remains of Israeli captives would also be returned in stages - six on day 10, another six on day 30, and the final six on day 50.\n\nHamas has also called for Israeli forces to withdraw to the positions they held prior to 2 March 2025.\n\nA Palestinian source close to the negotiations criticised Witkoff for pushing an initial draft that lacked clarity and firm guarantees, telling MEE it reflects “ill intention” and warning that it could cause the fragile talks to collapse.\n\nSpeaking on condition of anonymity, the source said: “Witkoff’s insistence on releasing all the captives in the first week shows ill intention. Based on previous experience, the Israelis will simply return to full-scale war and sabotage the rest of the agreement.”\n\n'Hamas feels Witkoff betrayed them twice'\n\n- Palestinian source\n\nHe accused the United States of focusing solely on the release of Israeli captives, while ignoring the continued killing of thousands of Palestinians and the spread of famine in Gaza.\n\n“Hamas feels Witkoff betrayed them twice,” the source said.\n\n“First, when Israel violated the US-guaranteed deal on 2 March by imposing an embargo on aid and then resuming full-scale war on 18 March - with the full support and cover of Witkoff and the US administration.\n\n“And second, when Hamas released an American-Israeli soldier, Edan Alexander, in good faith, expecting humanitarian relief and a shift in the negotiating approach - which clearly did not happen.”\n\nDuring the ceasefire talks, Israeli Prime Minister Benjamin Netanyahu reportedly demanded that all 10 living captives and the 18 bodies be released in the first week - a condition Palestinian negotiators rejected over concerns Israel would resume its military campaign immediately afterward.\n\nWhile Hamas is demanding an Israeli military withdrawal to positions held before 2 March - short of a full withdrawal from the Gaza Strip - the Palestinian source said Witkoff has failed to clarify exactly where Israeli forces would redeploy in his draft.\n\n“What guarantees do the Palestinians have for an end to the war? Witkoff and the Israelis are not demonstrating any intention ...to bring the conflict to a close'\n\n- Palestinian source\n\n“Withdrawal to where? Witkoff has been vague about this as well,” the source told MEE.\n\nThe source also expressed concern about the lack of transparency regarding the proposed humanitarian aid mechanism, describing the overall framework as offering no viable path to ending the war.\n\n“What guarantees do the Palestinians have for an end to the war? Witkoff and the Israelis are not demonstrating any intention - or offering a path - to bring the conflict to a close.”\n\nAccording to the source, earlier in the negotiations, Palestinian-American mediator Bishara Bahbah, who is working for the Trump administration, had reached a preliminary understanding with Hamas. The deal had initially been approved by Witkoff.\n\nHowever, following meetings with Israeli minister Ron Dermer and Netanyahu, Witkoff reportedly reversed his position and withdrew support for the agreement.\n\nAccording to theAxiosnews outlet, Witkoff’s ceasefire proposal was “fully coordinated with Israel and was a result of his meeting with Netanyahu’s confidant Ron Dermer” earlier this week.\n\nAxios also reported that Hamas pushed for language stipulating that if a permanent ceasefire deal is not reached within 60 days, the temporary truce would automatically be extended indefinitely.\n\nEarlier this week, Drop Site News reported that Witkoff’s latest proposal was drafted in coordination with Netanyahu and explicitly avoids guaranteeing an end to Israel’s war on Gaza.\n\nPalestinian negotiators have largely agreed to ceasefire terms set out in a deal signed on 17 January, which was violated by Israel on 18 March when it resumed its military campaign.\n\nIn the revised document submitted by Hamas, negotiations for a permanent ceasefire would begin immediately once the temporary truce takes effect.\n\nA key clause put forward by Hamas calls for an “independent committee of technocrats” to administer Gaza’s affairs following a permanent ceasefire - a provision that would see Hamas relinquish governing authority in the Strip.\n\n\n\n\n\nHowever,reportssuggest that Witkoff and Netanyahu have sought to remove provisions that would see Hamas hand over administrative control in Gaza, raising concerns the war could resume after the 60-day period.\n\nOn Saturday, Witkoff dismissed Hamas’s amendments as “totally unacceptable and only takes us backward.” He insisted the group accept the existing framework for proximity talks scheduled to begin next week.\n\nEarlier the same day, Hamas said it welcomed Witkoff’s proposal but emphasised the need for key modifications. A Hamas official told Al Jazeera the group had already agreed to an earlier version of the proposal a week earlier, only for Witkoff to return with an altered version that, according to Hamas, omitted crucial elements.\n\n“We cannot accept such a proposal as a baseline for negotiations,” said senior Hamas official Basem Naim, citing the absence of guarantees for a 60-day ceasefire, humanitarian aid, and a full Israeli withdrawal.\n\nIn its formal response, Hamas also called for urgent humanitarian and reconstruction measures. These include immediate access to aid, coordinated through the United Nations and organisations such as the Red Crescent, in line with the agreement signed on 19 January 2025, when the first ceasefire deal was reached.\n\nDuring the negotiation phase, final plans would be developed to rebuild homes, public facilities, and critical infrastructure, alongside assistance for those affected by the war.\n\n\n\nThe group demanded the full restoration of “electricity, water, sanitation, communications, and roads,” as well as the reopening of hospitals, health centres, schools, and bakeries. Hamas also urged for unrestricted movement through the Rafah crossing with Egypt and the resumption of trade and commercial activity.\n\nIts proposal for a permanent ceasefire includes a “five-to-seven-year halt in hostilities”, to be guaranteed by the United States, Egypt, and Qatar.\n\nWhile negotiations continue, Washington would remain committed to upholding the truce and ensuring the flow of humanitarian aid, with the goal of concluding talks within 60 days.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Israel fires at Palestinian aid seekers as new north Gaza expulsion orders issued",
    "url": "https://www.middleeasteye.net/news/israel-shells-palestinians-seeking-aid-it-issues-new-expulsion-orders-north-gaza",
    "published": null,
    "content": "Israeliforces shot and wounded more than 20Palestinianson Friday as they attempted to receive aid at an US-run food distribution point in central Gaza, amid a worsening humanitarian crisis in the besieged strip.\n\nThe scenes were \"chaotic and uncoordinated\" with no effective humanitarian mechanism in place, according to the Palestinian Wafa news agency.\n\nCivilians in Gaza have been desperately seeking food supplies, as no essentials or humanitarian aid have entered the area since a complete Israeli siege began on 2 March.\n\nAccording to recent statistics published by the Gaza-based Government Media Office, at least 58 people, including 53 children, have died as a direct result of malnutrition since the start of the war.\n\nMeanwhile, a further 242 deaths were due to a lack of food and medicine, with the majority of victims being children and the elderly.\n\nIn aposton Friday, the UN agency for Palestinian refugees (Unrwa) noted that its warehouse in Amman, a three-hour drive away from Gaza, contains enough stockpiled aid to last a month for over 200,000 people.\n\nThe essentials include flour, food parcels, hygiene kits, blankets and medical supplies.\n\n\"Gaza needs aid at scale - an unhindered, uninterrupted flow of supplies must be allowed in,\" the agency said.\n\nIn an interview with MEE Live's Mathilda Mallinson, Palestinian journalist Mohammed Shehada described the Israeli aid distribution centres in Rafah as \"heavily militarised concentration camps,\" expressing widespread fear among Gaza residents.pic.twitter.com/FT2CZOUEBJ\n\nThe limited aid distributed this week has been provided by the Gaza Humanitarian Foundation (GHF), ascandal-plaguedorganisation that is a US-Israeli initiative designed to bypass the UN's infrastructure for aid delivery and distribution in the strip.\n\nSenior humanitarian officials and aid organisations have condemned the GHF, arguing that a new mechanism is unnecessary, especially with ongoing Israeli interference with aid and continued attacks on civilians waiting at distribution points\n\nAs Israel intensifies its assault on Gaza on the 602nd day of the war, further displacement orders have been issued.\n\nAvichay Adraee, the Arabic-speaking spokesperson for the Israeli army, called on Palestinians residing in the areas of Al-Atatra, Jabalia Al-Balad, Shujaiya, Al-Daraj and Al-Zeitoun, located in the north of the Gaza Strip, to flee westward.\n\n\"From this moment on, the mentioned areas will be considered dangerous combat zones,\" the post read, adding that the military is expanding its operations in the region.\n\nAt least 28 Palestinians were killed across the Gaza Strip on Friday morning, following the latest round of Israeli offensives. The death toll is expected to rise as operations intensify.\n\nThe International Organisation for Migration stated on Tuesday that nearly 180,000 Palestinians in Gaza have been forcibly displaced by recent Israeli military actions.\n\nA statement issued on behalf of the Global Camp Coordination and Camp Management Cluster condemned direct attacks on shelters, stating that such incidents had become \"common\".\n\nMeanwhile, ceasefire talks have been left in limbo after the United States presented a new proposal that reportedly lacked a guarantee to end the war and ensure the withdrawal of Israeli forces.\n\nThe White House said Israel had accepted the new proposal, while Hamas confirmed it was still reviewing it.\n\nThough the new proposal has not been made public, senior Hamas official Sami Abu Zuhri told Reuters the group was \"surprised\" by Israel's response, which he said was \"practically the opposite\" of what had been agreed and relayed to the American envoy via mediators earlier this week.\n\n\"The Israeli response contains no commitment to a ceasefire, no withdrawal from the Gaza Strip, and keeps Israeli control over the aid entry mechanism,\" he said.\n\n\"What Netanyahu is offering is a bad proposal aimed at forcing our people into submission.\"\n\nHamas official Basem Naim echoed this view, telling Reuters that Israel’s response \"fundamentally seeks to entrench the occupation and perpetuate policies of killing and starvation, even during what is supposed to be a period of temporary de-escalation\".\n\nHe added that the Hamas leadership was conducting a \"thorough and responsible review\" of the latest offer.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Badenoch blurts out the truth: Britain is at the heart of Gaza 'proxy war'",
    "url": "https://www.middleeasteye.net/opinion/uk-badenoch-blurts-truth-west-gaza-proxy-war",
    "published": null,
    "content": "If you have spent the past 20 months wondering whyBritishleaders on both sides of the aisle have barely criticisedIsrael, even as it slaughtered and starved Gaza’s population of more than two million people, you finally got an answer last week.\n\nConservative Party leader Kemi Badenoch said the quiet part out loud.She told Sky: “Israel is fighting a proxy war [in Gaza] on behalf of the UK.”\n\nAccording to Badenoch, the UK - and presumably in her assessment, other western powers - aren’t just supporting Israel against Hamas. They are willing that fight and helping to direct it. They view that fight as centrally important to their national interests.\n\nThis certainly accords with what we have witnessed over more than a year and a half. Both the current Labour government of Prime Minister Keir Starmer, and its Tory predecessor under Rishi Sunak, have been unwavering in their commitment to sendBritish armsto Israel, while alsoshipping weaponsfrom theUnited StatesandGermanyto help with the slaughter.\n\nBoth governments used the Royal Air Force base Akrotiri in Cyprus to carry out surveillance flights to aid Israel with locating targets tohitin Gaza. BothallowedBritish citizens to travel to Israel to take part as soldiers in the Gazagenocide.\n\nNeither government joined South Africa’s case at theInternational Court of Justice, which found more than a year ago that Israel’s actions could “plausibly” beconsidered a genocide.\n\nAnd neither government proposed or tried to impose a no-fly zone alongside other western states, as happened in other recent “wars”, to stop Israel’s murderous assault on Gaza, or organised with others to break Israel’s blockade and get aid into the enclave.\n\nIn other words, both governments steadfastly maintained their material support for Israel, even if Starmer recently toned downrhetorical supportafter images of emaciated babies and young children in Gaza - reminiscent of images of Jewish children in Nazi death camps like Auschwitz - shocked the world.\n\nIf Badenoch is right that the UK is waging a proxy war in Gaza, it means that both British governments are directly responsible for the huge death toll ofPalestiniancivilians - running into many tens of thousands, and possibly hundreds of thousands - from Israel’s saturation bombing and total siege.\n\nIt also makes it indisputable thatthe UK is complicit in the current mass starvation of more than two million people there, which is indeed what Badenoch went on to imply in the coded language of political debate.\n\nFollow Middle East Eye's live coverage of the Israel-Palestine war\n\nIn reference to Starmer’s recent, and very belated, criticism of Israel’s starvation of Gaza’s entire population, she observed: “What I want to see is Keir Starmer making sure that he is on the right side of British national interest.”\n\nAccording to Badenoch, Starmer’s implied threat - so far entirely unrealised - to limit the UK’s active collusion in the genocidal starvation of the people of Gaza could harm Britain’s national interests. How exactly?\n\nHer comments should have startled, or at least baffled, Sky interviewer Trevor Phillips. But they passed unremarked.\n\nThis sentiment actually informs much thinking in western foreign policy circles, even if she broke the taboo on articulating it publicly\n\nBadenoch’s “proxy war” statement was also largely ignored by the rest of the British establishment media. Right-wing publications did notice it, but it appeared they were only disturbed by her equating the West’s proxy war in Gaza with the West’s proxy war in Ukraine.\n\nOr as the opposition leader put it: “Israel is fighting a proxy war on behalf of the UK just like Ukraine is on behalf of western Europe against Russia.”\n\nA column in the Spectator, the Tory party’s house journal, criticised her use of “proxy war” to describe Ukraine, but appeared to take the Gaza proxy war reference as read. James Heale, the Spectator’s deputy political editor,wrote: “By inadvertently echoing Russia’s position on Ukraine, Badenoch has handed her opponents another stick with which to beat her.”\n\nThe Telegraph, another Tory-leaning newspaper, ran a similarly themed articleheadlined: “Kremlin seizes on Badenoch’s Ukraine ‘proxy war’ comments.”\n\nThe lack of a response to her Gaza “proxy war” remark suggests that this sentiment actually informs much thinking in western foreign policy circles, even if she broke the taboo on articulating it publicly.\n\nTo reach an answer on why Gaza is viewed as a proxy war - one Britain continues to be deeply invested in, even at the cost of a genocide - one must also understand why Ukraine is seen in similar terms. The two “wars” are more related than they might appear.\n\nDespite the consternation of the Spectator and Telegraph, Badenoch is not the first British leader to point out that the West is fighting a proxywar in Ukraine.\n\n\n\nBack in February, one of her predecessors, Boris Johnson,observedof western involvement in the three-year war betweenRussiaand Ukraine: “Let’s face it, we’re waging a proxy war. We’re waging a proxy war. But we’re not giving our proxies [Ukraine] the ability to do the job.”\n\nIf anyone should know the truth about Ukraine, it is Johnson. After all, he was prime minister when Moscow invaded its neighbour in February 2022.\n\nHe was soon dispatched by Washington to Kyiv, where he appears to have strong-armed President Volodymyr Zelensky into abandoningceasefire talksthat were well advanced and could have led to a resolution.\n\nThere are good reasons why Johnson and Badenoch each understand Ukraine as a proxy war. This weekend Keith Kellogg, Donald Trump’s envoy to Ukraine, echoed them. HetoldFox News that Russian President Vladimir Putin was not wrong to see Ukraine as a proxy war, and that the West was acting as aggressor by supplying Kyiv with weapons.\n\nFor years, the West had expandedNato’s offensive frontiers towards Russia, despite Moscow’s explicit warnings that this wouldcross a red line.\n\nWith the West threatening to bring Russia’s neighbour Ukraine into Nato’s military fold, there were only ever likely to be one of two Russian responses. Either Putin would blink first and find Russia boxed in militarily, with Nato missiles - potentially nuclear-tipped - on his doorstep, minutes from Moscow. Or he would react pre-emptively to stop Ukraine’s accession to Nato by invading.\n\nThe West believed it had nothing to lose either way. If Russia invaded, Nato would then have the pretext to use Ukraine as a theatre of war to bleed Moscow, both economically with sanctions and militarily by flooding the battlefield with western weapons.\n\nAs we now know, Moscow chose to invade. And while it has indeed been bleeding heavily, Ukrainian forces and European economies have been haemorrhaging even faster and more heavily.\n\nThe problem isn’t so much a lack of weapons - the West has supplied lots of them - as the fact that Ukraine hasrun out of conscriptswilling to be sent into the maw of war.\n\nThe West is not, of course, going to send its own soldiers. A proxy war means someone else, in this case Ukrainians, does the fighting - and dying - for you.\n\nThree years on, the conditions for a ceasefire have dramatically changed too. Having spilled so much of its own people’s blood, Russia is much less ready to make compromises, not least over the eastern territories it has conquered and annexed.\n\nWe have reached this nadir in Ukraine - one so deep that even US President Donald Trump appearsready to bail out- precisely because Nato, via Johnson, pushed Ukraine to keep fighting an unwinnable war.\n\nNonetheless, there was a geopolitical logic, however twisted, to the West’s actions in Ukraine. Bleeding Russia, a military and economic power, accords with the hawkish priorities of the neoconservative cabals that run western capitals nowadays, whichever party is in charge.\n\nThe neoconservatives valorise what used to be called the military-industrial complex. They believe that the West has a civilisational superiority to the rest of the world, and must use its superior arsenal to defeat, or at least contain, any state that refuses to submit.\n\nThis is a modern reimagining of the “barbarians at the gate”, or as neoconservatives like to frame it, “a clash of civilisations”. The fall of the West would amount, in their view, to a return to the Dark Ages. We are supposedly in a life-or-death struggle.\n\nArming Israel is seen as no different from arming Ukraine to weaken Russian influence in eastern Europe\n\nIn the US, the imperial hub of what we call “the West”, this has justified a massive investment in war industries - or what is referred to as “defence”, because it is an easier sell to domestic publics tired of the endless austerity required to maintainmilitary superiority.\n\nWestern capitals profess to act as “global police”, while the rest of the world sees the West more in terms of a sociopathic mafia don. However one frames it, the Pentagon is officially pursuing a doctrine known as US “global full-spectrum dominance”. You must submit - that is, let us control the world’s resources - or pay the price.\n\nIn practice, a “foreign policy” like this has necessarily divided the world in two: those in the Godfather’s camp, and those outside it.\n\nIf Russia could not be contained and defanged by turning Ukraine into a Nato forward base on Moscow’s doorstep, it had to be dragged by the West into a debilitating proxy war that would neutralise Russia’s ability to ally withChinaagainst US global hegemony.\n\nThat is what Badenoch and Johnson meant by the proxy war in Ukraine. But how is Israel’s mass murder of Palestinian civilians through saturation bombing and engineered starvation similarly a proxy war - and one apparently benefitting the UK and the West, as Badenoch argues?\n\nInterestingly, Badenoch offered two not entirely compatible reasons for Israel’s “war” on Gaza.\n\nInitially, shetold Sky: “Israel is fighting a war where they want to get 58 hostages who have not been returned. That is what all of this is about … What we need to make sure is that we’re on the side that is going to eradicate Hamas.”\n\nBut even “eradicating Hamas” is hard to square with British foreign policy objectives. After all, despite the UK’s designation of Hamas as a terrorist organisation, it has never attacked Britain, has said it hasno such intention, and is unlikely to ever be in a position to do so.\n\n\n\n\n\n\n\n\n\n\n\n\n\nInstead, it is far more likely that Israel’s destruction of Gaza, with visible western collusion, will inflame hotheads into random or misguided acts of violence that cannot be prepared for or stopped - acts of terror similar to the US gunman who recentlyshot deadtwo Israeli embassy staff in Washington DC.\n\nThat might be reason enough to conclude that the UK ought to distance itself from Israel’s actions as quickly as possible, rather than standing squarely behind Tel Aviv.\n\nIt was only when she was pushed by Phillips to explain her position that Badenoch switched trajectory. Apparently it wasn’t just about the hostages. She added: “Who funds Hamas? Iran, an enemy of this country.”\n\nCornered by her own logic, she then grasped tightly the West’s neoconservative comfort blanket and spoke of a “proxy war”.\n\nBadenoch’s point was not lost on Stephen Pollard, the former editor of the Jewish Chronicle. In a column,he notedof the Sky interview: “Badenoch has a bracing attitude to the truth - she tells it as it is, even if it doesn’t make her popular.”\n\nThe “bracing” truth from Badenoch is that Israel is as central to the projection of western power into the oil-rich Middle East as it was more than a century ago, when Britainconceived of Palestineas a “national home for the Jewish people” in place of the native Palestinian population.\n\nFrom Britain’s perspective, Israel’s war on Gaza, as Badenoch concedes, is not centrally about “eradicating Hamas” or “getting back the hostages” taken during the group’s attack on Israel on 7 October 2023.\n\nRather, it is about arming Israel to weaken those, likeIranand its regional allies, who refuse to submit to the West’s domination of the Middle East - or in the case of Palestinians, to their own dispossession and erasure.\n\nIn that way, arming Israel is seen as no different from arming Ukraine to weaken Russian influence in eastern Europe. It is about containing the West’s geostrategic rivals - or potential partners, were they not viewed exclusively through the prism of western “full-spectrum dominance” - as effectively as Israel has locked Palestinians into prisons andconcentration campsin Gaza and the occupied West Bank.\n\nThis strategy is about averting any danger that one day Russia, China, Iran and others could unite effectively to oust the US and its allies from their heavily fortified hilltop. Alliances like Brics are seen as a potential vehicle for such an assault on western dominance.\n\nWhatever the rhetoric, western capitals are not chiefly concerned about military or \"civilisational\" threats. They do not fear being invaded or conquered by their \"enemies\". In fact, their reckless behaviours in places like Ukraine make a cataclysmic nuclear confrontation more likely.\n\nWhat drives western foreign policy is the craving to maintain global economic primacy. And terrorising other states with the West’s superior military might is seen as the only way to ensure such primacy.\n\nThere is nothing new about the West's fears, nor are they partisan. Differences within western establishments are never over whether the West should assert \"full-spectrum dominance\" around the globe through client states such as Israel and Ukraine. Instead, factional splits emerge over which elements within those client states the West should be aligning with most closely.\n\nThe question of alliances has been particularly fraught in the case of Israel, where the far-right and religious extremist factions in the government have a near-messianic view of their place and role in the Middle East.\n\nPrime Minister Benjamin Netanyahu and many of those closest to him have been trying for decades to manoeuvre the US into launching an attack on Iran, not least to remove Israel’s main rival in the Middle Eastand guaranteeits nuclear-armed regional primacy in perpetuity.\n\nSo far, Netanyahu has found no takers in the White House. But that hasn’t stopped him trying. He is widely reported to be deep in efforts to push Trumpinto joiningan attack on Iran, in the midst of talks between Washington and Tehran.\n\n\n\nOver many years, British hawks look like they have been playing their own role in these manoeuvres. In the recent past, at least two ambitious British government ministers on the right have been caught trying to cosy up to the most belligerent elements in the Israeli security establishment.\n\nIn 2017, Priti Patel was forced to resign as international development secretary after she was found to have held 12 secret meetings with senior Israeli officials, including Netanyahu, while supposedly on a family holiday. She had other off-the-booksmeetingswith Israeli officials in New York and London.\n\nSix years earlier, then-Defence Secretary Liam Fox also had tostep downafter a series of shadowy meetings with Israeli officials. Fox’s ministry was also known to havedrawn updetailed plans for British assistance in the event of a US military strike on Iran, including allowing the Americans to use Diego Garcia, a British territory in the Indian ocean.\n\nUnnamed government officialstoldthe Guardian at the time that Fox had been pursuing an “alternative” government policy. Former British diplomat Craig Murraywas more direct: his sources within government suggested Fox had been conspiring with Israel in a “rogue” foreign policy towards Iran, against Britain’s stated aims.\n\nThe West’s behaviours are ideologically driven, not rational or moral. The compulsive, self-sabotaging nature of western support for Israel’s genocide in Gaza is no different - though far grosser - than the self-sabotaging nature of its actions in Ukraine.\n\nThe West has lost the battle against Russia, but refuses to learn or adapt. And it has spent whatever moral legitimacy it still had left in propping up an Israeli military occupier bent on starving millions of people to death, if they cannot be ethnically cleansed intoEgyptfirst.\n\nNetanyahu has not been the easy-to-sell, cuddly military mascot that Zelensky proved to be in Ukraine.\n\nRather than distance herself from Israel's atrocities, she is happy to place herself - and the UK - at the crime scene\n\nSupport for Kyiv could at least be presented as taking the right side in a clash of civilisations with a barbarous Russia. Support for Israel simply exposes the West’s hypocrisy, its worship of power for its own sake, and its psychopathic instincts.\n\nSupport for Israel’s genocide has hollowed out the West’s claim to moral superiority for all but its most deluded devotees. Sadly, those still include most of the western political and media establishments, whose only rationale is to evangelise for the belief system over which they preside, claiming it to be the worthiest in history.\n\nSome, like Starmer, are trying to moderate their rhetoric in a desperate attempt to protect the morally bankrupt system that has invested them with power.\n\nOthers, like Badenoch, are still so enthralled by the cult of a superior West that they are blind to how preposterous their rantings sound to anyone no longer rapt in devotion. Rather than distance herself from Israel’s atrocities, she is happy to place herself - and the UK - at the crime scene.\n\nThe scales have fallen from the western public’s eyes. Now is the time to hold our leaders fully to account.\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Eye.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Netanyahu 'unsettled' by Macron's push to recognise Palestinian statehood",
    "url": "https://www.middleeasteye.net/news/netanyahu-unsettled-macrons-push-recognise-palestinian-statehood",
    "published": null,
    "content": "A prominentIsraelidiplomat has told Middle East Eye thatFrenchPresident Emmanuel Macron’s push to recognisePalestinianstatehood “is serious and has the backing of most of the European Union andSaudi Arabia”.\n\nAlon Pinkas, who was an adviser to four Israeli foreign ministers and served as the country’s consul general in New York, said that Prime Minister Benjamin Netanyahu “is unsettled because he knows Donald Trump’s support is brittle and tentative”.\n\n“Both the EU and theUSwill be looking for something they can work together on and alleviate tensions,” Pinkas said.\n\n“You need one or two European leaders to placate Trump and let him feel like it’s his idea.”\n\nUnlike 147 of the 193 United Nations member states, France does not recognise the state of Palestine, a position it shares with other western nations including theUK, US and Australia.\n\nBut France is now pushing for Australian and European powers, including the UK, Belgium and the Netherlands, to recognise Palestinian statehood at a UN conference it is co-hosting with Saudi Arabia in New York later this month.\n\nParis hopes that recognition of Palestinian statehood will kickstart a peace process and help accelerate momentum for a two-state solution.\n\nPinkas, a longstanding critic of Netanyahu, said he believed Macron’s push for Palestinian statehood was also related to “general fatigue and disillusionment with Israel over its intransigence on everything”.\n\nLast year, Spain, Norway and Ireland agreed to recognise a Palestinian state.\n\nIsrael condemns such moves as rewarding the actions of Palestinian armed groups.\n\nIn recent weeks, European nations, including the UK and France, have taken a much firmer rhetorical line with Israel, while continuing to support it as its war on Gaza continues.\n\n'The humanitarian blockade is creating a situation that is untenable on the ground'\n\n-President Emmanuel Macron\n\nPinkas told MEE he thought that the EU’s position on the war had not really changed, it has simply become “unequivocal and public”.\n\nHe said that while there was no meaningful domestic support in Israel or in the Knesset for Palestinian statehood, the international community’s pitch to Israel over ending the war should be that “we are your friends, we want you to succeed, this cannot go on... Netanyahu is driving you to unmitigated and irreparable disaster. Wake up, we are here to help.\"\n\nAt a press conference in Singapore on Friday, Macron said France was committed to working towards a political solution, as he reiterated his support for a two-state solution to the Israel-Palestine conflict.\n\n“The humanitarian blockade is creating a situation that is untenable on the ground,” Macron said.\n\n“And so, if there is no response that meets the humanitarian situation in the coming hours and days, obviously, we will have to toughen our collective position,” he said, adding that France might consider applying sanctions against Israeli settlers.\n\nWhile diplomats say the French president is leaning towards recognition of a Palestinian state, Paris has yet to take any concrete steps to target Israel in its war on Gaza.\n\nMacron does seem to enjoy a good relationship with US President Donald Trump, who Pinkas said could work with EU nations to put pressure on Israel. Asked about a viral video that appeared to show the French president being slapped by his wife Brigitte, Trumpsaid: \"He's fine, they're fine. They're two really good people, I know them very well.\"\n\nIsrael claimed to have partially ended an 11-week long aid blockade on Gaza last week, but barely any aid has entered the largely destroyed Palestinian enclave and civilians have been killed at the new US-Israel sponsored aid distribution sites, which see Palestinians crammed into tight spaces between fences.\n\nIsrael's foreign ministry said the assertion that there was a humanitarian blockade of Gaza was “a blatant lie”.\n\nIt said nearly 900 aid trucks had entered the Gaza since the blockade was eased and that the new US-backed system had distributed two million meals and thousands of aid packages.\n\n“But instead of applying pressure on the jihadist terrorists, Macron wants to reward them with a Palestinian state,” the Israeli ministry said in a statement reported by Reuters.\n\nThe charity Islamic Relief condemned the new aid system in a statement on Monday, saying that “massacres of people trying to get food aid must not go without consequence”.\n\n“Three months since Israel tightened its total siege of Gaza, dozens of Palestinian children, babies and elderly people have starved to death and desperate parents are being shot and killed as they try to get food aid at new militarised distribution sites,” the statement said.\n\n“Many more people across Gaza will soon die from hunger and disease unless international governments urgently put meaningful pressure on Israel to fully end its siege, reopen all crossings and allow large-scale, safe and unimpeded humanitarian access,” Islamic Relief said.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Amid Gaza food distribution chaos, Palestinian-led group steps up",
    "url": "https://www.middleeasteye.net/news/amid-gaza-food-distribution-chaos-palestinian-led-aid-group-step-efforts",
    "published": null,
    "content": "Hala Sabbah’s team has spent weeks trying to source a bag of flour in Gaza.\n\n“We’re not finding flour - or at least clean flour. It’s all infested or mixed with sand,” she told Middle East Eye, speaking from London.\n\nSabbah works with aPalestinian-led mutual aid group, coordinating with local volunteers who purchase and distribute supplies in Gaza, using funds raised through the project.\n\nOver a year ago, Sabbah and two other members of the Palestinian diaspora launched theSameer Project- a grassroots initiative named in honour of Sabbah’s uncle, who was killed byIsraeliforces in Gaza.\n\nAmid Israel’s ongoing blockade of the Gaza Strip since 2 March, which has cut off all aid and forced many NGOs to suspend their services, their work has become even more challenging.\n\nWith flour scarce, the group has turned to rice distribution, but Sabbah is still doing all she can to find a bag of flour.\n\n“People in Gaza really prefer bread. If you give them a plate of rice or a piece of bread, they will always take the bread,” Sabbah explained to MEE.\n\nOn Sunday, Israeli forces opened fire on starving Palestinians gathered at US-backed aid distribution points in central and southern Gaza, killing at least 35 people.\n\nIt is the latest in a series of attacks on aid seekers at sites run by theGaza Humanitarian Foundation (GHF), a fledgling US-based initiative to distribute aid in Gaza via private contractors.\n\nGHF's first distribution attempt on Tuesday descended intochaos, as Israeli forces killed three and wounded at least 46 others.\n\nThe GHF said its meals each contain only 1,750 calories - well below the2,100-calorie per day minimum set by the World Health Organization (WHO) for emergency meals.\n\nFor Sabbah, the contents of the GHF parcels were not just inadequate, but “offensive\".\n\n“There were no vegetables, no meat, no fruit - nothing fresh,” Sabbah said.\n\nThe entire enterprise runs starkly counter to the work she and her colleagues have been doing over the last year - working closely with Palestinians in Gaza and adapting quickly to respond to the needs of those on the ground.\n\nSabbah coordinates the Sameer Project with two other Palestinians living in the diaspora - California-based Lena Dajani, who organises medical aid, and an anonymous activist who runs the Instagram page,‘Translating Falasteen’.\n\nThe trio have raisedmillions of dollarsand coordinated with people on the ground in Gaza to respond to requests for food, medicine and emergency aid via Whatsapp groups.\n\nWith a skeleton team and a strong web of contacts, the group is agile and flexible in their approach, able to adapt quickly to the daily flurry of requests.\n\nWhile Israel’s ongoing blockade has forced many international NGOs to halt or curtail their services in Gaza, the small network has doggedly pursued its work.\n\n“Our biggest struggle is food. So, right now a plate of rice is around 8.5 dollars, with commission it adds up to over $10. This is a plate of rice that's barely enough for two people,” Sabbah said.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe project also has to contend with war profiteering by armed gangs who loot and hoard the scraps of aid that have made it past the border,reportedly under Israeli military protection.\n\nBut the Sameer Project’s agility means they can buy products from a variety of sources, from street vendors and traders, unlike big NGOs which bring in their own aid and equipment through the border.\n\n“These international organisations run under western frameworks are super process heavy and bureaucratic. They're not flexible, they're not agile. They don't make exceptions. They spend a lot on overhead,” Sabbah said.\n\n“We create our own invoices, we just find a way to make it work. We don’t stall the process”.\n\nWater distribution is another urgent task. The group rents two water trucks, which transport around100,000litres a day from desalination plants in the north of the Strip, where Israeli attacks have destroyed much of the infrastructure.\n\nThe water costs around$46 per 1,000 litres, according to the group.\n\n“After the [January] ceasefire, suddenly you had almost a million people move up north in the space of a week. In places like Jabalia and Beit Lahia, there’s no infrastructure whatsoever,” Sabbah told MEE.\n\n“We made sure that we delivered to those places that are not reachable to aid organisations, that don't have wells or where the infrastructure has been completely ruined”.\n\nScarcity of clean water means children have tohaul heavy jerry cans of waterover long distances. The project recently documented a case of a child who tore his groin due to the weight of the jerry can he was carrying.\n\n“The men of the family have to go and look for food or try to make money… so, that leaves the kids to go and get the water,” Sabbah said.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSabbah emphasised that the project is not just driven by the urgent humanitarian demand on the ground.\n\nThe water deliveries in Gaza’s north for example, are needed to keep the areas habitable.\n\n​“Our end goal is the liberation of Palestine and making sure that everyone stays on their land,” she said.\n\n“So, part of our way to support people in returning to their homes, even though they’re completely destroyed, is to make sure that at least they have access to water and food”.\n\nShortages of medical supplies and personnel mean the group also has to scramble to plug the gaping holes in Gaza’s severely-damaged health system.\n\nThe group’s medical coordinator, Lena Dajani, receives some 25 critical patient referrals via Instagram and Whatsapp daily, which she passes onto a medical point at theRefaat Al Areercamp, which the project set up in central Gaza to ease the burden on the Strip’s hospitals.\n\nThe medical point then contacts the patients, and Dajani purchases the medication, which has become nearly impossible to source due to the Israeli blockade. However, by being plugged into a network of pharmacies and clinics, Dajani is still able to meet most of the requests she receives.\n\n“For one patient, we have to call maybe 10 pharmacies to just find a simple medication, and then we only give them a month's worth, because we obviously have to spread that amount between all the patients that need immediate care,” Dajani told MEE.\n\nThe scarcity and soaring cost of medication is producing rising cases of treatable conditions.\n\n“Epilepsy is really rampant, and they just cannot afford their seizure medication,” Dajani said.\n\nWith hunger stalking Gaza, the project has been inundated with malnutrition cases amongst children.At least 60 are reported to have diedsince October 2023.\n\n'Epilepsy is really rampant, and they just cannot afford their seizure medication'\n\n- Lena Dajani, Sameer Project co-founder\n\nDespite baby formula being hard to come by, the group managed to buy around $51,000 in nutritional supplements.\n\nWith the blockade and escalating Israeli attacks halting Unrwa and WHO-led efforts to control viral outbreaks across the enclave, the group now treats 300-500 patients a day for skin rashes, scabies, eye infections, and viral and bacterial diseases.\n\n“Scabies cream is also incredibly difficult to source. You're supposed to take it over a long period of time. We're trying to put out a fire with a drop of water,” Dajani told MEE.\n\nThe project is also grappling with cases of children with respiratory and gastrointestinal infections, due to drinking contaminated water.\n\nIn one case, a three-year-old drank a bottle of detergent thinking it was water. The project rushed the child to hospital to have their stomach pumped.\n\nPainkillers and insulin are also near impossible to source. The nerve blocker Gabapentin was being widely used as an alternative painkiller - although even this is also now unavailable.\n\n“We had a patient who had shrapnel lodged in his brain, and it's causing him so much pain that when he's off his medication, he smashes things around him because he is in so much pain,” Dajani told MEE.\n\nThere are no wheelchairs in Gaza. Along with crutches and cochlear implants, the Israeli authorities consider them to be \"dual use\" items, meaning they could be used for \"military purposes\".\n\nDajani has to wait for someone to pass away in order to buy one from a medical supplier.\n\nThe chairs cost $550 each, with payment in cash - which is also difficult to come by in Gaza, with commission rates soaring to35 percent.\n\n“The entire healthcare system is now almost entirely being propped up by smaller groups like ours, who can source on the ground, who can take out cash at 35 percent,” Dajani said.\n\n“Whereas the organisations with all these processes aren't standing up to Israel to allow them to operate here. We're not waiting. We're taking action”.\n\nFor Sabbah, the unravelling of the GHF came as no surprise. She said the fiasco is reflective of problems with international aid in Gaza.\n\n“A lot of them come in with their own agendas. They have a lot of red tape. There's a lot of things that they can’t do,” Sabbah said.\n\nMost importantly, she noted that international organisations lack cultural sensitivity and an understanding of Gaza.\n\nThe Sameer Project had attempted to work with a US-led mutual aid group who wanted them to construct long drop toilets.\n\n“They told us ‘We need to do long drop toilets, because this is what we do in the US, and it's the best way to do toilets',” Sabbah said.\n\nWhen Sabbah explained this method was not practiced in Gaza, the group refused to work with them.\n\n“There are always these impositions by western organisations, enforcing what they call international standards, which in reality were written by people from the West who have never experienced a genocide or a siege for 19 months,” Sabbah said.\n\n“Our mutual aid group and a couple of others that we really trust, centre the people in Gaza,” she added. “We're not here to manage the initiative. We are here to facilitate, we're here to make sure the money gets to the right hands”.\n\nFor Sabbah and her colleagues, this is the only way to help people in Gaza, to let them dictate the aid they require, rather than having it imposed on them by NGOs headquartered in the global north.\n\n“There's no case that is similar to Gaza,” Sabbah said. “There have been genocides that happened for long periods of time, but a siege on top of that, and also an intentional famine all happening at the same time with no one being able to leave.\n\n“I think that, after 12 plus years of working in NGOs and international organisations, I assure you, the UN would have had massive challenges in making this work, let alone an organisation like GHF that's run by a bunch of snipers and mercenaries.\"\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Israel destroys north Gaza's sole kidney dialysis facility",
    "url": "https://www.middleeasteye.net/news/israel-destroys-north-gazas-sole-kidney-dialysis-facility",
    "published": null,
    "content": "TheIsraelimilitary has destroyed northGaza's only kidney dialysis centre, posing grave risks to patients suffering from kidney-related ailments.\n\nThe Palestinian health ministry on Sunday released a statement reporting on the bombing of the Noura al-Kaabi Kidney Dialysis Centre, located in the north of the besieged enclave.\n\nThe health facility was the lone provider of dialysis services to kidney patients in the north.\n\nInfootageposted online, military excavators could be seen further demolishing the northern Gaza health centre.\n\n\"The destruction of the centre poses a catastrophic threat to the health of kidney patients, the consequences of which are unpredictable,\" the ministry noted, adding that 41 percent of patients suffering from kidney issues in the blockaded Strip died during Israel's war on Gaza due to the targeting and restrictions on such centres.\n\n\"The occupation is working according to a dangerous methodology to empty the northern Gaza Strip of hospitals and specialised care centers,\" the statement further read.\n\nThe facility has beenpreviously targetedby the Israeli army, leaving only eight dialysis machines functioning, before its complete destruction on Sunday.\n\nIt is the latest health centre to be attacked in a series of Israeli attacks on Gaza's healthcare system, which have left the enclave reeling from a humanitarian crisis the UN says has reached \"unprecedented levels\".\n\nAnother Israeli attack wasreportedby Al Jazeera at the European Gaza Hospital in Khan Younis, where forces carried out bulldozing activities in the vicinity of the hospital.\n\nAlongside the targeting of medical facilities, 100 percent of the Gaza Strip's population of over 2.2 million people is on the verge of \"catastrophic hunger”, Jens Laerke, spokesperson for the UN Office for the Coordination of Humanitarian Affairs, said on Friday.\n\nLaerke added that the “limited number of truckloads coming in [to Gaza] is a trickle - it’s drip-feeding food.\n\n\"The aid operation that we have ready to roll is being put in an operational straitjacket that makes it one of the most obstructed aid operations not only in the world today, but in recent history.\"\n\nThe restriction on aid and essentials has leftPalestiniansgrappling to survive, including kidney patients who are in need of specific life-saving medications, nutrition and healthcare services.\n\nOn Sunday, the Israeli Chief of Staff Eyal Zamir announced the expansion of military operations in the Gaza Strip to include more area under a \"decisive phase of the fighting.\"\n\nSince Zamir made the statement during a field tour in the blockaded Strip, the army has launched a brutal assault across different parts of Gaza.\n\nThe health ministry indicated that over 50 people have been killed in the past 24 hours.\n\nAccording to the news agency Arab48, reports ofmild tremorscaused by the intensified Israeli bombardment of Gaza could be felt in the Negev and the southern occupied West Bank.\n\nIsrael has killed more than 54,470 people in Gaza since 7 October 2023, wounding an additional 124,693.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Israel kills 32 starving Palestinians in latest US aid point 'massacre'",
    "url": "https://www.middleeasteye.net/news/israel-kills-32-starving-palestinians-latest-us-aid-point-massacre",
    "published": null,
    "content": "Israeliforces have committed a new massacre targetingPalestinianaid seekers in the Gaza Strip, killing at least 32 people and wounding scores more, the Palestinian health ministry said on Sunday.\n\nAccording to eyewitnesses and local officials, Israeli troops opened fire directly on civilians gathered at two US-Israeli food distribution points in Rafah and central Gaza.\n\nAt least 31 people were killed in Rafah and one in central Gaza, while over 200 were wounded, many of them critically.\n\nThe health ministry accused Israel of using the new aid mechanism as a “trap for mass killings” and a tool for “the forced displacement of Gaza’s population”.\n\nIt added that those killed in the “massacre” had single gunshot wounds to the head or chest, indicating clear intent to kill.\n\nIn Rafah, thousands were instructed to queue some 500 metres from the US distribution point at the Al-Alam roundabout, local journalist Mohammed Ghareeb told Middle East Eye.\n\nAs crowds approached the area, Israeli forces rained down bullets on them from every direction, eyewitnesses said.\n\n“I was standing among the crowd, but when people started rushing toward the distribution point, I couldn’t move with them because there were hundreds pushing forward,” Marwa al-Naouq told MEE.\n\n“Then a quadcopter appeared and began firing at them. After that, the Israeli army opened fire directly on the crowd, and American security forces fired tear gas canisters.\n\n“Dozens were killed and injured as people ran in every direction, trying to escape.”\n\n'The occupation targeted hungry people as if these aid distribution centres were distributing death'\n\n-  Marwan al-Hems, Palestinian doctor\n\nMarwan al-Hems, director of field hospitals in Gaza, described the scene as a “massacre and a slaughter\".\n\n“The occupation targeted hungry people as if these aid distribution centres were distributing death instead,” he told MEE.\n\nSouthern Gaza hospitals were overwhelmed, with patients lining hallways and lying on floors due to a lack of beds and medical supplies, Hems said.\n\n“We tried to save as many as we could, but we lost some due to a shortage of blood,” he added.\n\nHamas accused Israel of weaponising aid, saying the food distribution system had become part of a broader campaign of genocide.\n\nThe Israeli military claimed it was “unaware of injuries caused by [Israeli army] troops”.\n\nIn both Rafah and central Gaza, eyewitnesses described the incidents as “ambushes” carried out by Israeli forces.\n\nIn coordination with American security personnel working for the Gaza Humanitarian Foundation (GHF), starving civilians were instructed in the early hours to go to a designated point near the Wadi Gaza Bridge, ostensibly to receive aid.\n\nInstead, they were met with direct gunfire, according to the Gaza-based Government Media Office.\n\nMany remain “trapped under continuous gunfire in the vicinity of the aid centre,” the office reported.\n\nA similar scene unfolded in Rafah, where thousands had gathered overnight to receive food.\n\n'The Americans are lying to us... They call it a humanitarian point then kill us there'\n\n- Arafat Siyam, shooting survivor\n\n“They told us to go to this humanitarian zone to receive food - then they killed us,” Arafat Siyam, a survivor, told MEE.\n\nSiyam’s brother was killed. The two had arrived at the aid site at 11pm on Friday, hoping to bring back food for their starving children.\n\n“The Americans are lying to us. Since when have they cared about humanitarian work?” he said.\n\n“They call it a humanitarian point then kill us there.”\n\nAccording to the media office, Israeli forces have killed at least 49 Palestinians and injured 305 others at GHF-run distribution centres since the operation began on 27 May.\n\nGHF, a scandal-plagued US organisation backed by Israel, was launched to bypass the UN's aid infrastructure in Gaza.\n\nSenior humanitarian officials have condemned the scheme, saying Israel should stop blocking the UN-led system and allow aid to flow without obstruction.\n\nOverall, Israeli forces have killed more than 54,000 Palestinians in the Gaza Strip since October 2023, including at least 16,500 children.\n\nAdditionally, over 10,000 people are missing and presumed dead, while nearly 120,000 others have been wounded.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Will Unrwa survive? An interview with Commissioner-General Philippe Lazzarini",
    "url": "https://www.middleeasteye.net/video/will-unrwa-survive-interview-commissioner-general-philippe-lazzarini",
    "published": null,
    "content": "Copyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Ireland stands by claim Israel committing genocide in Gaza",
    "url": "https://www.middleeasteye.net/news/ireland-says-israel-carrying-out-genocide-gaza",
    "published": null,
    "content": "Ireland'sTanaiste, or deputy prime minister, Simon Harris, defended the government's position on Thursday that Israel is carrying out a genocide inGaza, Irish broadcaster RTE reported.\n\n\n\n“We are the first government in the European Union (EU) to say what Israel is doing is genocide. It is genocide,\" Harris told an opposition lawmaker during a heated exchange in parliament, known as the theDáil.\n\nCatherine Connolly, an independent, accused the government of not doing enough to punish Israel for its 19-month-long war on Gaza, which has killed more than 54,000 Palestinians, more than half of them women and children, according to the Palestinian health ministry.\n\n“I’m disgusted and sickened, sickened - watching children dying on our television screens and every day I come to work, and work with all the people in here to do our best to show leadership at a time of horrific conflict,\" Harris said.\n\n“We’re working to support the people of Palestine and the only chamber I ever go into in the entire world where people don’t acknowledge that Ireland, the government, the people of Ireland, are standing with the people of Palestine, standing up for human rights, standing up for international law, is here when you get up and distort - with your ideology - the actions of this government.\"\n\nIreland recognised Palestinian statehood one year ago, and in January, it joined South Africa's genocide case against Israel at the International Court of Justice (ICJ).\n\nOn Thursday, Harris said that a bill banning trade with goods from Israeli settlements - deemed illegal under international law - would move to the foreign affairs committee next month, the Irish Times said.\n\nThe government is also under pressure tohelp remove the Central Bank’s role in permitting the sale of Israel bonds in the EU, and to stop any flights over Ireland that may be carrying weapons to Israel, the paper reported.\n\n\n\n“I’m proud of the people of this country. I’m proud that we went into an election, and it didn’t matter what party you were in, you stood up and said, ‘We are going to support the people of Palestine’.\"\n\nHarris's stance was backed by thetaoiseach - or prime minister, Micheal Martin, earlier in the week.\n\n“We have been very consistent in our support to the Palestinian people and their right to self-determination, and in condemning the war crimes and the genocide that is occurring right now,” Martin told the Dail.\n\n“The focus has to be relentlessly on the policies of Prime Minister Netanyahu and the Israeli government, made up of extreme far-right elements who are committing genocide in Gaza right now.\"\n\n\n\nIn 2018, the Occupied Territories Bill was introduced in Ireland by Independent Senator Frances Black, proposing a ban on trade with businesses operating in illegal Israeli settlements on Palestinian land, but it was ultimately blocked over concerns about breaching EU trade rules.\n\nHowever, anadvisory opinionfrom the ICJ in July marked a turning point in reconsidering the enactment of the Irish bill.\n\nThe ICJ concluded that Israel's presence in the occupied Palestinian territories is \"unlawful” and the country should “end its presence in the occupied Palestinian territory as rapidly as possible”.\n\nMore than 400 of Ireland’s senior legal academics and practising lawyers have called on thegovernmentto enact the bill in its original form, prohibiting all goods and services in the occupied West Bank, such asAirbnb.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Greta Thunberg joins activists sailing from Italy to Gaza to break Israeli siege",
    "url": "https://www.middleeasteye.net/news/greta-thunberg-freedom-flotilla-aid-ship-sets-sail-italy-gaza",
    "published": null,
    "content": "A ship operated by the Freedom Flotilla Coalition on Sunday set off from Sicily to the Gaza Strip carrying \"symbolic\" aid to break the Israeli siege on the Palestinian enclave.\n\nSwedish climate activist Greta Thunberg, Game of Thrones actor Liam Cunningham, and Franco-Palestinian MEP Rima Hassan were among the 12-person crew of the Madleen, which is expected to take seven days to reach Gaza.\n\n\"The ship is carrying urgently needed supplies for the people of Gaza, including baby formula, flour, rice, diapers, women’s sanitary products, water desalination kits, medical supplies, crutches, and children’s prosthetics,\" the FFC said in a statement.\n\nThe barrels of relief were described by the organisers as \"limited amounts, though symbolic\".\n\n“We are doing this because no matter what odds we are against, we have to keep trying, because the moment we stop trying is when we lose our humanity,” Thunberg told reporters at a news conference in the port of Catania.\n\nAnother Freedom Flotilla vessel, the Conscience, failed to continue its voyage in early May after being hit by two drones just outside Maltese waters.\n\n\"No matter how dangerous this mission is, it is nowhere near as dangerous as the silence of the entire world in the face of the lives being genocised,” said Thunberg.\n\n6 français sont à bord de la#FreedomFlotilla✌️pic.twitter.com/T3Xzn4R5bJ\n\n\n\n\"The Freedom Flotilla Coalition emphasises that this is a peaceful act of civil resistance,\" the group said. \"All volunteers and crew aboard Madleen are trained in nonviolence. They are sailing unarmed, united by the shared belief that Palestinians deserve the same rights, freedom, and dignity as all people.\"\n\nA number of American and Israeli commentators criticised Thunberg and the other activists, apparently making threats against their safety.\n\nUS Senator Lindsey Graham posted an article on the flotilla from Times of Israel andwroteon X: \"Hope Greta and her friends can swim!\"\n\nIsraeli-based international human rights lawyer Arsen OstrovskydescribedThunberg as a \"little Jihadi\" and said it would be \"so sad if something were to happen to her flotilla\".\n\nHe later deleted the post.\n\nThe Palestinian health ministry said on Saturday that at least 4,149 people had been killed in the territory since Israel resumed its offensive on 18 March, taking the war's overall toll to more than 54,418.\n\nAfter an 11-week total ban on the entry of humanitarian aid to Gaza, Israel on 19 May allowed limited UN aid deliveries and a US-backed aid distribution scheme that has been rejected by the UN as discriminatory and unworkable.\n\nOn Sunday,Israeliforces killed at least 32 people attempting to reach aid via the new scheme in Gaza, while wounding scores more.\n\nAccording to eyewitnesses and local officials, Israeli troops opened fire directly on civilians gathered at two US-Israeli food distribution points in Rafah and central Gaza.\n\nThe health ministry accused Israel of using the new aid mechanism as a “trap for mass killings” and a tool for “the forced displacement of Gaza’s population”.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Has Israel manufactured a famine in Gaza?",
    "url": "https://www.middleeasteye.net/news/has-israel-manufactured-famine-in-gaza",
    "published": null,
    "content": "The markets are empty. The make-shift hospitals are bare. The water is contaminated. The aid trucks are nowhere in sight.\n\nGaza is being starved, and rights groups say,deliberately.\n\nAt least 57 children have starved to death since 2 March, and 71,000 children under the age of five are expected to be acutely malnourished over the next eleven months.\n\nIn the ongoing war on Gaza, which genocide scholars and international human rights organisations haveunanimouslycalled a \"genocide\" against the Palestinian people, Israel also has been accused of implementing apolicyof starvation in Gaza.The crisis has escalated to such an extent over the past 11 weeks since Israel blocked aid to the enclave - opening it just this week in adehumanisingmanner -  that nearly every single person in Gaza is facing prolonged food shortages, with close to a half a million people (or around one in five) are currently experiencing \"catastrophic situation of hunger, acute malnutrition, starvation, illness and death\".\n\nIn its assessment in mid-May, the Integrated Food Security Phase Classification (IPC), a global initiative aimed at enhancing food security and nutrition analysis to inform decisions, wrote that over the next six months, the entirety of Gaza is expected to face what is referred to by experts as \"crisis, or worse acute food insecurity\".\n\nAround 22 percent of the population is already living in conditions akin to famine.\n\nLike Gaza, parts of Sudan have also been facing acute food insecurity, including famine, over the past year, as a result of the ongoing conflict between theSudanesearmy and the paramilitaryRapid Support Forces.\n\nBut what happens to the body when it enters \"starvation\" mode? What does it mean to live in conditions of famine?\n\nAnd when a human being is facing starvation and the body begins to waste away, is it possible to ever reverse the devastating impact on the body?\n\nMiddle East Eye looks at the medical and legal dimensions of what it means to starve a population.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccording to health professionals, starvation occurs in several stages.\n\nThe first stage can begin as quickly as a single missed meal. The second stage is activated when the body has to rely on stored fats for energy while not eating.\n\nThe third phase is when the body turns to bone and muscle for energy after releasing all stored fats.\n\nWhen this deficit of nutrients impacts health, the body is considered malnourished.\n\nThis can result in physical and psychological distress, and over a prolonged period, it can have severe impacts on the human body.\n\nOnce the body uses its energy reserves, known as glycogen, it moves to fats and then to muscles to keep the heart going.\n\nIt is particularly damaging for children because it can impact their developing immune systems and make them susceptible to other diseases.Over and above the agonising pain triggered by hunger, the body shrinks, bones protrude, and the cheeks become gaunt and appear hollow.This inevitably impacts the brain, with victims suffering from mood swings and immense irritability.\n\nA body struggling with malnutrition and undernutrition can result inwastingand is also likely to impact the heart's function.The body's blood pressure will drop, and the pulse will slow.\n\nAt some point, the body either succumbs to an infection or the heart simply fails.\n\nBetweenlate April and early May, around 50 experts from 17 organisations conducted a study into the food insecurity and famine in Gaza.The group coordinated by the IPC concluded that Gaza in its entirety was in phase four of acute food insecurity.\n\nThis means households across Gaza were facing huge food shortages that have either seen them suffer from high acute malnutrition and excess mortality, or resulted in them adopting desperate measures to survive.\n\nOn Wednesday, Feroze Sidhwa, an American trauma surgeon who spent five weeks in Gaza, told the UN Security Council that civilians in Gaza were now dying “not from the constant air strikes, but acute malnutrition, sepsis, exposure, and despair”.\n\n\"Between my two visits to Gaza, I witnessed a sharp decline in patients’ health driven not just by injury, but by worsening hunger and malnutrition that left their bodies weaker, their wounds slower to heal, and their survival far less certain,” Sidhwa said.\n\nMarina Pomares, Médecins Sans Frontières' medical coordinator in Deir al Balah, describes the level of malnutrition in Gaza as \"very alarming\".\"We are seeing a lot of children who are coming to us who have not been eating for weeks. These children are going through [the] malnutrition process,\" Pomares told MEE.Pomares said there were also many adults, especially breastfeeding women, malnourished themselves, who were \"giving the little food that they had to their children\".\n\nLikewise, a World Health Organisation spokesperson told MEE that pregnant and breastfeeding mothers in Gaza \"were also at high risk of malnutrition, with nearly 17,000 expected to require treatment for acute malnutrition over the next eleven months\".\n\nProlonged starvation can result in severe damage, including stunted growth, impaired cognitive development, and severely poor health.Pomares said that with the right treatment, malnourished children, pregnant and breastfeeding women, could experience some improvement in their health.However, she warned that if the treatment is not followed up with sufficient nutrient intake, the process would repeat itself and, potentially, as others have suggested, severely impact them for the rest of their lives.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFamine is a term used to describe \"a societal catastrophe\" that calls for an urgent and coordinated humanitarian response to avoid the mass loss of life.There is a set oftechnical requirementsor thresholds that have to be crossed for famine to be declared.These include: at least 20 percent of the population facing extreme food shortages; acute malnutrition rates exceeding 30 percent; and two out of 10,000 people dying from starvation daily.\n\nIn Gaza, UN human rights experts havesounded the alarmthat certain sections of Gaza were already in a state of famine.\n\nIn July 2024, the IPC said Gaza was facing a “high risk” of famine, but wouldn't go so far as to call it famine.Likewise, in its most recent report in mid-May, it said Gaza was again on the cusp of famine.\n\nExperts argue that whereas Israel has allowed the crisis to deepen, resulting in excruciating living conditions for the people of Gaza, it has looked to let in aid just before Gaza entered the catastrophic phase of famine.\n\n\"Encouraged by the United States, Israel has tried to keep the Gazans from descending into 'famine' by turning the aid tap on whenever the data indicate it is about to cross that threshold. When it does this, and the IPC reports that the deterioration has been arrested,Israeli advocates claimthat the famine story was made up all along. That’s wrong,\" Alex de Waal, an expert on famine, Sudan and the Horn of Africa, writes.\n\n\"The IPC experts protest that even when the situation is an 'emergency' (level four) or 'catastrophe' (level five for food insecurity), the level of distress is unacceptable. But for international policymakers, it seems that what counts is the 'F-word'.\n\n\"They won’t say it out loud, but the implication is that hunger that doesn’t reach the famine threshold is somehow tolerable,\" de Waal added.The IPC did not reply to MEE's request for comment.\n\nMeanwhile, on 20 May, Akihiro Seita, director of health at United Nations Relief and Works Agency for Palestine Refugees in the Near East (Unrwa), reiterated that the crisis in Gaza could be resolved if the UN were allowed to resume its aid work there.\n\nSeita said that whereas medicine was likely to run out by the end of May, there was sufficient medicine and food in Jordan waiting to be taken into Gaza.\n\nSeita said Unrwa staff in Gazawere thinkingabout only two things at this point: how to survive and how to die.\n\nAccording to the IPC, there are four key drivers of acute food insecurity in Gaza and several contributing factors adding to the crisis.These include: the ongoing Israeli bombardment of Gaza, that has so far killed over 54,000 people, injured tens of thousands and destroyed crucial infrastructure; the restrictions placed by Israel in bringing in essential food, energy, medicine and clean water; the continuous displacement of people - around 1,9 million Palestinians have been made to leave their homes - and move multiple times as a result of evacuation orders and no-go areas; and crucially, the collapse of food systems as a result of the war on Gaza.\n\n\"The widespread destruction and degradation of productive assets, coupled with the ongoing blockade, have left extremely limited space for any form of domestic food production,\" the IPC said in its report in mid-May.\n\nIn addition, the contributing factors of critical deficiencies in the availability of clean water, sanitation, and hygiene, which bear the marks of a two-decade-long blockade, and the prolonged shortage of healthy and nutritious foods, such as fresh fruit, vegetables, meat, and dairy products, have only exacerbated the risk of disease and other health consequences.Over the past 19 months, 75 percent of Palestinians with a reliance on food aid have been eating no more than two food groups per day, hindering nutrient and protein intake.\n\n\"Israel’s military has simultaneously destroyed Gaza’s agricultural production capacity and decimated Palestinians’ livelihood reserves. Gaza’s fragile food basket, bakeries, fishing boats, food storage warehouses, and emergency kitchens have all been targeted,\" Mads Gilbert, James Smith and Dr Ghassan Abu-Sittahwrote in a joint opinion articlein early May.\n\nStarving a population during a time of war has long been used as a tactic by warring parties to force surrender or to annihilate a population.\n\nHowever, International Humanitarian Law (IHL), specificallyArticle 54in the Geneva Convention, is unequivocal in its prohibition of starvation as a war strategy.\n\nArticle 54 also prohibits the destruction of objects or material indispensable to the survival of the civilian population, including denying access to humanitarian aid intended for civilians in need and deliberately impeding humanitarian aid.\n\nIsrael has been repeatedly found inbreachof Article 54 over the course of the past 19 months.\n\nIt has shut down Gaza's access toelectricityandwater, and restricted the entry of essential energy,aid, food and medicinal supplies.\n\nIt has also killed Palestinians as they assembled to receive supplies, with one of the more infamous incidents being termed the \"Flour Massacre\".\n\nAs early as December 2023, human rights experts began accusing Israel of intentionally starving Palestinians as a part of a \"genocidal\" project across the Gaza Strip.\n\nBy July 2024, around 33 children, mostly in northern Gaza, had died from symptoms associated with malnutrition, prompting UN experts to accuse Israel of weaponising food and aid as a form of collective punishment, which constituted starvation crimes, and therefore war crimes.\n\nSeveral Israeli leaders, including Prime Minister Benjamin Netanyahu and his former Defence Minister Yoav Gallant, have been accused of alleged war crimes and crimes against humanity committed since the Hamas-led attacks on southern Israel on 7 October 2023.Warrants are still out for their arrest.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Palestinian woman buries husband alone after two months trapped under Israeli siege",
    "url": "https://www.middleeasteye.net/news/palestinian-buries-husband-alone-after-two-months-trapped-under-israeli-siege",
    "published": null,
    "content": "In a garden in southern Gaza underIsraeliattacks, Aziza Qishta dug a grave with her bare hands.\n\nWith no shroud, the 65-year-oldPalestinianwrapped her husband’s body in a window curtain and buried him alone.\n\nIbrahim Qishta, 70, had died after being struck in the neck by shrapnel during Israel’s military incursion into Rafah earlier this year.\n\nFor two months, the couple remained trapped in their home in Khirbet al-Adas, surviving off dwindling supplies as air strikes and shelling pounded the city.\n\nWhen neighbours fled, Ibrahim refused to be displaced, and his wife refused to leave him behind.\n\nSince Israel broke the Gaza ceasefire in March, the army has killed nearly 4,000 Palestinians, bringing the death toll since October 2023 to over 54,000.\n\nIn the following account, Aziza tells her story to the Middle East Eye.\n\nWhen the Israeli army re-invaded Rafah in March and imposed a full siege, all of Aziza’s children fled the area. Ibrahim, however, refused to leave.\n\n“He was blind, unable to move on his own,” Qishta told MEE.\n\n“He told me: ‘I’m not leaving the house, and you’ll stay with me.’”\n\nHer reply was unwavering: “Of course. I won’t leave you after 50 years together. Never.”\n\n\n\n\n\n\n\nFor two months, they remained in the house.\n\nWith movement impossible and supplies scarce, they survived on stored provisions - canned food, beans, rice, lentils, vermicelli, jam, and pasta.\n\nWater was fetched from a nearby building whenever possible.\n\n“Day and night, we were surrounded by shelling - east, north, west,” she said. “The worst was from the west.”\n\nThey could hear Israeli gunfire, jets, and tanks all around them.\n\n“We couldn’t move,” she explained.\n\nEven when her son’s house next door was bombed and collapsed, they stayed put. “My husband insisted on staying, and I stayed with him.”\n\nHer cousins were in a nearby house that was also hit.\n\n“It collapsed on them. More than 10 of them are still under the rubble today.”\n\n'I had no one to help me'\n\n- Aziza Qishta, Palestinian woman\n\nThen, one day, a loud explosion struck the building’s iron gate.\n\n“Dust filled the house. When it cleared, I saw the house around us had been destroyed,” Qishta said.\n\nOnly a single room and a bathroom were left.\n\n“Suddenly, I saw my husband bleeding from his neck - he had been hit by shrapnel.”\n\nWhen she spotted the injury, she rushed to him, tending to his wound, washing his face, applying antiseptic, and wrapping him up.\n\nDespite his heavy weight, she lifted him onto her back.\n\n“I had no one to help me. We moved slowly. I would stop to let him rest, then continue,” she explained.\n\nFor five hours, Ibrahim continued to bleed. “We were alone. No voices, no light.”\n\nEventually, she reached her cousin’s house and laid him down on a mattress.\n\n“I said: ‘Let me get you some food,’ but he refused.” He accepted only a spoonful of honey and later asked for some water. “Then he said: ‘Pour some water on my head.’”\n\nAziza stayed by his side throughout.\n\n“I laid him down, sat next to him, never leaving his side.”\n\nShe noticed his left hand trembling and offered to massage it. “He said: ‘No, leave it.’ Then suddenly, it went limp.” When she looked at his face, he had passed away.\n\n“There were no soldiers around,” she said.\n\n“They come, bomb, and leave.”\n\n\n\n\n\n\n\nAlone, she searched the garden and found a small hole near an olive tree. With no shroud, she used a window curtain to wrap his body and began to roll him into the hole by herself.\n\n“I placed his body in a plastic bag and continued rolling him gently. It took me two hours of exhaustion. But God gave me strength.”\n\nShe buried him with her own hands, covering the body first with a zinc sheet, then wood, and finally soil.\n\n“I recited Ayat al-Kursi and Surah Yasin from the Quran over him and wept silently.”\n\n'I recited Ayat al-Kursi and Surah Yasin from the Quran over him and wept silently'\n\n- Aziza Qishta\n\nAfter the burial, she returned home.\n\n“I bathed, and for the first time in two months, I slept deeply from sheer exhaustion.”\n\nIbrahim was killed on 10 May but Aziza remained alone in the house for another two weeks, until 24 May, when the last of the food and water ran out.\n\nThat day, she began to suspect that the grave might have been bombed. “I heard the buzzing of drones and gunfire.”\n\nThe following day, she went to check. “I found the zinc pierced with bullets, and his head exposed.”\n\nHer voice heavy, she recalled: “My heart broke. I picked up his head, it felt as light as a loaf of bread, and returned it to the grave, dug a bit deeper, added a new piece of zinc and wood, and buried him again.”\n\nShe said she didn’t feel fear or hesitation, “just pain, and patience”.\n\n“I returned home, made a cup of tea, and had a simple breakfast,” she said. “I had just 250 millilitres of clean water left.”\n\nEventually, she decided to leave and confront the Israeli army. Carrying a stick with a white cloth and two small bags, she walked to a military checkpoint.\n\n“They told me to stop and threw me a leaking water bottle,” she said. “Then a tank approached and threw another.”\n\nOrdered to empty her bags, which held some medicine and clothes, she was then told: “We want to take your photo.”\n\nWhen she explained she was wearing a hijab, they demanded she remove it.\n\n“I refused. A soldier shouted, and about twenty of them pointed guns at me, saying: ‘If you don’t remove it, we’ll kill you.’ So I removed it, broken.”\n\nThey made her walk with them but after ten minutes, she told them she was too tired to continue, so they placed her in a jeep.\n\n“One soldier spoke Arabic. He asked my name and about my children. I told him I had four sons and nine daughters. He asked why my husband hadn’t left earlier. I said: ‘He refused, and I couldn’t leave him.’”\n\nThey told her to wait under a palm tree, but she insisted on moving. They left her near a place called Marj, where she then got lost for four hours.\n\nShe said she then found an aid centre run by the Israeli army and an American company.\n\n“They told me: ‘Head north. Don’t go east or west.’”\n\nEventually, she reached a camp for displaced people, near Rafah. “They told me to head for Khan Younis.”\n\nOn the way, she met four young men.\n\n“I gave them my name. They called the Qishta family, my family, and they came to get me.”\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Carbon footprint from Israel's war on Gaza exceeds 100 countries",
    "url": "https://www.middleeasteye.net/news/carbon-footprint-israels-war-gaza-exceeds-100-countries",
    "published": null,
    "content": "The carbon footprint fromIsrael’s war on Gaza will exceed the emissions of around 100 countries, according to new research.\n\nA studypublishedby the Social Science Research Network, firstreportedby The Guardian on Friday, found that the climate cost of Israel’s destruction of the Palestinian enclave, clearing debris and rebuilding the territory could exceed 31m tonnes of carbon dioxide equivalent.\n\nThat is more than the annual 2023 emissions of many countries, including Costa Rica, Afghanistan and Zimbabwe.\n\nThe study found that Hamas’ rockets and bunker fuel made up for 0.2 percent of those emissions, while the supply and use of weapons, tanks and other ordnance by Israel made up 50 percent.\n\nIt found that the overall impact of Israel’s wars on Gaza andLebanon, as well as its recent military confrontations withYemenandIran, was equivalent to running 84 gas power plants for a year.\n\nIt is the third such study looking into the climate cost of Israel’s bombardment of Gaza.\n\n“This report is a staggering and sobering reminder of the ecological and environmental cost of Israel’s genocidal campaign on the planet and its besieged people,” Zena Agha, policy analyst for Palestinian policy network Al-Shabaka, told The Guardian.\n\n“But this is also theUS,UKand EU’s war, all of which have provided seemingly limitless military resources to enable Israel to devastate the most densely populated place on the planet.”\n\nThe research found that 30 percent of greenhouse gas emissions since the war began came from the US sending 50,000 tonnes of weapons and supplies to Israel.\n\nA further 20 percent was attributed to Israeli aircraft reconnaissance and bombing campaigns, as well as fuel from tanks and other military vehicles.\n\nAround 7 percent of emissions from the conflict were from diesel-guzzling generators in Gaza, whichPalestiniansrely on due to Israel’s blockade and the destruction of solar panels and the enclave’s only power plant.\n\nBefore the war, solar energy made up a quarter of Gaza’s electricity - one of the highest densities of rooftop solar panels in the world. Israeli forces have destroyed large swathes of that solar infrastructure.\n\nThe most significant cost to the climate will come from the reconstruction of Gaza, the study finds.\n\nRebuilding 436,000 apartments, along with hundreds of schools, mosques, clinics and other buildings - in addition to 5km of roads - will produce 29.4m tonnes of carbon dioxide equivalent.\n\nThe research used open-source data, media reports, and data from aid groups and UN agencies.\n\nThe actual climate cost of Israel’s war is likely to be much higher than the estimates, due to Israel’s media blockade masking the full extent of environmental damage to the enclave.\n\n“This conflict in Gaza shows that the numbers are substantial, greater than the entire greenhouse gas emissions of many entire countries, and must be included for accurate climate change and mitigation targets,” said Frederick Otu-Larbi, co-author of the report and lecturer at the University of Energy and Natural Resources in Ghana.\n\nCurrently, there is no obligation for states to report military emissions to the UN’s climate body.\n\nThe UN last year said that Israel’s war hadcreated a devastating environmental crisisin Gaza, destroying sanitation systems, leaving tonnes of debris from explosive devices and causing major pollution.\n\nIt found that water, sanitation and hygiene systems in Gaza were almost entirely defunct, with the strip's five wastewater treatment plants shut down.\n\nIsrael's war is exacerbating an already deteriorating environment in Gaza, where over 92 percent of the water was deemed unfit for human consumption in 2020.\n\nClimate change and Israel's attacks on environmental infrastructure have long plagued Gaza and other parts of occupied Palestine.\n\nAfter the Nakba - the ethnic cleansing and destruction of Palestinian communities in 1948 by Zionist forces - the Jewish National Fund (JNF) planted monoculture forests of pine trees, often on the ruins of Palestinian villages.\n\nThe Society for the Protection of Nature in Israel revealed in 2013 that the JNF's projects had a devastating impact on local biodiversity.\n\nIn 2021, Fadel al-Jadba, director of the horticulture department at the Palestinian Ministry of Agriculture,toldMiddle East Eye that there had been a noticeable decline in agricultural production over the past decade.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  }
]