[
  {
    "source": "Middle East Eye",
    "title": "Ireland stands by claim Israel committing genocide in Gaza",
    "url": "https://www.middleeasteye.net/news/ireland-says-israel-carrying-out-genocide-gaza",
    "published": null,
    "content": "Ireland'sTanaiste, or deputy prime minister, Simon Harris, defended the government's position on Thursday that Israel is carrying out a genocide inGaza, Irish broadcaster RTE reported.\n\n\n\n“We are the first government in the European Union (EU) to say what Israel is doing is genocide. It is genocide,\" Harris told an opposition lawmaker during a heated exchange in parliament, known as the theDáil.\n\nCatherine Connolly, an independent, accused the government of not doing enough to punish Israel for its 19-month-long war on Gaza, which has killed more than 54,000 Palestinians, more than half of them women and children, according to the Palestinian health ministry.\n\n“I’m disgusted and sickened, sickened - watching children dying on our television screens and every day I come to work, and work with all the people in here to do our best to show leadership at a time of horrific conflict,\" Harris said.\n\n“We’re working to support the people of Palestine and the only chamber I ever go into in the entire world where people don’t acknowledge that Ireland, the government, the people of Ireland, are standing with the people of Palestine, standing up for human rights, standing up for international law, is here when you get up and distort - with your ideology - the actions of this government.\"\n\nIreland recognised Palestinian statehood one year ago, and in January, it joined South Africa's genocide case against Israel at the International Court of Justice (ICJ).\n\nOn Thursday, Harris said that a bill banning trade with goods from Israeli settlements - deemed illegal under international law - would move to the foreign affairs committee next month, the Irish Times said.\n\nThe government is also under pressure tohelp remove the Central Bank’s role in permitting the sale of Israel bonds in the EU, and to stop any flights over Ireland that may be carrying weapons to Israel, the paper reported.\n\n\n\n“I’m proud of the people of this country. I’m proud that we went into an election, and it didn’t matter what party you were in, you stood up and said, ‘We are going to support the people of Palestine’.\"\n\nHarris's stance was backed by thetaoiseach - or prime minister, Micheal Martin, earlier in the week.\n\n“We have been very consistent in our support to the Palestinian people and their right to self-determination, and in condemning the war crimes and the genocide that is occurring right now,” Martin told the Dail.\n\n“The focus has to be relentlessly on the policies of Prime Minister Netanyahu and the Israeli government, made up of extreme far-right elements who are committing genocide in Gaza right now.\"\n\n\n\nIn 2018, the Occupied Territories Bill was introduced in Ireland by Independent Senator Frances Black, proposing a ban on trade with businesses operating in illegal Israeli settlements on Palestinian land, but it was ultimately blocked over concerns about breaching EU trade rules.\n\nHowever, anadvisory opinionfrom the ICJ in July marked a turning point in reconsidering the enactment of the Irish bill.\n\nThe ICJ concluded that Israel's presence in the occupied Palestinian territories is \"unlawful” and the country should “end its presence in the occupied Palestinian territory as rapidly as possible”.\n\nMore than 400 of Ireland’s senior legal academics and practising lawyers have called on thegovernmentto enact the bill in its original form, prohibiting all goods and services in the occupied West Bank, such asAirbnb.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "UN and aid groups condemn US-Israeli initiative after deadly scenes in Gaza",
    "url": "https://www.middleeasteye.net/news/un-and-aid-groups-condemn-us-israeli-initiative-after-deadly-scenes-gaza",
    "published": null,
    "content": "The United Nations and aid groups have spoken out after threePalestinianswere killed byIsraelifire and dozens injured at an aid distribution point set up by an Israeli-US-backed initiative.\n\nThere werechaotic scenes in Rafah, southern Gaza, on Tuesday as starving Palestinians rushed inside a facility holding aid, due to long delays conducting security checks on recipients.\n\nIsrael’s military opened fire on the crowds as they rushed in, killing at least three Palestinians.\n\nAt least 47 others were wounded and seven missing, according to Palestinian authorities in Gaza and the UN.\n\nThe Gaza Humanitarian Foundation (GHF) denied such reports, while the Israeli military said it fired “warning shots” and later re-established control of the facility.\n\nAccording to Israeli media, Americans affiliated with the GHF had to be rescued once they lost control of the facility.\n\nUN spokesperson Stephane Dujarric described the scenes as “heartbreaking, to say the least”.\n\n“We and our partners have a detailed, principled, operationally sound plan - supported by member states - to get aid to a desperate population,” Dujarric told reporters.\n\n“We continue to stress that a meaningful scale-up of humanitarian operations is essential to stave off famine and meet the needs of all civilians, wherever they are.”\n\nDujarric added that aid needed to be distributed in a way that was independent and impartial.\n\n“We saw the plan that [the GHF] published and that they presented to us, and it is not done with the parameters that we feel match our principles, which we apply across the board, from Gaza to Sudan to Myanmar, to anywhere you want to talk about.”\n\nPhilippe Lazzarini, head of Unrwa, the UN agency for Palestinian refugees, said Israel’s model for providing aid was wasteful and a “distraction from atrocities”.\n\n“The model of aid distribution proposed by Israel does not align with core humanitarian principles,” Lazzarini said on Wednesday.\n\n“We have seen yesterday the shocking images of hungry people pushing against fences, desperate for food. It was chaotic, undignified and unsafe.”\n\nAhmed Bayram of the Norwegian Refugee Council called on Israel and the US to scrap the initiative.\n\nHe said: “This is not how aid is done; this is not how aid should be distributed, not least obviously an occupier doing that - a country that has destroyed and flattened Rafah, asking people to come back to Rafah, that has displaced people out of Rafah, and now tells them to come back and receive whatever they can get hold of.”\n\nThe GHF said in a statement that it had distributed 8,000 food boxes, which it said amounted to around 462,000 meals.\n\nIsraeli Prime Minister Benjamin Netanyahu played down the chaotic scenes.\n\n“There was some loss of control momentarily. Happily, we brought it back under control,” he said.\n\nHe also went on to falsely claim that there was no proof of malnutrition in Gaza, stating: “You don’t see one, not one emaciated [person] from the beginning of the war to the present.”\n\nThe GHF is an Israeli-backed organisation established in early 2025 to manage a new model of humanitarian aid distribution in the Gaza Strip.\n\nIt was incorporated in Switzerland in February 2025, with a US-based counterpart also registered.\n\nThe organisation presented itself as an independent and neutral body, aiming to deliver aid directly to Palestinian civilians through a network of four secure distribution sites in southern and central Gaza.\n\nAccording to the GHF, the aid distribution sites are managed by private US security and logistics firms, including UG Solutions and Safe Reach Solutions (SRS), that are responsible for securing distribution hubs and overseeing vehicle checkpoints.\n\nBoth SRS and UG Solutions have faced scrutiny regarding their legitimacy and transparency. Critics, including Israeli opposition leader Yair Lapid, have suggested that these entities might be “shell companies” designed to obscure Israeli government involvement and funding in the aid process.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Why I support the UK taking a more nuanced position on Hamas",
    "url": "https://www.middleeasteye.net/opinion/why-i-support-uk-taking-more-nuanced-position-hamas",
    "published": null,
    "content": "The reputation of Hamas sank to its lowest point after its attack on 7 October 2023, in which1,200 Israelisand foreigners were killed and251 taken hostage.\n\nInIsrael, this attack provoked a tsunami of anger, strident calls for revenge, demands for the ethnic cleansing of Gaza, and a national consensus in support of the total eradication of Hamas. The result has been the longest, deadliest and most ruinous war in the history of the Arab-Israeli conflict.\n\nHamas is a social movement and political organisation with a military wing,al-Qassam Brigades. The military wing was proscribed by theBritishgovernment as a terrorist organisation in March 2001, and in November 2021, former Home Secretary Priti Pateladded the political organisationto the list of proscribed groups.\n\nThis decision marked an abrupt reversal of the government’s previous policy, which made a clear distinction between Hamas’s political and military wings.\n\nPatel, a staunchsupporter of Israel, argued, unconvincingly in my opinion, that the distinction between the two wings was no longer tenable. For its part, Israel has always denied that there is any difference between the two wings.\n\nIn August 2017, as secretary of state for international development, Patelwent on a tripto Israel accompanied by Lord Polak, honorary president of Conservative Friends of Israel (CFI) and a major fund-raiser for the Tory party. She had previously served as an officer for CFI’s parliamentary group between2011 and 2014.\n\nWhile pretending to be on a private holiday, Patel held12 secret meetingswith high-ranking Israeli officials, including Prime Minister Benjamin Netanyahu.\n\nUpon her return, she asked her officials toexplore the possibilityof diverting some of the foreign aid budget to enable the Israeli army to carry out humanitarian work in the occupied Golan Heights. She was subsequentlyforced to resignfor concealing the nature and purpose of her trip to Israel.\n\nIn 2019, then-Prime Minister Boris Johnson rehabilitated Patel by appointing her ashome secretary. Johnson shared her Manichean view of the Middle East struggle, in which Israel represents the forces of light andPalestiniansthe forces of darkness.\n\nThe change of policy towards Hamas was announced not by the foreign secretary, but by the home secretary. Patel said that designating the whole of Hamas as a terrorist organisation should be seen through a domestic prism: it would help toprotect Jewsin this country.\n\nThis argument is baseless. Hamas does not carry out operations outside Israel and the occupied Palestinian territories, it has no presence in Britain, and it poses no threat to British Jews in this country.\n\nFollow Middle East Eye's live coverage of the Israel-Palestine war\n\nHamas’s 2017 “Document of General Principles and Policies” (unlike the 1988 Hamas Charter)explicitly distinguishesbetween Judaism as a religion and Zionism as a political project. It affirms that Hamas’s conflict with Israel is due tooccupation, not religion, and states that it would accept the creation of a Palestinian state within the 1967 borders without recognising Israel.\n\nHamas has now instructed Riverway, a London law firm, tomake an applicationto the home secretary to remove the government’s designation of the movement as a proscribed terror group and recognise its legitimate role as a Palestinian resistance movement engaged in a struggle for self-determination and liberation.\n\nThe application is made byMousa Abu Marzouk, the former head of Hamas’s political bureau. I am among 19 experts supporting this legal filing through reports on the history and context of Palestinian dispossession. My report describes the central role played by Britain in facilitating this dispossession, from theBalfour Declarationof 1917 up until the present.\n\nWestern media outlets have relied heavily on the Israeli narrative of 7October,includingits countless false allegations and outright fabrications, such as the story of 40 decapitated babies, while under-reporting the Palestinian side of the story.\n\nOne of Abu Marzouk’s most significant correctives to the dominant narrative concerns the background to the Hamas-led 7 October attack. According to him, Hamas sought to achieve specific military objectivesduring the operation, with clear instructions not to target women, children and the elderly.\n\nSince deviations from these instructions admittedly occurred, Hamas isprepared to cooperatewith the International Criminal Court and any other neutral third party in an independent and transparent investigation into the events of that day. This position stands in sharp contrast to Israel’s denial of journalists’ entry into Gaza, and its refusal to allow any independent investigation of the atrocities and war crimes committed by its forces.\n\nTo explain Hamas’s behaviour is not to justify it. Killing civilians is wrong, period. But here, as always, the context is all-important. The attack of 7 October did not occur in a vacuum. It occurred against the backdrop of decades of brutal and suffocating military occupation. Moreover, as a people living under unlawful military occupation, Palestinians have a right to resist, including the right to armed resistance.\n\nIn effect, labelling Hamas’s political leaders as terrorists pure and simple gives Israel a free pass to inflict death and destruction on Gaza without being held to account. The terrorist framing also stands in the way of a more balanced and nuanced understanding of the history, motives, policies and principles of Hamas.\n\nThe Hamas side of the story is hardly ever heard in the West, yet it makes a compelling reason for removing its political wing from the list of proscribed organisations.\n\nHere are some of the most relevant facts: in January 2006, Hamaswon a clear victoryin fair and free all-Palestine elections, and proceeded to form a government. Israel refused to recognise this government and resorted to a series of draconian measures to undermine it, supported by theUnited Statesand European Union.\n\nIn March 2007, Hamas formed aunity governmentwith its rival party Fatah, but Israel refused to negotiate with them. Instead, Israel and the US encouraged Fatah to stage a coup todrive Hamas out of power. Hamas pre-empted the Fatah coup by seizing power in Gaza, which led to Israel imposing a blockade on the enclave - a form of collective punishment proscribed by international law - which remained in force for 16 years before the Hamas attack on 7 October.\n\nThe home secretary would do well to read the 700 pages of evidence that underpin this application for deproscription before making up her mind\n\nThe distinction between the political and military wings of Hamas has always been crucial. Patel’s decision to proscribe Hamas in its entirety was a politically motivated move that disregarded Hamas’s democratic road to power and its growing politicalmoderationonce in power.\n\nCasting the whole of Hamas as a terrorist organisation also served to bolster Israel’s hardline position, its refusal to negotiate, and its reliance on brute military force. Proscription by Britain and other western powers in effect endorsed Israel’s refusal to put Hamas’s willingness to compromise to the test.\n\nIsrael’s recurrent military offensives in Gaza since 2008 are chillingly described by its generals as “mowing the lawn”. Under this grim rubric, the next war is always just around the corner. In the post-7-October military offensive, Israel has gone much, much further than ever before, committing the crime of crimes: genocide.\n\nAs Abu Marzouk points out in his witnessstatement, Britain is not an innocent bystander in the genocide that is unfolding before our eyes in Gaza. The Israeli-Palestinian conflict was made in Britain. Britain was the colonial power that enabled the Zionist settler-colonial movement to embark on the systematic takeover of Palestine.\n\nThe war in Gaza is the latest and cruellest phase in this long-term colonial effort to displace, dispossess and ethnically cleanse the Palestinian people. Hamas is a vital segment of Palestinian society and the vanguard of its resistance to Israel’s illegal occupation.\n\nDeproscribing the political wing of Hamas would constitute a small step towards rectifying a monumental historical wrong. The home secretary would do well to read the 700 pages of evidence that underpin this application for deproscription before making up her mind.\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Eye.The purpose of this article is to set out the author’s reasons for supporting Abu Marzouk’s application. Nothing in this article should be understood as inviting or otherwise encouraging readers to support, or express support for, Harakat al-Muqawamah al-Islamiyyah (Hamas).\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "French scholar acquitted of ‘apology for terrorism’ charges after Palestine tweets",
    "url": "https://www.middleeasteye.net/news/french-professor-acquitted-apology-terrorism-charges-after-palestine-tweets",
    "published": null,
    "content": "Francois Burgat, a renowned French specialist on thePalestinian-Israeli conflictand political Islam, was acquitted on Wednesday by the criminal court of Aix-en-Provence, in southeasternFrance, where he was prosecuted on charges of “apology for terrorism” for messages posted on social media.\n\nThe prosecution accused the former research director at the National Centre for Scientific Research and former director of the French Institute for the Near East, now retired, of a series of controversial social media posts concerning Hamas andIsrael’swar on Gaza.\n\nDuring the trial in April, the prosecutor asked for an eight-month suspended prison sentence, a $4,500 fine, a six-month ban from social media and a two-year ineligibility period against Burgat.\n\nSpeaking to Middle East Eye, Burgat praised a \"wise lucidity from the court\", but expected the prosecution to appeal.\n\n\"Let's hope that this wisdom, which several dozen of my compatriots convicted without any justification in the same type of case have not benefited from, will henceforth become the guiding principle of the French judicial system,\" he said.\n\nThe casebeganwith a post the scholar published on X (formerly Twitter) on 2 January 2024, where he shared a statement by Hamas following the publication of a New York Times investigation into sexual violence allegedly committed by thePalestiniangroup during its 7 October attacks in Israel.\n\nIn the statement, Hamas rejected the accusations and denounced a \"Zionist attempt to demonise the [Palestinian] resistance\".\n\n‘Let's hope that this wisdom... will henceforth become the guiding principle of the French judicial system’\n\n- Francois Burgat\n\n\"Our fighters are fighters for freedom and dignity and cannot commit such shameful acts,\" Hamas said in the statement shared by Burgat.\n\nIn response to internet users who condemned his post, the former academic wrote that he had \"infinitely more respect and consideration for the leaders of Hamas than for those of the state of Israel\".\n\nHe thenposteda page from one of his books explaining \"the context in which [his] respect and admiration for Hamas asserted themselves\".\n\nIn aninterviewthat week, he also declared: \"Just because I have to acknowledge that there was a terrorist movement on 7 October doesn't mean I have to criminalise the Palestinian liberation movement.\"\n\nFor these comments, a complaint was filed by the European Jewish Organisation, a group founded in 2014 that has taken several legal actions for \"apology for terrorism\" in the name of fighting antisemitism and anti-Zionism.\n\nIn July 2024, Burgat was placed in police custody for seven hours following a report from the DGSI, the main French domestic intelligence service.\n\nA new charge was added in December 2024 after Burgat defended two individuals who were accused of launching a hate campaign that led to the killing of teacherSamuel Patyin October 2020 and convicted of complicity in terrorist assassination.\n\nBurgat wrote at the time that France had \"fallen outside the rule of law\" and criticised the ruling as meaning that \"we are all 'terrorists'.\"\n\nDuring his trial in April, whenaskedby the judge whether he thought \"Hamas is a terrorist movement\", the scholar replied that he had \"never congratulated” the group for the 7 October attacks.\n\n“On that day, [Hamas] committed acts that can be labelled terrorist; but we must not extrapolate to its entire history,\" he said.\n\nBurgat told MEE he hadaskedChatGPT if he had any chance of being convicted for \"apology for terrorism\".\n\nThe artificial intelligence programme responded: \"Your comments, however critical or provocative they may appear in the public debate, generally fall within the scope of political and geopolitical analysis, which is protected by freedom of expression and research.\"\n\nChatGPT concluded that \"a conviction is not likely, either legally or constitutionally,\" but offered a warning: \"However: The current political context (polarised around Islam, the Israeli-Palestinian conflict or secularism) can lead to manipulation or abusive prosecution, including against intellectuals.\"\n\nAs an increasing number of people are being prosecuted worldwide for expressing their solidarity with Palestinians, Burgat's defence team denounced the prosecution as an attack on freedom of expression and the political manipulation of the justice system.\n\n\"There are two offences that are systematically charged against those who express their solidarity with Palestine: either incitement to hatred or apology for terrorism,\" Rafik Chekkat, one of Burgat’s lawyers,said.\n\nIn a message posted on X, Chekkat expressed hopes that \"this acquittal will lead to others\".\n\n\"I hope the decision regarding Francois Burgat will help change the repressive climate regarding Palestine and slow the pace of prosecutions for apology for terrorism,\" hesaid.\n\nSince October 2023, there has been a marked rise in the use of the \"apology for terrorism\" offence in France, with authorities launching hundreds of investigations into comments made about the war in Gaza, including by political figures such as left-wing France Unbowed (LFI) MPMathilde Panotand future MEPRima Hassan.\n\nJean-Paul Delescaut, leader of the General Confederation of Labour union, was handed a suspended one-year jail sentence for writing in response to the attacks: “The horrors of illegal occupations… are receiving the responses they provoked.”\n\nOn 18 June, Anasse Kazib, a railway worker and spokesperson for the Trotskyist political group Revolution Permanente, will also be tried for \"apology for terrorism\".\n\nOn X, Kazibposted: \"Very happy for Francois Burgat, this is important news in the fight against the criminalisation of supporters of the Palestinian people. I hope that we will all be released tomorrow like François Burgat and that the repression against those who speak out against the genocide will cease.\"\n\nBurgat’s acquittal comes as France has adopted a much more critical stance towards Israel in recent weeks, with President Emmanuel MacronlobbyingEuropean powers to recognise Palestinian statehood at a UN conference next month and agrowing numberof public personalities using the term \"genocide\" to describe Israeli actions in Gaza.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  },
  {
    "source": "Middle East Eye",
    "title": "Israeli foreign minister says arms embargoes will lead to 'second Holocaust' and end of Israel",
    "url": "https://www.middleeasteye.net/news/israels-foreign-minister-says-arms-embargoes-will-lead-second-holocaust",
    "published": null,
    "content": "Israel’s foreign minister has said that an arms embargo on his country would lead to the elimination of the Israeli state and “a second Holocaust”.\n\nGideon Saar wasspeakingon Tuesday at an international conference on antisemitism in Jerusalem.\n\n\"If, God forbid, the calls and actions of countries and politicians for an arms embargo on Israel succeed, the result will be the destruction of Israel and a second Holocaust,\" he said.\n\nThe comments came as Spain this week called on European countries to suspend arms shipments amid Israel’s ongoing siege on Gaza.\n\nAt a meeting of the “Madrid Group”, Spain’s foreign minister called for an immediate suspension of Europe’s cooperation deal with Israel and an embargo on arms shipments.\n\nGermany,France, theUK, Italy,Egypt,Jordan,Saudi Arabia,Turkey,Moroccoand Brazil were among those present at the meeting.\n\n“What is the meaning of actions or statements - by politicians or countries - to impose an arms embargo on Israel?” said Saar, in response.\n\n“If such moves succeed, Israel will simply be destroyed. There will be another Holocaust - on the soil of the land of Israel.”\n\n“This is essentially a way to deprive the Jewish people of the means to defend themselves. Means that they so lacked during the long years of exile and during the Holocaust.”\n\nThe largest suppliers of weapons to Israel are the United States, Germany and Italy.\n\nSeveral nations, including France, Spain and the UK, have either paused the supply of some weapons, or have suspended export licences.\n\nAreportearlier this month found that the UK continued to send a wide range of arms to Israel even after the government suspended 30 arms export licences in September.\n\nThe UK, France and Canada have threatened Israel with sanctions if it fails to stop its military operations in Gaza and immediately allow humanitarian aid to enter.\n\n\"We will not stand by while the Netanyahu government pursues these egregious actions,\" the countries said jointly on 20 May.\n\n\"If Israel does not cease the renewed military offensive and lift its restrictions on humanitarian aid, we will take further concrete actions in response.\"\n\nThe three countries also urged Israel to halt settlements in the occupied West Bank, saying they are \"illegal and undermine the viability of aPalestinianstate and the security of both Israelis and Palestinians\".\n\nIn response, Prime Minister Benjamin Netanyahuaccusedthe three governments of emboldening Hamas and being “on the wrong side of justice”.\n\nIsraeli attacks on Gaza have killed more than 54,000 Palestinians and wounded more than 120,000 since October 2023.\n\nCopyright © 2014 - 2025.Middle East Eye. All rights reserved.Only England and Wales jurisdiction apply in all legal matters.\n\nMiddle East Eye          ISSN 2634-2456"
  }
]