[
  {
    "source": "AP News",
    "title": "Oil and gas have boomed in New Mexico, but fumes from wells are affecting schoolkids",
    "url": "https://apnews.com/article/school-air-quality-natural-gas-d2e9bb105c68a11bb5ae31564706d8e7",
    "content": "COUNSELOR, N.M. (AP) — On a Tuesday in March, Billton Werito drove his son Amari toward his house in Counselor, New Mexico, navigating the bumpy dirt road that winds through a maze ofnatural gas pipelines, wellheads and water tanks. Amari should have been in school, but a bout of nausea and a dull headache kept him from class.\n“It happens a lot,” Amari explained from the backseat, glancing up from his Nintendo Switch. The symptoms usually show up when the sixth grader smells an odor of “rotten egg with propane” that rises from nearby natural gas wells and wafts over Lybrook Elementary School, where he and some 70 other Navajo students attend class. His little brother often misses school for the same reason.\n“They just keep getting sick,” Amari’s father, Billton, said. “I have to take them out of class because of the headaches. Especially the younger one, he’s been throwing up and won’t eat.” The symptoms are putting the kids at risk offalling further behind in school.\nStrong winds kick up dust as a facility in the Permian Basin flares natural gas east of Carlsbad, N.M., on Monday, May 19, 2025. (AP Photo/Susan Montoya Bryan)\n\nLybrook sits in the heart of New Mexico’s San Juan Basin, a major oil and gas deposit that, along with the Permian Basin in the state’s southeast, is supplying natural gas that meets much of the nation’s electricity demand.\nThe gas pulled from tens of thousands of wells in New Mexico has reaped huge benefits for the entire country. Natural gas has become a go-to fuel for power plants from coast to coast, sometimes replacing dirtier coal-fired plants and, by extension, improving air quality. Locally, oil and gas companies employ thousands of workers, often in areas with few other opportunities, all while boosting the state’s budget with billions in royalty payments.\n\nBut those benefits may come at a cost for thousands of students in New Mexico whose schools sit near oil and gas pipelines, wellheads and flare stacks. An Associated Press analysis of state and federal data found 694 oil and gas wells with new or active permits within a mile of a school in the state. This means around 29,500 students in 74 schools and preschools potentially face exposure to noxious emissions, since extraction from the ground can release unhealthy fumes.\n\nAt Lybrook, where Amari just finished sixth grade, fewer than 6% of students are proficient at math, and only a fifth meet state standards for science and reading proficiency.\nOther factors could help explain students’ poor achievement. Poverty rates are higher in some areas with high levels of gas development, and students at rural schools overall tend to face challenges that can adversely affect academic performance. AP’s analysis found two-thirds of the schools within a mile of an oil or gas well are low-income, and the population is around 24% Native American and 45% Hispanic.\nLoving Elementary School students participate in a science, technology, engineering and math lab supported by The Ripken Foundation and Devon Energy, in Loving, N.M., on Monday, May 19, 2025. (AP Photo/Susan Montoya Bryan)\n\nBut research has found student learning is directly harmed by air pollution from fossil fuels — even when socioeconomic factors are taken into account.\nThe risks go far beyond New Mexico. An AP analysis ofdata from the Global Oil and Gas Extraction Trackerfound over 1,000 public schools across 12 states that are within five miles of a major oil or gas field. Major fields are collections of wells that produce the highest amount of energy in a state.\n“This kind of air pollution has a real, measurable effect on students,” said Mike Gilraine, an economics professor at Simon Fraser University in Vancouver, Canada, who studies connections between air quality and student performance.\nA sign warns drivers of a school bus stop near an oilfield, on the outskirts of Loving, N.M., on Tuesday, May 19, 2025. (AP Photo/Susan Montoya Bryan)\n\nIn 2024, Gilraine co-wrote a study showing student test scores were closely associated with air contamination. Each measured increase in PM2.5, a type of pollution created from the burning of fossil fuels, was associated with a significant decline in student test scores, Gilraine found. Conversely, researchers have documented that reductions in air pollution have led to highertest scoresand fewerabsences.\n“To me, the surprise was certainly the magnitude of the effects” of air pollution on students, Gilraine said. “It’s hard to find a similar factor that would have such an impact on schools nationwide.”\nAmerica’s shift to natural gas has resulted in substantial increases in student achievement nationwide, Gilraine’s research shows, as it has displaced dirtier coal and led to cleaner air on the whole. But there has been little data on air quality across New Mexico, even as it has become one of the most productive states in the nation for natural gas. State regulators have installed only 20 permanent air monitors, most in areas without oil or gas production.\nIndependent researchers have extensively studied the air quality near schools in at least two locations in the state, however. One is Lybrook, which sits within a mile of 17 active oil and gas wells.\nIn 2024, scientists affiliated with Princeton and Northern Arizona universities conducted an air-monitoring study at the school, finding that levels of pollutants — including benzene, a cancer-causing byproduct of natural gas production that is particularly harmful to children — were spiking during school hours, to nearly double the levels known to cause chronic or acute health effects.\nThat research followed a 2021 health impact assessment conducted with support from several local nonprofits and foundations, which analyzed the effects of the area’s oil and gas development on residents.\nThe findings were startling: More than 90% of people surveyed suffered from sinus problems. Nosebleeds, shortness of breath and nausea were widespread. The report attributed the symptoms to the high levels of pollutants that researchers found — including, near Lybrook, hydrogen sulfide, a compound that gives off the sulfur smell that Amari Werito associated with his headaches.\nCommunity leader Daniel Tso speaks during an interview while standing outside a well pad in Counselor, N.M., Navajo Nation, on Tuesday, March 11, 2025. (Nadav Soroker/Searchlight New Mexico via AP)\n\nThose studies helped confirm what many community members already knew, said Daniel Tso, a community leader who served on the committee that oversaw the 2021 health impact assessment.\n“The children and the grandchildren need a safe homeland,” Tso said during an interview in March, standing outside a cluster of gas wells within a mile of Lybrook Elementary.\n“You smell that?” he said, nodding towards a nearby wellhead, which smelled like propane. “That’s what the kids at the school are breathing in. I’ve had people visiting this area from New York. They spend five minutes here and say, ‘Hey, I got a headache.’ And the kids are what, six hours a day at the school breathing this?”\nLybrook school officials did not respond to requests for comment.\nResearchers have identified similar air quality problems in New Mexico’s southeast.\nIn 2023, a team of scientists from a coalition of universities conducted a detailed, yearlong study of the air in Loving, a small town in the Permian Basin. Local air quality, researchers found, was worse than in downtown Los Angeles, and the tested air contained the fifth-highest level of measured ozone contamination in the U.S.\nThe source of the ozone — a pollutant that’sespecially hazardousto children — was the area’s network of gas wells and related infrastructure. Some of that infrastructure sits within a half-mile of a campus that houses Loving’s elementary, middle and high schools.\nA small group of residents has spoken out about the area’s air quality, saying it has caused respiratory problems and other health issues. But for most locals, any concerns about pollution are outweighed by the industry’s economic benefits.\nRepresentatives of the oil and gas industry have claimed the air quality studies themselves are not trustworthy.\n“There needs to be a robust study to actually answer these questions,” said Andrea Felix, vice president of regulatory affairs for the New Mexico Oil and Gas Association (NMOGA). Felix said other sources of emissions, such as cars and trucks, are likely a larger source of air quality problems near wells.\n“Companies follow the best available science” for well placement and emissions controls, Felix said, and also contribute huge amounts of money to the state’s education budget. In the most recent fiscal year, oil and gas revenue supported $1.7 billion in K-12 spending in New Mexico, according to a NMOGA report.\nSuperintendent Lee White shares a hug with teacher Vanessa Calderon in the hall of the elementary school in Loving, N.M., on Monday, May 19, 2025. (AP Photo/Susan Montoya Bryan)\n\nOfficials with Loving Municipal Schools are also skeptical of the alarm over the wells. Loving Superintendent Lee White said the school district used funds from the oil and gas industry to pay for a new wing at the elementary school, a science lab for students, turf on the sports field and training and professional development for teachers. He said the industry’s contributions to state coffers can’t be ignored.\n“Are we willing to give that up because people say our air is not clean?” he said during an interview. “It’s just as clean as anywhere else.”\nAs White spoke, a drill rig worked a couple of miles east of Loving’s elementary school while parents poured into the gymnasium to watch kindergartners collect their diplomas. White touted the district’s success, saying the elementary school scores above state averages for reading, math and science proficiency, while Loving’s high school students far outpace the state average for college and career readiness.\nKindergartners at Loving Elementary School line up for a procession during their graduation ceremony in Loving, N.M., on Tuesday, May 20, 2025. (AP Photo/Susan Montoya Bryan)\n\nBut environmental groups, attorneys and residents continue to push for limits on drilling near schools.\nThose efforts saw a boost in 2023, when New Mexico State Land Commissioner Stephanie Garcia Richard issued an executive order prohibiting new oil and gas leases on state-owned land within a mile of schools.\nIndustry representatives decried the move, saying it added potentially insurmountable costs and barriers to drilling operators. However, AP’s analysis found that relatively few wells would be impacted even if the rule applied to all of New Mexico; only around 1% of oil and gas wells in the state are within a mile of a school.\nA view of natural gas pipes installed above ground in a field at a well pad in Counselor, N.M., Navajo Nation, on Tuesday March 11, 2025. (Nadav Soroker/Searchlight New Mexico via AP)\n\nIn the years since, residents of areas where exploration is heavy have lobbied for legislation prohibiting gas operations within a mile of schools, regardless of land status. That bill died in committee during the most recent session of the New Mexico legislature.\nAdvocates have also sued the state over an alleged lack of pollution controls. That lawsuit is currently pending in state court.\n____\nAP journalist Sharon Lurye contributed to this report from New Orleans.\n___\nThis story has been corrected to reflect there are 1,000 public schools that are within five miles of a major oil or gas field in 12 states, not 13 states.\n____\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’sstandardsfor working with philanthropies, alistof supporters and funded coverage areas at AP.org."
  },
  {
    "source": "AP News",
    "title": "Boulder suspect backed off his initial plan to kill all in a group he called ‘Zionist,’ police say",
    "url": "https://apnews.com/article/molotov-cocktails-boulder-attack-injured-f2af62386989f6b79a5e1844a2c9dce5",
    "content": "BOULDER, Colo. (AP) — A man in Boulder disguised as a gardener whowounded 12 people in an attackon a groupholding their weekly demonstrationfor the release of Israeli hostages in Gaza had planned to kill them all but appeared to have second thoughts, according to authorities.\nMohamed Sabry Soliman had 18 Molotov cocktails but threw just two during Sunday’s attack in which he yelled “Free Palestine,” police said. He didn’t carry out his full plan “because he got scared and had never hurt anyone before,” police wrote in an affidavit.\nThe two incendiary devices he did throw into the group of about 20 people were enough to wound more than half of them, and authorities said he expressed no regrets about the attack.\nThe 45-year-old Soliman — whose first name also was spelled Mohammed in some court documents — planned the attack for more than a year and specifically targeted what he described as a “Zionist group,” authorities said in court papers charging him with a federal hate crime.\n“When he was interviewed about the attack, he said he wanted them all to die, he had no regrets and he would go back and do it again,” Acting U.S. Attorney J. Bishop Grewell for the District of Colorado said during a news conference Monday.\nFederal and state prosecutors filed separate criminal cases against Soliman, charging him with a hate crime and attempted murder, respectively. He faces additional state charges related to the incendiary devices, and more charges are possible in federal court, where the Justice Department will seek a grand jury indictment.\n\nSoliman is being held on a $10 million, cash-only bond, prosecutors said. His next court hearing is set for Thursday.\nAn FBI affidavit says Soliman told the police he was driven by a desire “to kill all Zionist people,” a reference to the movement to establish and protect a Jewish state in Israel.\nSoliman’s attorney, public defender Kathryn Herold, declined to comment after the hearing.\nSoliman was living in the U.S. illegally after entering the country in August 2022 on a B2 visa that expired in February 2023, Department of Homeland Security Assistant Secretary Tricia McLaughlin said in a post on the social platform X.\nThe burst of violence at the popular Pearl Street pedestrian mall in downtown Boulder unfolded against the backdrop of theIsrael-Hamas war, which continues to inflame global tensions and has contributed to a spike in antisemitic violence in the United States. The attack happened on the beginning of theJewish holiday of Shavuotand barely a week after a man who also yelled “Free Palestine” was charged withfatally shooting two Israeli Embassy staffersoutside a Jewish museum in Washington.\nThe victims who were wounded range in age from 52 to 88, and the injuries spanned from serious to minor, officials said.\nSix of the injured were taken to hospitals, and four have since been released, said Miri Kornfeld, a Denver-based organizer connected to the group. She said the clothing of one of those who remains hospitalized caught on fire.\nMembers of the volunteer group called Run For Their Lives were holding their weekly demonstration when the attack happened. Video from the scene captured by witness Alex Osante of San Diego shows people pouring water on a woman lying on the ground who Osante said had caught fire during the attack.\nOsante said that after the suspect threw the two incendiary devices, apparently catching himself on fire as he threw the second, he took off his shirt and what appeared to be a bulletproof vest before police arrived. The man dropped to the ground and was arrested without any apparent resistance in the video Osante filmed.\nThe Molotov cocktails were made up of glass wine carafe bottles or jars with clear liquid and red rags hanging out of the them, the FBI said.\n“He stated that he had been planning the attack for a year and was waiting until after his daughter graduated to conduct the attack,” the affidavit says.\nHe had gas in a backpack sprayer but told investigators he didn’t spray it on anyone but himself “because he had planned on dying.”\nSoliman also told investigators he took a concealed carry class and tried to buy a gun but was denied because he is not a legal U.S. citizen.\nAuthorities said they believe Soliman acted alone. He was also injured and taken to a hospital. Authorities did not elaborate on the nature of his injuries, but a booking photo showed him with a large bandage over one ear.\nSoliman, who was born in Egypt, moved three years ago to Colorado Springs, where he lived with his wife and five kids, according to state court documents. He previously spent 17 years living in Kuwait.\nMcLaughlin said Soliman filed for asylum in September 2022 and was granted a work authorization in March 2023 that had expired. DHS did not respond to requests for additional information.\n___\nTucker reported from Washington."
  },
  {
    "source": "AP News",
    "title": "What we know about the man charged in the attack in Boulder, Colorado",
    "url": "https://apnews.com/article/boulder-terror-attack-colorado-c90a20758b3ebee597c84eb296e44e91",
    "content": "BOULDER, Colo. (AP) — A man armed with a makeshift flamethrower and otherincendiary deviceslauncheda fiery attackon demonstrators in Colorado who were calling for the release of Israeli hostages in Gaza. Twelve people were injured and the FBI described the violence as a “targeted terror attack.”\nThe suspect, identified by the FBI as 45-year-old Mohamed Sabry Soliman, yelled “Free Palestine” during the attack Sunday, according to Mark Michalek, the special agent in charge of the FBI’s Denver field office. Authorities believe Soliman acted alone.\nLaw enforcement officials investigate after an attack on the Pearl Street Mall Sunday, June 1, 2025, in Boulder, Colo. (AP Photo/David Zalubowski)\n\nHe has been charged with multiple state counts and a federal a hate crime.\n\nAuthorities said the attacker targeted volunteers withRun for Their Lives, which organizes running and walking events to call for the immediate release of Israelis being held in Gaza. The hostages were captured by militants during an incursion into southern Israel in 2023 that precipitatedthe latest Israel-Hamas war.\n\nThe group gathered Sunday at the Pearl Street pedestrian mall, a four-block area in downtown Boulder frequented by tourists and students. Witnesses said the suspect first used the flame thrower, then threw two Molotov cocktails into the crowd. Soliman was arrested at the scene.\nVideo from the scene shows a shirtless Soliman shouting at onlookers while holding two clear bottles containing a transparent liquid. Another video shows a witness shouting: “He’s right there. He’s throwing Molotov cocktails,” as a police officer with his gun drawn advanced on the suspect.\nBoulder County District Attorney Michael Dougherty told reporters Monday that authorities uncovered 16 unused Molotov cocktails.\n\n\nOne witness, Alex Osante, said Soliman appeared to catch himself on fire during the attack. A booking photo shows him with a bandage over one of his ears. Police said he was taken to the hospital after he was arrested but haven’t described his injuries.\nLaw enforcement officials investigate after an attack on the Pearl Street Mall Sunday, June 1, 2025, in Boulder, Colo. (AP Photo/David Zalubowski)\n\nWitnesses said Soliman yelled “Free Palestine” as he launched the attack. An FBI affidavit said he confessed to the attack.\nHe told investigators “he wanted to kill all Zionist people and wished they were all dead,” that he specifically targeted the Run for Their Lives group and that he had researched and planned the attack for more than a year, according to the affidavit.\n“This act of terror is being investigated as an act of ideologically motivated violence based on the early information, the evidence, and witness accounts. We will speak clearly on these incidents when the facts warrant it,” FBI Deputy Director Dan Bongino said in a post on X.\nThe Israel-Hamas war has inflamed global tensions and contributed to a spike in antisemitic violence in the United States. A week earlier, two Israeli Embassy stafferswere shot to death in Washington, D.C.,by a man who yelled “I did it for Palestine, I did it for Gaza” as he was led away by police.\n\nSoliman participated in a brief court hearing Monday afternoon via video from the Boulder County jail.\nHe is charged federally with commission of a hate crime, which carries a sentence of life in prison when the charge includes attempted murder. Colorado state charges include 16 counts of attempted first-degree murder, two counts of using an incendiary device and 16 counts of attempted use of an incendiary device.\nA judge set a $10 million cash-only bond on the state charges.\nAdditional charges are possible in federal court. The Justice Department plans to seek a grand jury indictment.\n\nSoliman was born in Egypt and he moved three years ago to Colorado Springs, where he lived with his wife and five children, according to state court documents. He previously spent 17 years living in Kuwait.\nLaw enforcement officials dress to investigate after an attack on the Peark Street Mall Sunday, June 1, 2025, in Boulder, Colo. (AP Photo/David Zalubowski)\n\nTheDepartment of Homeland Securitysaid Soliman filed for asylum in September 2022 and has been living in the U.S. illegally since his visa expired in February 2023.\nSoliman worked as an Uber driver and had passed the company’s eligibility requirements, which include a criminal background check, according to a spokesperson for Uber.\nAn online resume under Suliman’s name says he was employed by a Denver-area health care company working in accounting and inventory control, with prior employers listed as companies in Egypt. Soliman listed Al-Azhar University, a historic center for Islamic and Arabic learning located in Cairo, on the resume.\n\nThe people injured in the Pearl Street attack range in age from 52 to 88. Their injuries — some serious and some minor — were consistent with reports of people being set on fire, Redfearn said.\nAuthorities initially said there were eight victims, but said four others later were identified.\nPhotos from the scene showed a burning woman lying on the ground in a fetal position and a man helping to put out the flames using a jug of water.\n“The immense wave of positive messages we’ve received is another signal of the health and strong spirits of our community,” Rabbi Yisroel and Leah Wilhelm, directors of the Rohr Chabad House at the University of Colorado said in a statement. “We encourage everyone to respond energetically to this attack bycelebrating Shavuotjoyously, by attending the reading of the Ten Commandments, and by recommitting to the heritage and traditions we hold so dear.”\n___\nRodriguez reported from San Francisco."
  }
]