[
  {
    "combined_title": "Defense Secretary Orders Review of Navy Ship Names Amid Controversy",
    "article": "Defense Secretary Pete Hegseth has directed the U.S. Navy to reconsider the names of several ships, including the USNS Harvey Milk, named after the slain gay rights leader, according to multiple reports. This decision has led to a wave of responses, with some criticizing the move as an attempt to erase diversity and inclusion from the military.\n\nThe review, as stated in an internal memo by Navy Secretary John Phelan, is targeted at “reestablishing the warrior culture” in the military, a key priority of the Trump administration. Pentagon Spokesman Sean Parnell emphasized that Hegseth is committed to ensuring that all Department of Defense installations and assets reflect the priorities of the Commander-in-Chief, the nation's history, and the warrior ethos.\n\nThe USNS Harvey Milk, a replenishment oiler, was named after Harvey Milk, who served as a sailor during the Korean War and was later forced out of the Navy for being gay. Milk made history as one of the first openly gay elected officials in the U.S., serving on the San Francisco Board of Supervisors in 1977. He, along with San Francisco Mayor George Moscone, was assassinated in 1978. The ship was christened under the Biden administration in 2021 and is currently undergoing maintenance in an Alabama shipyard.\n\nThe decision to review the ship's name has been met with criticism. Former House Speaker Nancy Pelosi, who represents San Francisco, described the move as \"spiteful\" and argued that it does not strengthen national security.\n\nPhelan has reportedly put together a small team to review potential name changes. The new name for the USNS Harvey Milk is expected to be announced by the end of June, coinciding with Pride Month. This move aligns with the Trump administration's broader efforts to purge policies and references related to diversity, equity, and inclusion. The Pentagon has not yet revealed the new name for the ship.",
    "source_1": {
      "url": "https://nypost.com/2025/06/03/us-news/hegseth-orders-the-name-of-gay-rights-activist-harvey-milk-scrubbed-from-navy-ship/",
      "content": "Defense Secretary Pete Hegsethhas ordered the Navy to review the names of several ships honoring the likes of slain gay rights leader Harvey Milk, abolitionist Harriet Tubman and late Supreme Court Justice Ruth Bader Ginsburg, according to multiple reports.\nNavy Secretary John Phelan indicated in an internal memo obtained by CBS News that the name review is aimed at “reestablishing the warrior culture” in the military, apriority of the Trump administration.\n“Secretary Hegseth is committed to ensuring that the names attached to all [Department of Defense] installations and assets are reflective of the Commander-in-Chief’s priorities, our nation’s history, and the warrior ethos,” Chief Pentagon Spokesman Sean Parnell said in a statement.\n“Any potential renaming(s) will be announced after internal reviews are complete,” he added.\nThe small teamPhelanhas assembled to go over potential name changes is expected to announce a new moniker for the USNS Harvey Milk – a replenishment oiler – by the end of June, gay pride month, according to the Associated Press.\nMilk, who served as a sailor during the Korean War, was forced out of the Navy for being gay.\nHe later became one of the first openly gay elected officials in American history, when he successfully ran to serve on the San Francisco Board of Supervisors in 1977.\nMilk and San Francisco Mayor George Moscone were both assassinated in 1978 by a disgruntled former city supervisor who opposed the gay-rights activist’s push to ban discrimination based on sexual orientation in public accommodations, housing and employment.\nThe USNS Harvey Milk, which provides support to carrier strike groups at sea, was christened under the Biden administration in 2021.\nIt is currently undergoing maintenance in an Alabama shipyard.\nFormer House Speaker Nancy Pelosi (D-Calif.), who represents San Francisco in the lower chamber, slammed the renaming as “spiteful” in a statement on Tuesday, arguing that it “does not strengthen our national securit"
    },
    "source_2": {
      "url": "https://apnews.com/article/harvey-milk-navy-ship-renamed-pride-month-d6cda5df15ee5bc066092d54c591c6f2",
      "content": "Copyright 2025 The Associated Press. All Rights Reserved.\nCopyright 2025 The Associated Press. All Rights Reserved.\nIn this image provided by the U.S. Navy, the John Lewis-class replenishment oiler USNS Harvey Milk (T-AO-206) conducts a replenishment at sea in the Atlantic Ocean, Dec. 13, 2024. (Mass Communication Specialist 2nd Class Maxwell Orlosky/U.S. Navy via AP))\nDefense Secretary Pete Hegseth listens during an event with President Donald Trump to sign executive orders regarding nuclear energy in the Oval Office of the White House, Friday, May 23, 2025, in Washington. (AP Photo/Evan Vucci)\n\n\n\n\nWASHINGTON (AP) —Defense Secretary Pete Hegsethhas ordered the Navy to rename the USNS Harvey Milk, a highly rare move that will strip the ship of the moniker of a slain gay rights activist who served as a sailor during the Korean War.\nU.S. officials say Navy Secretary John Phelan put together a small team to rename the replenishment oiler and that a new name is expected this month. The officials, who spoke on condition of anonymity to discuss internal deliberations, said the next name had not yet been chosen.\nThe change was laid out in an internal memo that officials said defended the action as a move to align with President Donald Trump and Hegseth’s objectives to “re-establish the warrior culture.”\nIt marks the latest move by Hegseth and the wider Trump administration topurge all programs, policies, books and social media mentionsof references to diversity, equity and inclusion. And it comes duringPride Month— the same timing as the Pentagon’s campaign toforce transgender troops outof the U.S. military.\nPentagon spokesman Sean Parnell said in a statement that Hegseth is “committed to ensuring that the names attached to all DOD installations and assets are reflective of the Commander-in-Chief’s priorities, our nation’s history, and the warrior ethos.”\nPhelan’s office did not respond to a request for comment on the decision, which was first reported by Military.com.\n\nTh"
    }
  }
]